{"id":105027,"date":"2020-01-22T15:53:27","date_gmt":"2020-01-22T15:53:27","guid":{"rendered":"https:\/\/financialcommission.com.co\/?p=105027"},"modified":"2020-01-28T12:58:33","modified_gmt":"2020-01-28T12:58:33","slug":"customer-complaint-dated-april-23d-2019","status":"publish","type":"post","link":"https:\/\/financialcommission.com.co\/2020\/01\/22\/customer-complaint-dated-april-23d-2019\/","title":{"rendered":"Customer Complaint Dated April 23d 2019","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Complaint Matter<\/p>\n<p style=\"text-align: justify;\">Mr. XXX has lodged his complaint with the Financial Commission on the following grounds:<\/p>\n<p style=\"text-align: justify;\">The Client used account # 5002454 for active trading in the Forex market. According to the Client, four positions on two different financial instruments were established on the specified account before the incident:<\/p>\n<p style=\"text-align: justify;\">29685032 2019.04.16 20:52:45 buy 0.4  nzdcad 0.9031 0.90273 0.908 2019.04.17 01:45:02  0.90035 0.96 -82.39<\/p>\n<p style=\"text-align: justify;\">29685034 2019.04.16 20:54:05 buy 0.2  nzdcad 0.90307 0.90273 0.908 2019.04.17 01:45:02 0.90035 0.48 -40.74<\/p>\n<p style=\"text-align: justify;\">29685036 2019.04.16 20:55:03 buy 0.1   nzdcad  0.90306 0.90273 0.908 2019.04.17 01:45:02 0.90035 0.24 -20.3<\/p>\n<p style=\"text-align: justify;\">29685092 2019.04.16 21:12:06 sell 0.1   gbpnzd  1.93175 1.93       1.92 2019.04.17 01:45:02 1.93508  0.47 -22.49<\/p>\n<p style=\"text-align: justify;\">The incident on the Client’s account occurred on Apr 17, 2019, at 01:45 (server time). At the time of the incident, there was a scheduled release of the statistical report on New Zealand inflation (CPI). Due to deficit of margin which resulted from an unfavorable price change in the financial instruments NZDCAD and GBPNZD, all four Client’s positions were liquidated by the Broker (Stop Out). The amount of loss incurred by Stop Out totaled 165.5 USD.<\/p>\n<p style=\"text-align: justify;\">The Client claims that his pending Stop Loss orders attached to open positions and modified a few minutes before the incident were not registered by the Broker because of trading app malfunction, and as a result, all four positions remained open until they were eventually closed due to insufficient margin.<\/p>\n<p style=\"text-align: justify;\">The Client is not satisfied with the Broker&#8217;s decision (see below) and requests the Dispute Resolution Committee to check the correctness of the execution of the transactions closed by Stop Out. The Client believes that the Broker should compensate all losses (165.5 USD) resulted from the liquidation of the positions mentioned above. The Client provided the screenshots of his trading account taken from the mobile trading app, as documentary evidence.<\/p>\n<p style=\"text-align: justify;\">In turn, the Broker does not see any grounds for the Client&#8217;s complaint, since in their opinion all Client&#8217;s positions were closed correctly, at real market prices and in accordance with the provisions of the regulatory documents. The Broker provided the investigation with the trading history of the Client, the server log records, as well as the history of tick data on the financial instruments in the disputed transactions, as documental evidence.<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">17\/04\/2019<\/td>\n<td colspan=\"3\">23\/04\/2019<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint response:<\/strong><\/p>\n<p>The decision on this complaint is based on the information provided by the brokerage company YYY and Mr. XXX.<\/p>\n<p>After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/p>\n<p style=\"padding-left: 40px;\">1. First of all, it should be noted that according to the server log records provided by the Broker, an attempt to modify the price levels of pending Stop Loss and Take Profit orders, made by the Client a few minutes before the incident, was successful:<\/p>\n<p style=\"padding-left: 40px;\">2019.04.17 01:33:21.726 order \/update 5002454 &#8211; {&#8220;ticket&#8221;:29685032,&#8221;tp&#8221;:0.908,&#8221;sl&#8221;:0.90273,&#8221;comment&#8221;:&#8221;WebTrader&#8221;,&#8221;info&#8221;:&#8221;IP : 82.132.223.89&#8243;}<\/p>\n<p style=\"padding-left: 40px;\">2019.04.17 01:33:34.003 order \/update 5002454 &#8211; {&#8220;ticket&#8221;:29685034,&#8221;tp&#8221;:0.908,&#8221;sl&#8221;:0.90273,&#8221;comment&#8221;:&#8221;WebTrader&#8221;,&#8221;info&#8221;:&#8221;IP : 82.132.223.89&#8243;}<\/p>\n<p style=\"padding-left: 40px;\">2019.04.17 01:33:46.467 order \/update 5002454 &#8211; {&#8220;ticket&#8221;:29685036,&#8221;tp&#8221;:0.908,&#8221;sl&#8221;:0.90273,&#8221;comment&#8221;:&#8221;WebTrader&#8221;,&#8221;info&#8221;:&#8221;IP : 82.132.223.89&#8243;}<\/p>\n<p style=\"padding-left: 40px;\">2019.04.17 01:34:34.219 order \/update 5002454 &#8211; {&#8220;ticket&#8221;:29685092,&#8221;tp&#8221;:1.92,&#8221;sl&#8221;:1.93,&#8221;comment&#8221;:&#8221;WebTrader&#8221;,&#8221;info&#8221;:&#8221;IP : 82.132.223.89&#8243;}<\/p>\n<p style=\"padding-left: 40px;\">2. Secondly, it should be noted that during the release of important economic news, such as Consumer Price Index (CPI) and many others, market very often experiences a significant decrease in liquidity combined with significant increase in volatility. In turn, this circumstance radically changes the flow of quotations, leading to dramatic expansion of spreads and generating price gaps. The Client should be aware that trading in such market conditions is accompanied by significant risks.<\/p>\n<p style=\"padding-left: 40px;\">3. Thirdly, it should also be noted that a Stop order, which also includes a Buy Stop\/Sell Stop order, does not guarantee the execution of the client&#8217;s orders precisely at the price specified therein. Depending on the market situation such orders can be executed either precisely at the price specified in them, or at the price worse than specified. The pending Stop order becomes active, as soon as at least one quotation in the stream of the price quoted by the broker reaches the value of the price specified by the client. If reveal in detail the logic of execution of a Stop order in the real market, then it will look like as follows: when the market reaches the price specified in the client’s pending order, the system submits a Market order at any price available in the market (within the Depth of the Market) for the specified volume. Execution of the order, in this case, will occur according to the queue of current positions on the broker’s trading server.<\/p>\n<p style=\"padding-left: 40px;\">4. According to the information provided by the Broker (the history of ticks on the financial instrument NZDCAD), the pending Stop Loss orders attached to Long positions ## 29685032, 29685034, 29685036 were activated at 01:45:02.071 after the price gap and executed at available market price:<\/p>\n<p style=\"padding-left: 40px;\">2019.04.17 01:45:01.721; 0.90361; 0.90474<\/p>\n<p style=\"padding-left: 40px;\">2019.04.17 01:45:02.071; 0.90056; 0.90190<\/p>\n<p style=\"padding-left: 40px;\">2019.04.17 01:45:02.641; 0.90035; 0.90159<\/p>\n<p style=\"padding-left: 40px;\">5. To ensure an objective investigation of the case the DRC requested historical price data on the financial instruments in the disputed transactions from other independent providers of financial services. Comparison of Broker quotes provided to the Client with quotes from independent sources confirmed the fact that the quotes published by the Broker at the time of the incident reflected the actual situation on the market. As such, taking into account abnormal market conditions in the period of the incident, the experts of the DRC have found the execution of all disputed transactions as correct and legitimate, since the quotes of the financial instruments published by the Broker in the period of the incident were consistent with acceptable market prices.<\/p>\n<p style=\"padding-left: 40px;\">6. At last, the trading terms on the Client&#8217;s trading account suggest a Stop Out at 20% level. This information is clearly defined on the Broker’s website (“Trading conditions” section). By opening a trading account of the selected type, client agrees to accept the trading terms provided by the Company. At the time of the incident the Equity\/Margin ratio on the Client&#8217;s account fell below the critical level (20%). As such, due to insufficient margin, all unprofitable positions were closed automatically, at prices available on the market (Stop Out). This fact is confirmed by the records from the server log provided by the Broker.<\/p>\n<p>Summarizing all the above the Dispute Resolution Committee has made a decision in favor of the Broker, since the Broker acted in full compliance with the provisions of the regulatory documents and the rules accepted in the Company. Accordingly, the claim of the Client for compensation of losses in the amount of 165.5 USD was found by the members of the Committee as having no grounds.<\/p>\n<p>This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Broker<\/td>\n<td colspan=\"2\">None<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.com.co<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>13\/05\/2019<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mr. XXX has lodged his complaint with the Financial Commission on the following grounds: The Client used account # 5002454 for active trading in the Forex market. According to the Client, four positions on two different financial instruments were established on the specified account before the incident: 29685032 2019.04.16 20:52:45 buy 0.4  nzdcad [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-105027","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/105027","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/comments?post=105027"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/105027\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/media?parent=105027"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/categories?post=105027"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/tags?post=105027"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}