{"id":105044,"date":"2020-01-22T16:41:07","date_gmt":"2020-01-22T16:41:07","guid":{"rendered":"https:\/\/financialcommission.com.co\/?p=105044"},"modified":"2020-01-28T12:23:12","modified_gmt":"2020-01-28T12:23:12","slug":"customer-complaint-dated-may-18th-2019","status":"publish","type":"post","link":"https:\/\/financialcommission.com.co\/2020\/01\/22\/customer-complaint-dated-may-18th-2019\/","title":{"rendered":"Customer Complaint Dated May 18th 2019","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p style=\"text-align: justify;\">Mr. XXX has lodged his complaint with the Financial Commission on the following grounds:<\/p>\n<p style=\"text-align: justify;\">The Client used account # 20056027 for active trading in the Forex market. According to the Client, five positions ## 65477764, 65558331, 65675857, 65679815, 85698846 with the financial instrument EURUSD were established on the specified account before the incident (see statement).<\/p>\n<p style=\"text-align: justify;\">Thus, by the time of the incident:<\/p>\n<ul style=\"text-align: justify;\">\n<li>the total volume of Long positions in the financial instrument EURUSD was equal to 251000<\/li>\n<li>the total volume of Short positions in the financial instrument EURUSD was equal to 300000<\/li>\n<li>the volume of aggregate Short position in the financial instrument EURUSD was equal to 49000<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The incident on the Client’s account occurred on Apr 26, 2019, at 23:58 (server time), i.e. late on Friday before market closure for a weekend. Due to the deficit of margin which resulted from the expansion of the spread in the financial instrument EURUSD, all five Client’s positions were liquidated by the Broker (Stop Out). The amount of loss incurred by Stop Out totaled 1195.08 USD.<\/p>\n<p style=\"text-align: justify;\">The Client claims that the size of the spread at the time of the incident was huge compared to other days at rollover, pushing his open orders to Stop Out. According to the Client, before the incident, the margin level on his account was above 100% and suddenly dropped sharply due to the spread widening. The spread was around 1.5 pips before rollover but suddenly rocketed up to 10 pips in less than 1 min. Also, the Client claims that before the incident the trend was falling and his selling orders were placed 0.49 lots more than buying orders, meaning that the account was hedged.<\/p>\n<p style=\"text-align: justify;\">The Client is not satisfied with the Broker&#8217;s decision (see below) and requests the Dispute Resolution Committee to check the correctness of the execution of the transactions closed by Stop Out. The Client believes that the Broker should compensate all losses (1195.08 USD) incurred by the liquidation of positions mentioned above. The Client provided the screenshots of his trading account taken from the Broker’s mobile trading app and desktop terminal, as documental evidence.<\/p>\n<p style=\"text-align: justify;\">In turn, the Broker does not see any grounds for the Client&#8217;s complaint, since in their opinion all Client’s positions were closed correctly, at real market prices and in accordance with the provisions of the regulatory documents. The Broker provided the investigation with the trading history of the Client, the server log records, as well as the history of tick data on the financial instrument EURUSD at the time of the incident, as documentary evidence.<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">26\/04\/2019<\/td>\n<td colspan=\"3\">18\/05\/2019<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint response:<\/strong><\/p>\n<p>The decision on this complaint is based on the information provided by the brokerage company YYY and Mr. XXX.<\/p>\n<p>After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/p>\n<p style=\"padding-left: 40px;\">1. First of all, it should be noted that during rollover periods, in particular, during rollover before a weekend, the market very often experiences a significant decrease in liquidity combined with a significant increase in volatility. In turn, this circumstance radically changes the flow of quotations, leading to a dramatic expansion of spreads and generating price gaps. The Client should be aware that trading in such market conditions is accompanied by significant risks.<\/p>\n<p style=\"padding-left: 40px;\">2. Secondly, the trading terms on the Client&#8217;s account suggest a floating spread and a Stop Out at the 20% level. This information is clearly defined on the Broker’s website (“Trading conditions” section). By opening a trading account of the selected type, the Client agreed to accept the trading terms provided by the Company.<\/p>\n<p style=\"padding-left: 40px;\">3. Thirdly, according to the information provided by the Broker (the history of ticks on the financial instrument EURUSD in the period of the incident), the quotes and the size of the spread on the currency pair EURUSD the Broker received from its LP, fully correspond to what the Company gave to its clients. The quotation 1.11396\/1.11496 (which was used for positions liquidation) is the product of quotation 1.11402\/1.11489 received from LP and the Broker&#8217;s income in the amount of 1.4 points.<\/p>\n<p style=\"padding-left: 40px;\">4. To ensure an objective investigation of the case the DRC requested historical price data on the financial instrument in the disputed transactions from other independent providers of financial services. Comparison of Broker quotes provided to the Client with quotes from independent sources confirmed the fact that the quotes published by the Broker at the time of the incident reflected the actual situation on the market. As such, taking into account abnormal market conditions in the period of the incident, the experts of the DRC have found the execution of all disputed transactions as correct and legitimate, since the quotes of the financial instruments published by the Broker in the period of the incident were consistent with acceptable market prices.<\/p>\n<p style=\"padding-left: 40px;\">5. At last, at the time of the incident, the Equity\/Margin ratio on the Client&#8217;s account fell below the critical level (20%). As such, due to insufficient margin, all positions were closed automatically, at prices available on the market (Stop Out). This fact is confirmed by the records from the server log provided by the Broker.<\/p>\n<p>Summarizing all the above the Dispute Resolution Committee has made a decision in favor of the Broker since the Broker acted in full compliance with the provisions of the regulatory documents and the rules accepted in the Company. Accordingly, the claim of the Client for compensation of losses in the amount of 1195.08 USD was found by the members of the Committee as having no grounds.<\/p>\n<p>This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Broker<\/td>\n<td colspan=\"2\">None<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.com.co<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>31\/05\/2019<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mr. XXX has lodged his complaint with the Financial Commission on the following grounds: The Client used account # 20056027 for active trading in the Forex market. According to the Client, five positions ## 65477764, 65558331, 65675857, 65679815, 85698846 with the financial instrument EURUSD were established on the specified account before the incident [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-105044","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/105044","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/comments?post=105044"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/105044\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/media?parent=105044"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/categories?post=105044"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/tags?post=105044"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}