{"id":106472,"date":"2020-03-24T14:06:16","date_gmt":"2020-03-24T14:06:16","guid":{"rendered":"https:\/\/financialcommission.com.co\/?p=106472"},"modified":"2020-03-25T16:22:36","modified_gmt":"2020-03-25T16:22:36","slug":"managing-trading-risks-during-market-volatility","status":"publish","type":"post","link":"https:\/\/financialcommission.com.co\/2020\/03\/24\/managing-trading-risks-during-market-volatility\/","title":{"rendered":"Managing Trading Risks During Market Volatility","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">With the recent Covid-19 global pandemic causing widespread market volatility across all asset classes, the Financial Commission reminds traders of the sensible ways to protect their account using practical ways of risk management.<\/p>\n<p style=\"text-align: justify;\"><a href=\"https:\/\/financialcommission.com.co\/wp-content\/uploads\/2020\/03\/risk-management-process-header@2x-1.png\"><img decoding=\"async\" src=\"https:\/\/financialcommission.com.co\/wp-content\/uploads\/2020\/03\/risk-management-process-header@2x-1-300x129.png\" alt=\"\" width=\"300\" height=\"129\" \/><\/a><\/p>\n<p style=\"text-align: justify;\"><strong>During unprecedented global shocks and market events, traders should be aware of the following:<\/strong><\/p>\n<ul style=\"text-align: justify;\">\n<li>Market prices can swing violently without advanced notice or contrary to principles of technical price analysis, such as support and resistance levels<\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li>Prices can gap during spikes in volatility due to the volume of traders\/orders in the market, as well as participants wishing to conduct trades<\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li>Price gaps should be expected following scheduled or temporary market closings during catastrophic or unprecedented events that influence the markets<\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li>Margin requirements to hold an FX or CFD position may change and impact traders accounts, as brokers adjust risk tolerance for customers and<\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><strong>In order to protect your trading positions, use sensible ways to manage risk in your account:<\/strong><\/p>\n<ul style=\"text-align: justify;\">\n<li>Always mind the minimum margin requirements set out for each product you are trading and calculate at which price you will need to deposit more funds into your trading account to continue to hold positions, should those positions go against you in the market<\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li>Know your trading account’s liquidation level in order to understand at what price positions will be liquidated automatically if the insufficient margin is held on the trading account<\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li>Reduce your trading positions going into temporary or scheduled market closings, for example on weekends to avoid adverse price gaps<\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li>Always use “stop-loss” orders to protect all positions you open on the market<\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><strong>Price Gaps<\/strong><\/p>\n<p style=\"text-align: justify;\">During the recent market turmoil, there have been numerous price gaps in different financial products, including currencies, oil, and equities. Such gaps often happen without any warning or analytical information to suggest such an event will take place. During such market events, the prices quoted for executing trades and orders can vary significantly from one tick to the next and lead to an order not being filled or filled at a worse or better price than intended.<\/p>\n<p style=\"text-align: justify;\"><a href=\"https:\/\/financialcommission.com.co\/wp-content\/uploads\/2020\/03\/Schneider-Electric-renforce-gestion-risque-fournisseurs-T.jpg\"><img decoding=\"async\" src=\"https:\/\/financialcommission.com.co\/wp-content\/uploads\/2020\/03\/Schneider-Electric-renforce-gestion-risque-fournisseurs-T-300x150.jpg\" alt=\"\" width=\"300\" height=\"150\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">In order to avoid risks of price gap movements, it is suggested to reduce the size of your trading position before market closing &#8211; for example, overnight rollovers for such CFD products, as oil contracts and over the weekend. During increased market volatility, the opening price following the resumption of trading can often be far away from the previous closing price. <em>By reducing your trading position, you can reduce the risk of losses due to such price discrepancy. By closing positions entirely before market close over the weekend traders essentially remove all risks of adverse price changes at market open the following business day.<\/em><\/p>\n<p style=\"text-align: justify;\"><strong>Using Stop Loss Orders<\/strong><\/p>\n<p style=\"text-align: justify;\">A great way to limit downside risk to open trades is to use contingent orders, such as “stop-loss”, to reduce the negative exposure should the price of the instrument you are trading go against you. Such order types are commonplace on all popular trading platforms across FX, CFD, and equities brokers. <em>When using stop-loss orders traders are advised to study their broker’s policy on stop-loss order executions, as such orders may in certain volatile market situations be triggered and filled at a price that is different from the requested price in the order. In such situations, the trader’s order can be filled at a worse price than requested. Your broker’s trading policies will explain how the broker deals with such situations so you can plan your trading strategy accordingly.<\/em><\/p>\n<p style=\"text-align: justify;\"><strong>Closeout or Liquidation Level<\/strong><\/p>\n<p style=\"text-align: justify;\">If you’re trading on a Forex or CFD trading account with leverage, your account will have a “close out” or “liquidation level” &#8211; that is the level of margin in your account, at which the broker will automatically close all of your open trades and orders because you do not have any more free margin to keep positions open. Brokers can have a liquidation level of 150%, 100% or lower, such as 50%. This means that if the % of available margin level (i.e. net equity\/required margin) in your account falls below this critical level, your traders\/orders will be liquidated immediately. <em>To reduce the risk of liquidations, we recommend that you know your closeout\/liquidation level on the trading account. By calculating how low your available margin balance can go you can then understand how much more risk you can take on your open or pending trades and orders. Knowing how much available margin you must maintain at all times on your account will help you make better risk management decisions by incorporating the other risk factors above.<\/em><\/p>\n<p style=\"text-align: justify;\">Our official website offers more <a href=\"https:\/\/financialcommission.com.co\/traders-education\/\">trader education<\/a> and important <a href=\"https:\/\/financialcommission.com.co\/tips-for-all\/\">tips for all <\/a>so you can make informed decisions concerning your broker and your trading account.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>With the recent Covid-19 global pandemic causing widespread market volatility across all asset classes, the Financial Commission reminds traders of the sensible ways to protect their account using practical ways of risk management. During unprecedented global shocks and market events, traders should be aware of the following: Market prices can swing violently without advanced notice [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":106503,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75],"class_list":["post-106472","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-tips-for-all","tag-brokers","tag-compensationfund","tag-disputeresolution","tag-education","tag-forex","tag-forexbrokers","tag-forextrading-forexregulation","tag-fx","tag-investing","tag-media","tag-news","tag-protection","tag-regulation-financialcommission","tag-selfregulation","tag-sro","tag-tradereducation","tag-traders","tag-trading","tag-tradingforex","tag-transparency","tag-trust"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/106472","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/comments?post=106472"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/106472\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/media\/106503"}],"wp:attachment":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/media?parent=106472"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/categories?post=106472"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/tags?post=106472"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}