{"id":107162,"date":"2020-04-16T13:54:12","date_gmt":"2020-04-16T13:54:12","guid":{"rendered":"https:\/\/financialcommission.org\/?p=107162"},"modified":"2020-04-16T14:55:03","modified_gmt":"2020-04-16T14:55:03","slug":"how-to-avoid-investment-scams-a-comprehensive-guide","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2020\/04\/16\/how-to-avoid-investment-scams-a-comprehensive-guide\/","title":{"rendered":"How to Avoid Investment Scams &#8211; A Comprehensive Guide","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><a href=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash.jpg\"><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter wp-image-107163 size-400\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-400x267.jpg\" alt=\"\" width=\"400\" height=\"267\" srcset=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-400x267.jpg 400w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-300x200.jpg 300w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-1024x683.jpg 1024w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-768x512.jpg 768w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-1536x1024.jpg 1536w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-2048x1365.jpg 2048w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-830x553.jpg 830w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-230x153.jpg 230w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-350x233.jpg 350w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-480x320.jpg 480w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-200x133.jpg 200w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-600x400.jpg 600w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-800x533.jpg 800w, https:\/\/financialcommission.org\/wp-content\/uploads\/2020\/04\/ricardo-resende-4eqOc39NCRQ-unsplash-1200x800.jpg 1200w\" sizes=\"(max-width: 400px) 100vw, 400px\" \/><\/a><\/p>\n<p style=\"text-align: center;\">According to the latest statistics from the world’s major financial regulators, investors and traders are becoming victims of financial fraud and scams on a large scale. Oftentimes people are approached by unknown persons offering investment advice and promising hefty returns, while other times folks react to an advertisement and stumble upon websites offering investment or managed trading services and promising similar high profits. In order to avoid becoming a victim of financial scams, we’ve put together the following guide to help you stay protected and make informed investment decisions.<\/p>\n<p><b>Social Media<\/b><\/p>\n<p>Many fraudulent investment schemes will use social media to target prospective victims. Many times social media users will be approached by an unknown individual offering them investment advice and services. Other times a friend may recommend someone they met online that has offered good investment returns. Such individuals will claim to be knowledgeable or professional money managers, or investors themselves and may provide records of past investments to justify their services. Likewise, such individuals will most often offer the potential investor to open an account at a brokerage or investment firm.<\/p>\n<p>If someone approaches you through social media offering investment or managed trading services, always keep in mind that offering such services requires a license in most countries around the world from an official government regulator, such as FINRA in the United States, FCA in the United Kingdom and ASIC in Australia. If an individual provides you a copy of such a license, make sure to visit the website of the regulator and check that the license is valid (not revoked, suspended, terminated or fake).<\/p>\n<p>If the individual is asking you to open a trading or investment account at a financial firm, ask the individual to provide proof of their affiliation with this company &#8211; are they an employee, an introducing agent or an affiliated party? If the person cannot verify their relationship with the financial firm, it is possible they may not be acting in your best interests. Be sure to search the individuals’ name and company name in a search engine to find any possible reviews or feedback about the parties from other investors, regulators or associations. Negative feedback relating to loss or theft of funds from previous investors or financial regulators is a warning sign.   Likewise, it is important to study the website of the company for information that is required to be disclosed by regulators. For more on this topic, see the next section of our Guide.<\/p>\n<p><i>REMEMBER:<\/i><\/p>\n<ul>\n<li><i>Any solicitation for investment or managed trading of your funds through social media, such As Facebook, Instagram, Linkedin, etc. should be treated with extreme caution<\/i><\/li>\n<\/ul>\n<ul>\n<li><em>Genuine solicitation of funds can only come from a licensed individual &#8211; make sure to ask for such licensing information if you are interested in the services being offered and confirm the information using a regulator’s website<\/em><\/li>\n<\/ul>\n<ul>\n<li><em>Investing funds with a 3rd party trader or money manager always involves risk of loss and thus no guarantee of success can ever be made or claimed<\/em><\/li>\n<\/ul>\n<ul>\n<li><em>Never sends funds to an individual for the purpose of then depositing those funds at a financial services company on your behalf<\/em><\/li>\n<\/ul>\n<ul>\n<li><em>Do not send funds to any company unless you fully understand the risks, including risks of trading or investing in financial instruments online or permitting someone to conduct these activities on your behalf<\/em><\/li>\n<\/ul>\n<ul>\n<li><em>If you are approached by a so-called investment advisor or money manager online or a friend or relative recommends such a person to you that they met online, we recommend that you double-check or triple-check all the information that is presented to you before making any decision to invest or trade<\/em><\/li>\n<\/ul>\n<p><b>How to Spot a Scam Website<\/b><\/p>\n<p>Besides being solicited online people can stumble upon or react to a marketing message from a company offering investment or managed trading services through an online website. Investors or prospective traders should use caution before making a decision to open an account or send their funds to such websites. It is important to first study the website and make sure that it contains some key information that helps differentiate legitimate companies from possible scams.<\/p>\n<p><i>Here’s what investors should ask themselves when analyzing an investment service website:<\/i><\/p>\n<ul>\n<li><i>Does the company provide a physical office address and telephone for contact? Can the address be verified in Google Maps? Does the country listed in the address match the country of the contact phone number provided?<\/i><\/li>\n<\/ul>\n<ul>\n<li><em>Can the company name, address and contact information easily be copied and pasted from the website using standard computer commands in an Internet browser?<\/em><\/li>\n<\/ul>\n<ul>\n<li><em>Does the website contain a comprehensive risk disclaimer at the bottom of their website regarding risks associated with investing or authorizing someone to trade funds on your behalf? Are risk disclaimers provided elsewhere as well?<\/em><\/li>\n<\/ul>\n<ul>\n<li><em>Does the name and address of the company listed on the website match the information listed in the Terms &amp; Conditions or Customer Agreement provided by the company?<\/em><\/li>\n<\/ul>\n<p>If you answered “no” to any of these questions while studying a website offering investment services it is possible that the website <i>could<\/i> be a scam. To make sure that company registration and contact information are genuine, you can contact the company at their phone, chat or email to get a response. Likewise, using an online map service can help determine if the address listed does indeed represent a building with offices or other structure typically used for business purposes.<\/p>\n<p><b>Funds Withdrawal Policies<\/b><\/p>\n<p>Another way to evaluate the risks of making an investment with a particular financial services company is to study their policies regarding the withdrawal of customer funds. Most if not all reputable companies will let a customer withdraw their funds from an investment or trading account almost immediately during normal business hours or within one or two business days without any preconditions. Furthermore, the customer is usually notified electronically as the withdrawal process is completed.<\/p>\n<p>If you find that the company you are interested to invest with or send funds to has a policy that requires you to either make an additional deposit, pay some form of tax or a percentage of your withdrawal amount in order to process the transaction of returning your funds to you, then it is possible it <i>could <\/i>be a scam.<\/p>\n<p>It is important to understand such details before opening an account or sending funds to the company, as it is very difficult to try and recover funds once they have been credited to the company or website in question.<\/p>\n<p><i>REMEMBER:<\/i><\/p>\n<ul>\n<li><i>Withdrawals from reputable companies most often do not take more than a few business days to be processed and you should expect to be notified of when your funds are sent back to you<\/i><\/li>\n<\/ul>\n<ul>\n<li><em>The company should not have any policies that would require you to have to deposit additional funds, pay a tax or percentage of your withdrawal amount in order to get your original funds back<\/em><\/li>\n<li><em>Make sure to check these policies before opening or funding an account<\/em><\/li>\n<\/ul>\n<p>If you have additional questions or doubts about an investment or managed trading opportunity you can rely on some additional online resources for help. You can check our organization’s <a href=\"https:\/\/financialcommission.org\/warning-list\/\">Warning List<\/a> and <a href=\"https:\/\/financialcommission.org\/check-your-broker\/\">Check Your Broker<\/a> directory to find out more information on known scams and reputable companies. If you are looking for a broker to trade with on your own, you can find unbiased reviews and ratings of reputable brokers <a href=\"https:\/\/www.forexbrokers.com\/\" target=\"_blank\" rel=\"noopener\">here<\/a>.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>According to the latest statistics from the world’s major financial regulators, investors and traders are becoming victims of financial fraud and scams on a large scale. Oftentimes people are approached by unknown persons offering investment advice and promising hefty returns, while other times folks react to an advertisement and stumble upon websites offering investment or [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":14,"featured_media":107163,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75],"class_list":["post-107162","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-tips-for-all","tag-brokers","tag-compensationfund","tag-disputeresolution","tag-education","tag-forex","tag-forexbrokers","tag-forextrading-forexregulation","tag-fx","tag-investing","tag-media","tag-news","tag-protection","tag-regulation-financialcommission","tag-selfregulation","tag-sro","tag-tradereducation","tag-traders","tag-trading","tag-tradingforex","tag-transparency","tag-trust"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/107162","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=107162"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/107162\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/107163"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=107162"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=107162"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=107162"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}