{"id":120719,"date":"2021-04-19T15:20:49","date_gmt":"2021-04-19T15:20:49","guid":{"rendered":"https:\/\/financialcommission.org\/?p=120719"},"modified":"2024-03-21T15:51:32","modified_gmt":"2024-03-21T15:51:32","slug":"customer-complaint-dated-july-14th-2020","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2021\/04\/19\/customer-complaint-dated-july-14th-2020\/","title":{"rendered":"Customer Complaint Dated July 14th 2020","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">The Client has lodged his complaint with the Financial Commission on the following grounds:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Client used account # XXX (USD) for active trading in Binary Options. The incident on the Client&#8217;s trading account occurred on July 10, 2020, on the day when the Broker blocked the Client&#8217;s account and annulled the financial results on transactions ## 1319057826, 1324114443, 1328236807 with crypto assets, motivating their actions by the fact that on the specified account the Client used a trading strategy based on insider information, which violates the provisions of the Broker&#8217;s regulatory documents.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Client does not agree with the Broker&#8217;s decision (see below) and claims that he did not violate any trading rules accepted in the Company; despite this fact, the Broker decided to block the trading account and cancel the results of the disputed transactions. In the Client&#8217;s opinion, the Broker&#8217;s actions in this situation are illegal, since no objective evidence confirming the Client&#8217;s violations was presented by the Broker, and as such, there are no reasons to block the Client&#8217;s trading account.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In connection with the above, the Client requests the Resolution Committee of the Financial Commission to verify the legality of the Broker&#8217;s actions and requires from the Broker to unblock the trading account # 63226192, as well as to return all profits received in the course of trading operations. The Client provided the investigation with the Broker&#8217;s response to this claim, as the documentary evidence.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In turn, the Broker sees no grounds for the Client&#8217;s claim and claims that the reason for blocking the Client&#8217;s trading account and cancelling the financial results on the disputed transactions ## 1319057826, 1324114443, 1328236807 was the Client&#8217;s actions that violate the provisions of the <\/span><span style=\"font-weight: 400;\">Service Agreement<\/span><span style=\"font-weight: 400;\">:<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">1.4.3. <\/span><\/i><i><span style=\"font-weight: 400;\">[&#8230;]<\/span><\/i><i><span style=\"font-weight: 400;\"> The Client will be guided by the principles of integrity, honesty, and rationality; the Client will not take actions coordinated with other Company Clients aimed at damaging the Company; the Client will not use technical features of the quote stream update on the trading terminal and will not use software errors, defects, and vulnerabilities he discovers in the trading terminal to extract income and will not distribute the information about vulnerabilities to the third parties. The Client will not use unfair and dishonest methods or ways of making trades (transactions) with the Company; the Client will not use insider or confidential information or any other information, as a result of the use of which the Client might benefit when trading with the Company and\/or that might damage the Company;<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">In support of their position, the Broker provided the records from the database on all transactions performed by the Client, the summary information on the Client&#8217;s trading account, the screenshots with the price dynamics of the financial instrument in the disputed transactions during the incident. In addition to the above, the Broker also provided the information on the number of transactions and the corresponding trading volumes on the Binance exchange during the incident, which, in the Broker’s opinion, confirm the fact of violations of the trading rules by the Client.<\/span><\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">12\/07\/2020<\/td>\n<td colspan=\"3\">14\/07\/2020<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint response:<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">1. First of all, it should be noted that according to the information provided by the Broker, the values of quotations for the financial asset Bitcoin, as well as for other cryptocurrencies, are calculated according to generally accepted methods used on the Chicago Mercantile Exchange. The Broker uses data from several major online exchanges such as GDAX, Kraken, Poloniex, Bitstamp, Bitfinex and Binance. Thus, the quotes for the Bitcoin asset, broadcast by the Broker in their trading platform, react to the slightest market changes. This information is published on the Broker&#8217;s website.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">2. According to the Broker, in the period from June 6 to July 1, 2020, the Client has <\/span><i><span style=\"font-weight: 400;\">used unfair and dishonest methods or ways of making trades (transactions) with the Company<\/span><\/i><span style=\"font-weight: 400;\">. By the foregoing Broker means the following definition of Market Abuse, adopted in the EU countries:<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Market abuse by its definition is a type of behaviour when one\/several market participants are involved in trading activity that gives them an unreasonable advantage. Under the EU zone definition, market abuse consists of two aspects: insider trading and market manipulation. The latter represents itself as a trading activity aimed to encourage false or misleading impressions.<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">3.To justify their position, according to which the Client took actions aimed at manipulating the rate of the financial instrument Bitcoin outside the Broker&#8217;s platform, due to which he immediately received a risk-free profit on the Broker&#8217;s platform, the Broker uses analytical information obtained on the Binance Exchange trading platform. According to the Broker, being the world&#8217;s largest crypto exchange with the largest volumes of crypto transactions, transactions conducted on the Binance Exchange have the greatest impact on the quotes of crypto assets on any other sites around the world and, in particular, on the quotes of such assets, broadcast in the Broker&#8217;s platform.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">4. The Resolution Committee checked to what extent the Broker&#8217;s statements regarding the fact of manipulation of the price of the specified asset for profit by the Client correspond to reality. For this purpose, the Committee examined the documentary evidence and the analytical information provided by the Broker. Based on the results of the audit, the Committee came to the following conclusions:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">a) Analytical information on the number of transactions and the corresponding trading volumes on the Binance exchange during the period of the incident indicates that during the specified period, the Bitcoin market did indeed experience both an increase in the total number of transactions and a relative increase in trading volume, which might have led to a short-term change in the rate of the specified asset.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">b) Information from the Order Book of client orders registered on the Binance platform during the incident, referred to by the Broker, demonstrates, in the Broker’s opinion, a lack of liquidity: <\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">31163 USD was enough to achieve a yield of -0.01% during the lifespan of transaction # 1319057826.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">6828 USD was enough to achieve a yield of 0.02% during the lifespan of transaction # 1324114443.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">99096 USD was enough to achieve a yield of 0.02% during the lifespan of transaction # 1328236807.<\/span><\/li>\n<\/ul>\n<p>с) Judging by the history of the Client&#8217;s trading operations, during the period of the incident, the Client made three short-term transactions ## 1319057826, 1324114443, 1328236807 with the financial asset Bitcoin, as a result, taking advantage of the drop\/rise in the Bitcoin asset rate by<\/p>\n<p><span style=\"font-weight: 400;\">-0.01%\/0.02%, the Client received a total profit of 10940 USD.<\/span><\/p>\n<p>d) At the time of blocking, the status of the Client&#8217;s trading account was as follows:<\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"3\"><span style=\"font-weight: 400;\">Initial deposit 4015.01 USD,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"3\"><span style=\"font-weight: 400;\">Withdrawal of funds 0 USD,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"3\"><span style=\"font-weight: 400;\">Bonus funds 4005.01 USD,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"3\"><span style=\"font-weight: 400;\">Account balances 19028.46 USD (4015.01 + 4005.01 + 11008.44).<\/span><\/li>\n<\/ul>\n<p>5. The Committee could not provide an adequate assessment of the Client&#8217;s trading transactions, since the Broker did not provide any documentary evidence confirming the fact that this particular Client took targeted actions to change the price of the specified financial instrument on the Binance platform or somewhere else.<\/p>\n<p>6. Finally, it should also be noted that several members of the Committee recognized the Broker&#8217;s arguments as insignificant since they believe that if the Broker gives the opportunity to trade options on low liquid crypto assets, then they should understand that such assets may well make significant price movements with an amplitude of up to 10 -20% per day. If the Broker wishes to reduce the risk, then they must have a well-established risk management process in place. In the absence of it, the Broker should stop offering trading in what they consider to be illiquid assets in order to prevent their clients from exploiting the vulnerability of their infrastructure in the future.<\/p>\n<p><span style=\"font-weight: 400;\">Based on the above information, the members of the Resolution Committee came to a unanimous opinion that the Broker does not have sufficient grounds to assert that the Client&#8217;s actions on the trading platform in any way violate the provisions of the Broker&#8217;s regulatory documents. The members of the Committee believe that the Broker should recognize the financial results of the disputed transactions ## 1319057826, 1324114443, 1328236807 of the Client as legitimate and unblock his trading account.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Summarizing all the above the Dispute Resolution Committee does not see any violations on the part of the Client and believes that the Broker must fully satisfy the Client&#8217;s requirements to unblock the trading account # 63226192, with the right to withdraw the initial deposit and the accrued profit in the amount of 15023.45 USD.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.  <\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Client<\/td>\n<td colspan=\"2\"><span style=\"font-weight: 400;\">11008.44 USD <\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td><span style=\"font-weight: 400;\">09\/08\/2020<\/span><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter The Client has lodged his complaint with the Financial Commission on the following grounds: The Client used account # XXX (USD) for active trading in Binary Options. The incident on the Client&#8217;s trading account occurred on July 10, 2020, on the day when the Broker blocked the Client&#8217;s account and annulled the financial [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-120719","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/120719","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=120719"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/120719\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=120719"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=120719"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=120719"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}