{"id":120738,"date":"2021-04-19T16:06:11","date_gmt":"2021-04-19T16:06:11","guid":{"rendered":"https:\/\/financialcommission.org\/?p=120738"},"modified":"2021-04-19T17:14:01","modified_gmt":"2021-04-19T17:14:01","slug":"customer-complaint-dated-march-2nd-2021","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2021\/04\/19\/customer-complaint-dated-march-2nd-2021\/","title":{"rendered":"Customer Complaint Dated March 2nd 2021","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Mr. XXX has lodged his complaint with the Financial Commission on the following grounds:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Client used account # XXX (USD) for active operations with cryptocurrencies.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">By the time of the incident, several Long positions were opened on the specified trading account for the ETHUSD financial instrument, with a total volume of 8890.31 micro-lots.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The incident on the Client&#8217;s trading account occurred during the <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-02-23\/ether-s-50-selloff-was-genuine-not-an-error-kraken-ceo-says\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">flash crash<\/span><\/a><span style=\"font-weight: 400;\"> on the cryptocurrency market, on February 22, 2021, at 16:23 (server time). At the specified time, as a result of a short-term surge in the volatility of financial markets and the subsequent unfavourable change in the price of the ETHUSD financial instrument, Client’s positions ## 215349578, <\/span><\/p>\n<p><span style=\"font-weight: 400;\">215349585, 215349594, 215349606, 215349616, 215349623, 215349629, 215349635, 215349641, <\/span><\/p>\n<p><span style=\"font-weight: 400;\">215349653, 215349660, 215349665, 215349675, 215349680, 215349687, 215349693, 215349701,<\/span><\/p>\n<p><span style=\"font-weight: 400;\">215349710, 215349717, 215349723, 215349730, 215349737, 215349743, 215349752, 215349758, <\/span><\/p>\n<p><span style=\"font-weight: 400;\">215349766, 215349775, 215349782, 215349787, 215349794, 215349799, 215349807, 215349812, <\/span><\/p>\n<p><span style=\"font-weight: 400;\">215349817, 215349824, 215349831, 215349836 were forcibly liquidated by the Broker due to a shortage in margin collateral (Stop Out). As a result of the incident total amount of the Client&#8217;s financial losses totalled 7343.52 USD.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to the Client, the loss of the deposit was a direct consequence of the incorrect operation of the trading server and the illegal actions of the Broker during the incident. The Client is convinced that the liquidation of positions on the ETHUSD financial instrument by the Broker was carried out at non-market prices. As an example, the Client cites prices on Libertex trading platform, <\/span><a href=\"http:\/\/www.investing.com\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">www.investing.com<\/span><\/a><span style=\"font-weight: 400;\"> platform, as well as large crypto exchanges BitMEX, Binance and other independent financial service providers, where the minimum quotes for the specified financial instrument did not fall below USD 1500 during the incident. At the same time, the quotes of the Broker using Kraken crypto exchange as a liquidity provider dropped to the level of USD 997.92. The client considers such a discrepancy in prices for the same asset to be unacceptable. In the Client opinion, the Broker should act based on the market information obtained from several sources, and not be limited to only one single source, since this limits the objectivity. The Client also notes that during the incident, due to the freezing of the Broker&#8217;s trading server, the Buy Limit pending orders did not work on the Client&#8217;s trading account, as well as displayed incorrect price information on the trading platform charts.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In connection with the above, the Client requests the Dispute Resolution Committee of the Financial Commission to verify the correctness of the Broker&#8217;s actions during the incident and the correctness of the execution of the disputed transactions ## 215349578, 215349585, 215349594, 215349606, 215349616, 215349623, 215349629, 215349635, 215349641, 215349653, 215349660, 215349665, 215349675, 215349680, 215349687, 215349693, 215349701, 215349710, 215349717, 215349723, 215349730, 215349737, 215349743, 215349752, 215349758, 215349766, 215349775, 215349782, 215349787, 215349794, 215349799, 215349807, 215349812, 215349817, 215349824, 215349831, 215349836, as well as a compensation of financial losses incurred by the incident in the amount of 7343.52 USD. As documentary evidence, the Client provided screenshots of the price dynamics of the ETHUSD financial instrument during the incident, taken from the Broker&#8217;s trading platform.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In turn, the Broker does not see any grounds for the Client&#8217;s complaint, since in their opinion all Client’s positions were closed correctly, at actual market prices and in accordance with the provisions of the regulatory documents and trading rules established by the Company. The Broker provided the investigation with the trading history of the Client, the server log records, and tick data history on ETHUSD financial instrument during the incident got from the liquidity provider<\/span><\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\"><span style=\"font-weight: 400;\">22\/02\/2021<\/span><\/td>\n<td colspan=\"3\"><span style=\"font-weight: 400;\">02\/03\/2021<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint response:<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">1. <\/span><span style=\"font-weight: 400;\">First of all, it should be noted that the incident on the Client&#8217;s trading account occurred against the background of massive actions of market participants to fix profits, after significant growth in the cryptocurrency market and the ETHUSD asset reached the psychologically important price level of 2000 USD on the eve of the incident. The growth of market volatility and, as a consequence, a significant decrease in its liquidity is a typical market reaction during a period of volatility. The client should understand that circumstances of this kind radically change the flow of quotes, since it often involves price gaps, widening spreads and slippage during order execution. The client should be aware that trading in such market conditions is accompanied by significant risks.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">2. Secondly, according to the information received from the Broker, the quotation of the ETHUSD financial instrument, disputed by the Client, was received from the Broker&#8217;s liquidity provider &#8211; the Kraken crypto exchange. In turn, the history of tick data from Kraken indicates that during the incident, the Bid quotes (for which Long positions are closed) for the ETHUSD instrument on the specified exchange dropped to the price level of 690 USD. At the same time, on the Broker&#8217;s platform, the minimum value of Bid quotes is registered at 997.92 USD. The Broker explains the difference in the minimum quotes by the fact that his trading system uses filtering mechanisms that do not allow single quotes with serious deviations from the previous ones to enter the stream.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">3. <\/span><span style=\"font-weight: 400;\">Thirdly, according to the trading conditions specified in the &#8220;Trading Conditions&#8221; section on the Company&#8217;s website, the Client&#8217;s account type assumes Stop Out at the level of 10%. At the time of the incident, the margin level on the Client&#8217;s trading account dropped below the critical level, and therefore the Broker forcibly liquidated the Client&#8217;s unprofitable positions. This fact is confirmed by the trade server log entries provided by the Broker. The Broker&#8217;s actions during the incident fully comply with the provisions of the Client Agreement:<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">12.1  In case the Margin Level on the Client’s trading account becomes equal or lower than the Stop Out value, the Company has the right to close all open positions on the Client’s trading account compulsory at the current market price without any preliminary notification and the Client’s consent. Stop Out values for all account types are specified in a comparison table of account types on the Company’s website.<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">4. Fourth, it should also be noted that the Client assumed the risk of a complete loss of funds in his trading account, under certain circumstances, since he did not use any restrictions on the amount of possible financial losses on open positions, although he could have done this, just as it was done by him in the case of restrictions on profit. For all disputed positions, the Client has placed pending Take Profit orders at the price level of 1676.23 USD.<\/span><\/p>\n<p>5. <span style=\"font-weight: 400;\">Fifth, in the text of his complaint, the Client refers to technical problems with the Broker&#8217;s trading server and the freezing of his trading terminal, which allegedly took place during the incident. The client believes that this circumstance has deprived him of the opportunity to manage his trading account and monitor the price dynamics of the financial market. In addition, according to the Client, in the group of clients affected by this incident, there are allegedly 5% of accounts that survived the drawdown, although they used the same trading algorithm (EA). In this regard, the following should be noted:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Upon the Client&#8217;s request, the Broker analyzed the operation of the MT5 Pro server. According to the data collected, the Client did not submit any orders that were not executed on the day of the incident. Also, there were no unsuccessful attempts to enter the trading platform. A general analysis of the platform&#8217;s operation showed that hundreds of other clients have successfully logged into the platform and performed trading operations. These facts are confirmed by the server log entries provided by the Broker.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">The fact that the accounts used &#8220;the same trading strategy&#8221; does not guarantee the same result. In addition, at the moment, the Broker does not have any data about other accounts that the Client said about, and, accordingly, the experts of the Committee have no opportunity to study and in any way comment on such situation. Moreover, there are many different factors that can lead to a similar outcome: for example, even if the same Expert Advisor works on two different accounts and sends orders with identical parameters, the trading results on these accounts may differ due to the difference in execution prices. Such differences, in turn, may occure for two identical orders sent at the same time.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">It should be noted that orders are not executed on the data center, but on the trading server, which centrally executes orders from all accounts opened on it. Moreover, there is no targeted segmentation or division of customers by data centers. Any client can choose any available data center for connection, and the trading platform automatically selects a data center for the client with a minimum ping.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Limit orders ## 215349838, 215349839, 215349840, 215349842, 215349843, 215349844, 215349845, 215349846, 215349847, 215349848 of the Client, placed to open new Long positions, at lower prices, were activated at 16:23:03, i.e. at the same second when Stop Out occurred, but were immediately canceled because there was not enough free margin on the Client&#8217;s trading account to open the indicated positions. The trade server log entries provided by the Broker also confirm this fact:<\/span><\/li>\n<\/ul>\n<p><i><span style=\"font-weight: 400;\">2021.02.22 16:23:03.276   &#8216;37012959&#8217;: new account state: Assets: 0.00, Liabilities: 0.00, Equity -5118195.65, Margin: 585468.32, Free Margin: -5703663.97<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">2021.02.22 16:23:03.276   &#8216;37012959&#8217;: order #215349848 was canceled &#8211; not enough money for order activation [#215349848 buy limit 9.18518K ETHUSD at 1583.97]<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">2021.02.22 16:23:03.292   &#8216;37012959&#8217;: position stop out triggered [#215349836 buy 1.48346K ETHUSD 1631.75 tp: 1676.23] [#215397080 sell 1.48346K ETHUSD at 997.92] [997.92 \/ 1249.34]<\/span><\/i><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">The reason why the charts in different screenshots look different is that one screenshot was taken before the end of the 15-minute period in which this price was present, and the second was taken after the completion of the candlestick formation. This is the standard logic of charting on the MetaTrader platform.<\/span><\/li>\n<\/ul>\n<p>6. <span style=\"font-weight: 400;\">Finally, it should also be mentioned that, in the Client&#8217;s opinion, the quotes of the Kraken crypto exchange are not an authoritative source, and the brokerage company is obliged to aggregate prices from different crypto exchanges and provide clients with average prices. According to the experts of the Dispute Resolution Committee, this request is not realistic, since prices on different crypto-exchanges tend to deviate significantly from each other, especially during periods of low volatility, such as the one that took place during the incident. It should also be noted that in a decentralized market, which is the FOREX market, each broker can offer its clients prices close to the real market, although slightly different from the prices of other brokers. This is normal practice, given the varying transaction volumes for each individual broker, the ever-changing market situation and some other factors.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Considering the above and taking into account the abnormal market conditions during the incident, as well as the documentary evidence provided by the Broker, the experts of the Committee, by a majority vote, decided in favour of the Broker. According to the decision taken, the actions of the Broker to forcibly liquidate Client’s unprofitable positions ## 215349578, 215349585, 215349594, 215349606, 215349616, 215349623, 215349629, 215349635, 215349641, 215349653, 215349660, 215349665, 215349675, 215349680, 215349687, 215349693, 215349701, 215349710, 215349717, 215349723, 215349730, 215349737, 215349743, 215349752, 215349758, 215349766, 215349775, 215349782, 215349787, 215349794, 215349799, 215349807, 215349812, 215349817, 215349824, 215349831, 215349836 during the incident were recognized by the experts of the Committee as correct and executed in accordance with the provisions of the Broker&#8217;s regulatory documents and the trading rules adopted by the Company. Also, according to the general opinion of the DRC experts, the Broker should notify its clients from which crypto-exchange the quotes are taken, so that such questions do not arise in the future.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Based on the above, the Dispute Resolution Committee does not see any violations on the part of the Broker and does not see any grounds for the Client&#8217;s complaint.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Broker<\/td>\n<td colspan=\"2\"><span style=\"font-weight: 400;\">None<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td><span style=\"font-weight: 400;\">31\/03\/2021<\/span><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mr. XXX has lodged his complaint with the Financial Commission on the following grounds: The Client used account # XXX (USD) for active operations with cryptocurrencies. By the time of the incident, several Long positions were opened on the specified trading account for the ETHUSD financial instrument, with a total volume of 8890.31 [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-120738","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/120738","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=120738"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/120738\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=120738"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=120738"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=120738"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}