{"id":120746,"date":"2021-04-19T16:53:48","date_gmt":"2021-04-19T16:53:48","guid":{"rendered":"https:\/\/financialcommission.com.co\/?p=120746"},"modified":"2021-04-19T22:21:42","modified_gmt":"2021-04-19T22:21:42","slug":"customer-complaint-dated-january-21st-2021","status":"publish","type":"post","link":"https:\/\/financialcommission.com.co\/2021\/04\/19\/customer-complaint-dated-january-21st-2021\/","title":{"rendered":"Customer Complaint Dated January 28th 2021","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Mr. XXX has lodged his complaint with the Financial Commission on the following grounds:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Client used account # XXX (USD) for active operations with cryptocurrencies.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Client used account # 8809629 (USD) for active operations with Forex market instruments and CFDs. According to the Client, the specified account was registered on October 13, 2020, and funded with 7990.43 USD on December 21, 2020. On the same day, the Broker credited bonus funds in the amount of 1598 USD to the Client’s account. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">By the day of the incident, the Client established 21 Short positions with the financial instrument USOIL with a total volume of 538 lots. The incident on the Client’s account occurred on January 4, 2021, at 12:31:34 (server time). At the specified time the Broker deducted all overnight fees obtained from USOIL positions established by the Client. As a result, this circumstance led to debit of bonus funds from the Client’s account, as well as forced liquidation of the Client’s positions ## 56617870, 56617871, 56617872, 56618848, 56618862, 56623804, 56623805, 56623832, 56623833, 56623834, 56691961 due to deficit of margin (Stop Out). The number of the Client’s losses incurred by the incident totalled 6135.30 USD. Also, it should be noted that shortly after the incident the Client covered the rest of his positions in USOIL manually, at market prices, with additional losses in the amount of 1006 USD. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Client does not agree with the Broker&#8217;s decision (see below), accuses the Broker of misconduct and <\/span><span style=\"font-weight: 400;\">requests the Dispute Resolution Committee to check the legitimacy of the Broker’s actions in the period and after the incident. The Client believes that a fair resolution to the dispute should be compensation of financial losses incurred by the incident (7000 USD) from the Broker. The Client provided the investigation with the screenshot taken from the Broker’s platform, as well as the screenshot taken from the live chat, as documentary evidence.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In turn, the Broker does not see any grounds for the Client&#8217;s complaint, since in their opinion all Client’s positions were closed correctly, at actual market prices and in accordance with the provisions of the regulatory documents and trading rules established by the Company. The Broker provided the investigation with the trading history of the Client, the server log records, the Bonus Promotion T&amp;C, as well as the official response to the Client on this claim, as documentary evidence.<\/span><span style=\"font-weight: 400;\"> <\/span><\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\"><span style=\"font-weight: 400;\">17\/01\/2020<\/span><\/td>\n<td colspan=\"3\"><span style=\"font-weight: 400;\">28\/01\/2021<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint response:<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">The decision on this complaint is based on the information provided by the brokerage company and the Client.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">1. According to the information received from the Broker, they have experienced a Swap incident on USOIL positions that were incorrectly charged to their clients starting December 23, 2020. The Broker sent out client communication on January 4, 2021 prior to the actual adjustments to inform affected clients that investigation is in place and adjustments would be made shortly. On the same day, adjustments were made and client communication sent to inform affected clients. <\/span><span style=\"font-weight: 400;\">In this regard the Broker claims that they acted in full compliance with the provisions of the regulatory documents and refers to the appropriate clauses of their Client Agreement:<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">2.5 CHARGES AND CREDIT TO YOUR ACCOUNT<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">…<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">(c) If we discover that we have made an error in respect of any fee calculation, we will rectify that error<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">by giving you written notice within 28 days. <\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">…<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">3.5 ERRORS IN PRICES<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">Errors in pricing may occur from time to time. In these circumstances, we may adjust any element of your Position. See section 3.7 of the <\/span><\/i><i><span style=\"font-weight: 400;\">Product Disclosure Statement<\/span><\/i><i><span style=\"font-weight: 400;\"> for more information about the basis on which we can do this. <\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">…<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">12.1 EXCLUSION OF LIABILITY<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">To the maximum extent permitted by law, we are not liable for: <\/span><\/i><\/p>\n<ol>\n<li><i><span style=\"font-weight: 400;\">f) any Error that may occur; <\/span><\/i><\/li>\n<li><i><span style=\"font-weight: 400;\">h) any error or inaccuracy in, or unsuitability of, or omission from the Agreement, or any other information provided by us, whether negligent or otherwise; <\/span><\/i><\/li>\n<li><i><span style=\"font-weight: 400;\">i) any Loss or Claim suffered or incurred by you in respect of our Trading Platform including due to the unavailability of the Trading Platform or Trading Platform, system and data errors, delays, inaccuracies, errors or omissions in data provided to you, software or computer viruses or the unauthorized use of the Trading Platform at any time;<\/span><\/i><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">2. Also, the Broker claims that the Client received their Credit Bonus under the condition that the Client’s account equity balance must not fall below credit balance, otherwise, the Credit Bonus will be removed, as outlined by the provisions of clause 16 of the Bonus Promotion Terms &amp; Conditions:<\/span><\/p>\n<ol start=\"16\">\n<li><i><span style=\"font-weight: 400;\"> If your Account Equity balance falls below the credit balance the trading credit will be removed and your open trades will be closed. <\/span><\/i><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">The Broker claims that the Swap adjustment made to the Client’s account lowered his account equity level and triggered the removal of the Credit Bonus. It was also partially due to an overnight USOIL price increase from 48.351 to 48.941, which enlarged the Client’s trading loss.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">3. <\/span><span style=\"font-weight: 400;\">It should be noted that trading terms for the Client’s account suggest a floating spread and a Stop Out at 20% level. This information is clearly defined by the Broker’s regulatory documents (see <\/span><span style=\"font-weight: 400;\">Product Schedule<\/span><span style=\"font-weight: 400;\">). By opening a trading account of the selected type, the Client agreed to accept the trading terms provided by the Company. According to the Broker, at the time of the incident, the Equity\/Margin ratio on the Client&#8217;s account fell below the critical 20% level. As such, due to insufficient margin, the Client’s positions ## 56617870, 56617871, 56617872, 56618848, 56618862, 56623804, 56623805, 56623832, 56623833, 56623834, 56691961 were closed automatically, at prices available on the market (Stop Out). This fact is confirmed by the records from the server log, provided by the Broker.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">4. It is quite obvious, that from a legal standpoint the Broker acted in full compliance with the provisions of their regulatory documents. At the same time, it should be noted, that from an operational perspective it does not seem that the Broker acted in a very professional way. The Broker made the error, and only after 2 weeks fixed things opportunistically without explaining to the Client or giving them the chance to deposit additional funds or reduce their position.<\/span><\/p>\n<p>5. <span style=\"font-weight: 400;\">Financial Commission is committed to the best business practices accepted throughout the industry which assume that, if there is some issue caused by the broker, there shall be minimum impact on the client, and some solutions shall be provided in a swift manner to mitigate negative effects of it on the client’s positions.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Summarizing all the above the Dispute Resolution Committee has made a decision in favour of the Client. In the general opinion of the DRC members, the Broker should bear the loss of their errors, as well as communicate much more clearly and take appropriate measures in order to avoid the occurrence of such situations on their clients’ accounts in the future. Accordingly, the Broker must fully satisfy the Client&#8217;s requirement for compensation of losses in the amount of 7000 USD incurred by the incident.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.  <\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Client<\/td>\n<td colspan=\"2\"><span style=\"font-weight: 400;\">7000 USD<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.com.co<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td><span style=\"font-weight: 400;\"> 5\/03\/2021<\/span><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mr. XXX has lodged his complaint with the Financial Commission on the following grounds: The Client used account # XXX (USD) for active operations with cryptocurrencies. The Client used account # 8809629 (USD) for active operations with Forex market instruments and CFDs. According to the Client, the specified account was registered on October [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-120746","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/120746","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/comments?post=120746"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/posts\/120746\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/media?parent=120746"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/categories?post=120746"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.com.co\/wp-json\/wp\/v2\/tags?post=120746"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}