{"id":128948,"date":"2023-01-31T12:17:32","date_gmt":"2023-01-31T12:17:32","guid":{"rendered":"https:\/\/financialcommission.org\/?p=128948"},"modified":"2023-01-31T12:17:32","modified_gmt":"2023-01-31T12:17:32","slug":"customer-complaint-dated-july-12th-2022","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2023\/01\/31\/customer-complaint-dated-july-12th-2022\/","title":{"rendered":"Customer Complaint Dated July 12th 2022","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p>The Client has lodged this complaint with the Financial Commission on the following grounds:<strong> <\/strong><\/p>\n<p>The Client used account # 5269533 (GBP) for active operations with the financial instruments of FX market. According to the Client, on June 22, 2022, he requested the Broker to change the leverage on his trading account from 1:500 to 1:50. Later, on the same day, the Client received a confirmation email from the Broker, stating that the Client’s request had been successfully processed. After reported change in the leverage ratio on his account the Client continued trading and performed more than 300 operations.<\/p>\n<p>The incident on the Client’s account occurred on 01.07.2022. On the specified date, due to unfavorable change in price of the financial instrument EURUSD the Client suffered losses in the amount of 3125.89 GBP. The Client’s position # 202333806 was liquidated by the Broker due to deficit of margin (Stop Out), while the rest of the Client’s positions (## 202300047, 202300073, 202321707, 202321732, 202321775, 202322113, 202322203, 202322302, 202322363) were closed by the Client at current market prices, via market orders. The Client claims that, only after the incident he realized that the Broker had failed to change the leverage on his account, as reported earlier.<\/p>\n<p>The Client blames the Broker for the financial losses occurred on his account in the period of the incident, since in his opinion, the misleading information on the leverage change was behind this incident. The Client believes that the Broker operates in a fraudulent manner with false confirmations of the leverage changes and fictitious email reports to the Client. According to the Client the technical error on the Broker’s side caused him to trade unknowingly that his leverage was 1:500, as well as indicates that if he was aware of the change, he would have controlled his risk and positions adequately.<\/p>\n<p>The Client is not satisfied with the Broker&#8217;s decision (see below) and requests the Dispute Resolution Committee to check the correctness of the Broker’s actions prior and after of the incident. The Client believes that a fair resolution to the dispute would be a compensation of losses occurred in the period from 22.06.2022 to 01.07.2022 (4000 GBP) from the Broker. The Client provided investigation with the screenshots of the Broker’s confirmation emails, as well as the Broker’s official response on this complaint, as documentary evidence.<\/p>\n<p>In turn, the Broker does not see any grounds for the Client&#8217;s complaint, since in their opinion the Client was always aware of high leverage ratio applied to his trading account but chose to continue trading. Nevertheless, the Broker acknowledged that due to a technical inconsistence, the leverage on the Client’s account had not been updated as requested on 22.06.2022 and, therefore agreed to cover the part of the Clients losses in the amount of 166.88 GBP, as a gesture of goodwill. The Broker provided investigation with the history of trading operations performed by the Client, the server log records, as well as the communication with the Client regarding the leverage issue, as documentary evidence.<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">02\/07\/2022<\/td>\n<td colspan=\"3\">12\/07\/2022<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint Response:<\/strong><\/p>\n<p>The decision on this complaint is based on the information provided by the brokerage company XXX and The Client.<\/p>\n<p>After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/p>\n<ol>\n<li>First of all, it should be noted that leverage does not affect profit\/loss in any way, but only affects the volume of positions that the Client can open taking into consideration the amount of free equity available on his trading account. On one hand, the Client declares that he suffered losses because the Broker did not reduce his leverage from 1:500 to 1:50, but on the other hand, the Client does not mention the fact that reducing the leverage would cause him even more Stop Outs, since reducing the leverage to 1:50 would increase the margin requirements by 10 times. Also, the client with a higher leverage can always personally limit his trading volumes, taking into account the part of his deposit that he would like to use: having a leverage of 1:500, the client can independently keep his risks at the level, as if his leverage were 1:50, that is, independently use less funds and limit the maximum volume of opened positions by the level corresponding to the necessary leverage.<\/li>\n<\/ol>\n<ol start=\"2\">\n<li>Second, according to the information received from the Broker, the Client had been changing his leverage on several occasions and used the higher 1:500 leverage on multiple dates. Moreover, the Client kept changing back and forth from higher leverage to a lower one, and vice versa. Therefore, the Broker is sure about the fact that the Client was fully aware of how the leverage works and how to differentiate a higher to lower leverage. As such, once the Client had requested the most recent update to his leverage from 1:500 to 1:50 on 22.6.2022, surely, he would have realized that the margin requirement for his positions was still quite low, relative to the intended 1:50 leverage which would have required him to pay 10 times more to open a new position. Unfortunately, the Client was informed of the successful leverage change on the same day but due to a technical issue this was never updated on the platform. In this regard, in support of their position the Broker refers to clause 10.23 of their Terms and Conditions according to which:<\/li>\n<\/ol>\n<p><em>10.23 You agree that:<\/em><strong><em> <\/em><\/strong><\/p>\n<p><em>(g) there are significant risks in using an Electronic Trading Service to deal in our Financial Products because it is operated by computer and telecommunication systems.<\/em><\/p>\n<ol start=\"3\">\n<li>Third, the trading terms for the Client’s account suggest a floating spread and a Stop Out at 50% level. This information is clearly defined on the Broker’s website. By opening a trading account of the selected type, the Client agreed to accept the trading terms provided by the Company. In this regard it should be noted that the disputed position # 202333806 was closed automatically, as margin level declined below the minimum permitted level of 50%. In the period of the incident the Broker acted in full compliance with the provisions of their regulatory documents and trading rules established by the Company:<\/li>\n<\/ol>\n<p><em>15.7 It is solely your responsibility to monitor and to satisfy all Margin Cover requirements.<\/em><\/p>\n<p><em>15.8 You are required to maintain the Margin Cover, which might mean you must pay more Margin, whether or not we give you a Margin call and even if you are not contactable.<\/em><\/p>\n<p><em>…<\/em><\/p>\n<p><em>15.11 XXX may (without notice to you) Close Out, but will not be obliged to Close Out or to attempt to Close Out, some or all Open Positions, at that time or any later time as we determine (whether in our discretion or by automatic trading platform management) if: <\/em><\/p>\n<p><em>(a) your Account Value falls below the Liquidation Level; or <\/em><\/p>\n<p><em>(b) you fail to maintain the required Margin Cover; or <\/em><\/p>\n<p><em>(c) at any time, and from time to time, XXX determines that the value of all of your Open Positions (and not taking into account any cash balance in your Account) represents a substantial net unrealized loss to you such that, in our belief, the continued trading, or failure to Close Out, one or more of your Open Positions will or is likely to materially prejudice your Account Value. <\/em><\/p>\n<p><em>15.12 Details of Margin amounts paid and owing by you are available by logging onto your Account.<\/em><\/p>\n<ol start=\"4\">\n<li>Finally, it also should be noted that the Client was able to monitor the state of his trading account (equity, margin, equity\/margin ratio), not to mention that in the account parameters of the trading terminal, the Client could always see his leverage, therefore, the Client was fully aware of the risk of an early liquidation of his positions. Furthermore, after opening the disputed positions, the Client did not use pending Stop Loss orders to limit possible financial losses in the event of an unfavorable price change. This circumstance indicates the fact that the Client was ready for a situation with a complete loss of his account balance.<\/li>\n<\/ol>\n<p>Summarizing all the above the Dispute Resolution Committee has made its decision in favor of the Client. In the general opinion of the DRC members, the Broker must bear limited responsibility for the Client’s financial losses and reimburse the latter only for losses on order # 202333806 closed by Stop Out. If the Client changed leverage before and saw margin live on the platform it is hard to believe that he has not noticed lack of change.<\/p>\n<p>This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\"><strong>Ruled in Favor<\/strong><\/td>\n<td colspan=\"2\"><strong>Compensation<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Client<\/td>\n<td colspan=\"2\">400.57 GBP<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Acknowledgement<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td><strong>Signature<\/strong><\/td>\n<td colspan=\"3\"><strong>Designation<\/strong><\/td>\n<td><strong>Date<\/strong><\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>08\/08\/2022<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter The Client has lodged this complaint with the Financial Commission on the following grounds:  The Client used account # 5269533 (GBP) for active operations with the financial instruments of FX market. According to the Client, on June 22, 2022, he requested the Broker to change the leverage on his trading account from 1:500 [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-128948","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/128948","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=128948"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/128948\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=128948"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=128948"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=128948"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}