{"id":128952,"date":"2023-01-31T13:44:51","date_gmt":"2023-01-31T13:44:51","guid":{"rendered":"https:\/\/financialcommission.org\/?p=128952"},"modified":"2023-01-31T13:44:51","modified_gmt":"2023-01-31T13:44:51","slug":"customer-complaint-dated-march-9th-2022","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2023\/01\/31\/customer-complaint-dated-march-9th-2022\/","title":{"rendered":"Customer Complaint Dated March 9th 2022","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p>The Client has lodged this complaint with the Financial Commission on the following grounds:<\/p>\n<p>The Client used account # 599941130 (USD) for active operations with the instruments of FX market. According to the Client, all trades performed on the specified trading account were opened either manually or by the means of EA, which is allowed by the Broker. The Client acknowledges that for the purpose of minimizing delay issues she used UK and US based VPS.<strong> <\/strong><\/p>\n<p>The incident on the Client’s account occurred on March 1, 2022, i.e., on the day when the Broker reversed the Client’s withdrawal request claiming that the Client’s account was disabled for violation of trading rules established by the Company. The Client indicates that the Broker had blocked her account for no apparent reason, since in the Client’s opinion, none of the Broker&#8217;s rules had been violated. According to the Client, the Broker let her withdraw only the initial deposit in the amount of 1400 USD and refused to pay the profits in the amount of 3657 USD, that, in the Client’s opinion, were legally obtained in the period of trading on the Broker’s platform.<\/p>\n<p>The Client does not agree with the Broker’s decision (see below) and considers the actions of the Broker as unfair. According to the Client, she had been trading on the Broker’s platform for several days using the same trading strategy without issues. In connection with the above, the Client requests the Dispute Resolution Committee of the Financial Commission to check the disputed transactions for alleged violations and requires the Broker to return the rest of the withheld funds. The Client provided the investigation with the Broker’s comments on this complaint, as documentary evidence.<\/p>\n<p>In turn, the Broker claims that before the incident the Client had been using a combination of VPS and EA that are trying to abuse the system (exploit weaknesses in the Broker’s trading platform). As such, the Broker does not see any grounds for the Client&#8217;s complaint and refers to clause 35.2 of their Client Agreement, according to which:<\/p>\n<p><em>35.2. In the event that the Client placed an Open Position, Trade and\/or Order in breach of any of the representations and warranties given or if XXX has grounds that any of the Parties are involved in any form of prohibited trading, i.e. certain trading techniques commonly known as &#8220;arbitrage trading&#8221;, &#8220;picking\/ sniping&#8221; and\/or follow an abusive trading strategy as any trading activity, which is aiming towards potential riskless profit by opening opposite orders, during periods of volatile market conditions, during news announcements, on opening gaps (trading sessions starts), or on possible gaps where the underlying instrument has been suspended or restricted on a particular market, between same or different trading accounts, or if the client is believed to have manipulated quotes, execution processes, or any other forms of market abuse, XXX , may, in its absolute discretion (and with or without giving notice to the Client), and without being under any obligation to inform the Client of its reason for doing so, close that Open Position and\/or Order and any other Open Position(s) and\/or Order(s) that the Client may have open at that time, and in XXX’s absolute discretion:<\/em><\/p>\n<p><em>&#8211; Enforce the Open Position or Trade against the Client if it is an Open Position or Trade under which the Client had made losses<\/em><\/p>\n<p><em>&#8211; Treat all the Client’s Open Positions and Trades under this paragraph as immediately void even if they are Open Positions or Trades under which the Client has made profits.<\/em><\/p>\n<p><em>&#8211; terminate this Service with immediate notice to the Client and\/or the business relationship established between the Company and any of the Parties;<\/em><\/p>\n<p><em>&#8211; close any of the Client’s accounts with the Company and\/or suspend his account for an indefinite period of time;<\/em><\/p>\n<p><em>&#8211; charge a penalty fee to any of the Client as the Company deems fit and proportionate;<\/em><\/p>\n<p><em>&#8211; enforce the transaction(s) against the Client if it is a transaction(s) that results in the Client owing money to the Company<\/em><\/p>\n<p><em>&#8211; close the account, confiscate any profits that arose from prohibited trading techniques and return the original deposit(s) to the Parties. If profits arising out of Prohibited Trading were already withdrawn, profits can be confiscated from the Parties related accounts to make up for the difference <\/em><\/p>\n<p><em>&#8211; withhold any funds from the Client who we suspect to have derived any of abovementioned activities.<\/em><strong><em> <\/em><\/strong><\/p>\n<p><em>Unless and until the Client produces conclusive evidence that in fact, they have not committed the breach of warranty and\/or misrepresentation as referred to above, within the period of one month from the date of closure under this paragraph, all such Trades between the Company and the Client (under which the Client has made profits) will be finally null and void. <\/em><strong><em> <\/em><\/strong><\/p>\n<p>In support of their decision, the Broker provided the history of all transactions performed by the Client, the server log records, the history of logins into trading account # 599941130 operated by the Client, the history of transactions performed on the account # 599940660 belonging to another client, who in the Broker’s opinion, had been using the same abusive trading strategy, as well as the screenshots with typical price dynamics of the financial instrument XAUUSD in the period of the Client’s trading activity, as documentary evidence.<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">01\/03\/2022<\/td>\n<td colspan=\"3\">09\/03\/2022<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint Response:<\/strong><\/p>\n<p>The decision on this complaint is based on the information provided by the brokerage company XXX and the Client.<\/p>\n<p>After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/p>\n<p style=\"padding-left: 40px;\">1. First, according to the Broker, prior to the incident the Client identified a technical problem on the Broker’s side and implemented a strategy aimed at making risk-free profits at the expense of lagging \/ non-market prices. According to the Broker:<\/p>\n<p style=\"padding-left: 40px;\">a) The Client has been trading XAUUSD via high quality low latency VPS (IP address 89.31.124.153) which is located in the UK. The Broker allows using EAs and VPS, provided that combination of VPS and EA is not trying to abuse the Broker’s MT4 infrastructure.<\/p>\n<p style=\"padding-left: 40px;\">b) The Client’s operations were probably driven by the means of EA. On the other hand, the Broker indicates that the EA driven trading activity is not verified by MT4, as the reason of all trades in the trading terminal history is ‘Client’ and not ‘Expert’. In the Broker’s opinion “this is usually done (hidden) on EAs that are trying to abuse the system”.<\/p>\n<p style=\"padding-left: 40px;\">с) Most of the Client’s trades were opened and closed within minutes in volatile market conditions and most of them were counter positions with the same volume.<\/p>\n<p style=\"padding-left: 40px;\">d) Having compared their pricing with other major LPs like LMAX, the Broker is confident that in most cases the Client was getting better prices. The Broker believes that trading operations of this kind confirm the fact of the Client’s deliberate trading using system vulnerabilities.<\/p>\n<p style=\"padding-left: 40px;\">e) The Client have been trading XAUUSD under 2 leg price arbitrage strategy by taking various and counter positions on 2 or more brokers and locking profit upon closing.<\/p>\n<p style=\"padding-left: 40px;\">f) All trades performed on the Client’s account were placed from 89.31.124.153. The Broker indicates that the VPS located on the specified IP address was used by one person for managing account # 599941130, as well as other clients’ accounts, by the means of the exact same trading strategy. The history of investors’ logins into trading account # 599941130 provided by the Broker confirms this fact.<\/p>\n<ol start=\"2\">\n<li>Second, it should be noted that in order to make a decision on this case the DRC has analyzed the Client&#8217;s trading activity in the account # 599941130.<\/li>\n<\/ol>\n<p style=\"padding-left: 40px;\">a) Analysis of the nature of the transactions performed by the Client showed the following:<\/p>\n<ul>\n<li>The Client&#8217;s transactions were made in the period from 22.02.2022 to 01.03.2022;<\/li>\n<li>The 100% of the Client’s transactions were made with one financial instrument (XAUUSD);<\/li>\n<li>The time of the disputed transactions’ execution was within the period from 05:21 to 22:39 (server time, GMT);<\/li>\n<li>The duration of the Client&#8217;s transactions ranged from 2 minutes up to several hours, however roughly 35% of all transactions had their duration of 2-3 minutes;<\/li>\n<li>The most of transactions were performed during the hours of active market, however no correlation between the time of important news releases and the time of trades performed by the Client was found;<\/li>\n<li>All Client&#8217;s transactions were opened manually, without using EA, as confirmed by the server log provided by the Broker.<\/li>\n<\/ul>\n<p style=\"padding-left: 40px;\">b) The analysis of the financial results of transactions performed by the Client showed the following:<\/p>\n<ul>\n<li>After 89 transactions the Client received a net profit in the amount of 3657 USD;<\/li>\n<li>The share of Short positions established by the Client was 41.57% or 37 transactions;<\/li>\n<li>The share of Long positions established by the Client was 58.43% or 52 transactions;<\/li>\n<li>The share of profitable transactions performed by the Client was 51.69% or 46 transactions;<\/li>\n<li>The share of unprofitable transactions performed by the Client was 48.31% or 43 transactions.<\/li>\n<\/ul>\n<p style=\"padding-left: 40px;\">3. Third, the DRC has verified the validity of the Broker&#8217;s assertion regarding the Client&#8217;s use of the vulnerabilities of their technical equipment and software for profit. For this purpose, the DRC has examined the documentary evidence provided by the Broker, as well as the history of price data on the financial instrument in the disputed transactions, obtained from independent providers of financial services. To ensure an objective investigation Financial Commission uses several different sources, such as Tradeproofer, Tradefora, Verify My Trade, TrueFX, FX Benchmark and some others for the purpose of verification of the quality of trades’ execution. The analysis of execution quality of the Client&#8217;s trades showed that vast majority of them were opened and closed at actual prices available on the market.<\/p>\n<p style=\"padding-left: 40px;\">4. On the other hand, the experts of the DRC did not see any intelligible explanation why the Client&#8217;s actions violate any Trading Rules of the Broker:<\/p>\n<p style=\"padding-left: 40px;\">a) Experts did not see any problem with the client using a VPS, nor any problem with a client using an EA, nor any problem with the EA using &#8220;client&#8221; tag instead of &#8220;expert&#8221; tag;<\/p>\n<p style=\"padding-left: 40px;\">b) Experts did not see any risk-free trading from the statement on the Client’s account, since most of the Client’s positions were opened and held for a long time without locking. The advantage in the opening or\/and the closing price can be leveled by the movement of the market. As such, trading risks were in place in this case.<\/p>\n<p style=\"padding-left: 40px;\">с) In the experts’ opinion, price arb between brokers is a really smart way to trade. There is no problem with this since it is a very well accepted way of trading that is used by the highest level of professional traders at bank and hedge funds;<\/p>\n<p style=\"padding-left: 40px;\">d) Also, the pricing of the product (XAUUSD) in the period of the incident was obviously very aggressive, but in the end that pricing was received from an LP and passed to the Client or generated by the Broker themselves. Scenarios like this have been seen before: where the LP skews its pricing according to its own exposure, which makes the prices much more aggressive and exposes the broker. This is not uncommon practice, but this is a problem that the broker needs to take care of with their LP, not with the trader.<\/p>\n<p>As such, in the common opinion of the DRC members, the Broker does not have sufficient grounds to assert that the disputed transactions performed on the Client’s trading account # 599941130 were executed at lagging \/ non-market prices. It is unlikely that the Client might have used special technical means (EA) exploiting vulnerabilities in the Broker’s quotation system.<\/p>\n<p>Based on the above, the members of the DRC of the Financial Commission have ruled in favor of the Client and decided the following:<\/p>\n<ol>\n<li>Recognize the transactions disputed by the Broker as legitimate.<\/li>\n<li>Consider the cancellation of the financial results of this series of transactions by the Broker as unlawful.<\/li>\n<li>Hold the Broker liable for belated provision of the requested documentary evidence (statement, server log records).<\/li>\n<li>Hold the Broker liable for the provision of edited version of the statement, which makes it impossible to conduct a swift and thorough analysis of the Client’s trading activity.<\/li>\n<li>According to the DRC’s decision a compensation in the amount of 3657 USD should be paid to the Client.<\/li>\n<\/ol>\n<p>Also, the experts of the DRC expressed their common opinion with regards to the organization of the sustainable operational process of the Broker&#8217;s infrastructure: DRC experts believe that if a Broker cannot provide a normal supply of prices, they should look for another source of information. Currently, there are many companies offering high-quality Market Data that can be used without any risk to business. According to the experts of the DRC, the Broker should take on the risks associated with the quality of the quotations supplied.<\/p>\n<p>This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\"><strong>Ruled in Favor<\/strong><\/td>\n<td colspan=\"2\"><strong>Compensation<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Client<\/td>\n<td colspan=\"2\">3657 USD<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Acknowledgement<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td><strong>Signature<\/strong><\/td>\n<td colspan=\"3\"><strong>Designation<\/strong><\/td>\n<td><strong>Date<\/strong><\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>25\/04\/2022<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter The Client has lodged this complaint with the Financial Commission on the following grounds: The Client used account # 599941130 (USD) for active operations with the instruments of FX market. According to the Client, all trades performed on the specified trading account were opened either manually or by the means of EA, which [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-128952","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/128952","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=128952"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/128952\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=128952"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=128952"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=128952"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}