{"id":147330,"date":"2024-03-05T17:11:04","date_gmt":"2024-03-05T17:11:04","guid":{"rendered":"https:\/\/financialcommission.org\/?p=147330"},"modified":"2024-03-05T17:11:50","modified_gmt":"2024-03-05T17:11:50","slug":"customer-complaint-dated-march-29th-2023","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/03\/05\/customer-complaint-dated-march-29th-2023\/","title":{"rendered":"Customer Complaint Dated March 29th 2023","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p>Mr. XXX has lodged this complaint with the Financial Commission on the following grounds:<\/p>\n<p>The client used account # XXX for active trading operations with Forex and CFD market instruments. At the time of the incident, 4 Short positions on the EURAUD financial instrument were opened on the specified trading account, with a total volume of 0.93 lots. The incident on the Client&#8217;s trading account occurred on Monday, March 27, 2023, at 00:59 (server time).<\/p>\n<p>At the specified time, as a result of an unfavorable price change, as well as an expansion of the spread on the financial instrument EURAUD, positions ## 50743483, 50900194, 51427174, 52024537 of the Client were forcibly liquidated by the Broker due to a shortage of margin collateral (Stop Out). The total amount of the Client&#8217;s financial losses as a result of the incident amounted to 171,745.44 RUR. The Client does not agree with the Broker’s decision (see below) regarding his claim and believes that the Broker’s liquidation of the disputed positions was carried out unlawfully.<\/p>\n<p>According to the Client, during the period of the incident Stop Out should not have worked on his trading account, since the disputed positions were liquidated immediately after the Broker increased the spread on the EURAUD financial instrument to more than 300 points (0.00300). According to the Client, at the beginning of the trading session, the spread for this currency pair at the Broker was a maximum of 260 points. After increasing the spread to 300+ points and liquidating the disputed positions, the Broker reduced the spread to 60–70 points and the price began to change in a direction favorable to the Client.<\/p>\n<p>In addition to the above, the Client claims that the liquidation of positions occurred without warning from the Broker about the low margin percentage. At the time the spread widened in the first hour of trading, the margin percentage was 124%. The liquidation of positions occurred at a margin level of 1.59%, although in the “Trading Conditions” section on the Broker’s website it is indicated that the Stop Out level is 20%.<\/p>\n<p>In connection with the above, the Client requests the Resolution Committee of the Financial Commission to verify the correctness and legality of the Broker’s actions to liquidate the disputed positions during the incident. As documentary evidence, the Client provided the investigation with screenshots of the price dynamics of the financial instrument EURAUD and the parameters of trading account # XXX 57 minutes before the incident, taken from the Broker’s trading platform.<\/p>\n<p>For its part, the Broker does not see any grounds for the Client’s claim and believes that all of his transactions were executed correctly, at market prices current at the time of the transaction and in full compliance with the provisions of regulatory documents, as well as the trading conditions accepted by the Company.<\/p>\n<p>According to the Broker, during the incident no errors or failures in the operation of services were recorded on the Company’s side. In support of its position, the Broker provided the history of the Client’s trading operations, the trading server log records, as well as the history of tick data for the EURAUD financial instrument during the incident.<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">07\/09\/2023<\/td>\n<td colspan=\"3\">29\/03\/2023<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint Response:<\/strong><\/p>\n<p>The decision on this complaint is based on the information provided by the brokerage company XXX  and Mr. XXX<\/p>\n<p>After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/p>\n<ol>\n<li>First of all, it is necessary to note the fact that the incident on the Client’s trading account occurred during a thin market period, at the beginning of the Asian trading session after the weekend. The client should be aware that during this period there is often a significant decrease in liquidity in the market. In turn, this circumstance radically changes the flow of quotes, leading to a sharp widening of spreads and the formation of price gaps. The Client must be aware that conducting trading operations in such market conditions is accompanied by significant risks.<\/li>\n<\/ol>\n<ol start=\"2\">\n<li>Secondly, it should be noted that Stop orders, which also include an order of the Buy Stop\/Sell Stop type, inherently do not guarantee the execution of client orders exactly at the price specified in them. Depending on the market situation, such orders can be executed either exactly at the price specified in them, or at a price worse than specified. A pending Stop order becomes active as soon as at least one quote in the stream of prices broadcast by the broker reaches the price value specified by the client.<\/li>\n<\/ol>\n<p>If we reveal in detail the logic of executing a Stop order on the real market, it will look like this: when the market reaches the price specified in the client’s order, the system submits a Market order at any price available on the market (in the market depth) for a given volume. In this case, execution will occur according to the queue of current positions registered on the Broker&#8217;s server.<\/p>\n<ol start=\"3\">\n<li>Thirdly, according to the trading conditions specified in the corresponding section on the Broker’s website, as well as in the Broker’s regulatory documents (see clauses 2.1, 2.4 c) of the Regulations for trading operations for Standard Market MT4 accounts), the Client’s trading account has a floating spread , as well as Stop Out at 20%. Opening a trading account of the specified type by the Client means the latter’s consent to accept the trading conditions offered by the Broker. In this regard, it should be noted that according to the information provided by the Broker, during the period of the incident, the margin level on the Client’s trading account dropped below critical (1.56%), and therefore, the Broker forcibly liquidated the Client’s unprofitable positions ## 50743483, 50900194, 51427174, 52024537 . This fact is confirmed by the trading server log records, as well as the history of tick data for the financial instrument EURAUD, provided by the Broker. The Broker’s actions during the incident fully comply with the provisions of clauses 7.1-7.2 of the Regulations:<\/li>\n<\/ol>\n<p>7.1 The Company has the right to forcefully close the Client’s open positions without consent and any prior notice if the “Equity”\/“Funds” ratio on the trading account falls below the Stop out level. The Stop out level is indicated on the Company’s website in the “Trade conditions” section.<\/p>\n<p>7.2 The margin level is controlled by the server, which, if condition 7.1 is met, generates an order to forcefully close all positions on instruments during their trading session without prior notice. Stop out is executed at the market price in the order of the general queue with the Clients&#8217; orders. The Client agrees that the execution price may differ from the quote at which the Stop out order was generated. Forced closing of a position is accompanied by a corresponding entry in the server log file with the comment “Stop out or so”.<\/p>\n<ol start=\"4\">\n<li>Fourthly, regarding the Broker’s obligation to warn the Client about the need to replenish the balance of the trading account due to a drop in the margin level on his trading account, which the Client also mentions in the text of his complaint. In this regard, it should be noted that, according to the provisions of the Broker’s regulatory documents:<\/li>\n<\/ol>\n<p>2.34 The Client undertakes to independently monitor the level of the required margin on his trading account.<\/p>\n<ol start=\"5\">\n<li>Fifthly, to ensure an objective investigation, the Resolution Committee requested the history of quotes for the financial instrument in the Client’s disputed positions at the time of the incident from other independent financial service providers. The Financial Commission uses several different sources such as Verify My Trade, Tradeproofer, Tradefora, TrueFX, FX Benchmark and some others to check the quality of trade execution. According to the general opinion of the Committee members, the financial result (-171745.44 RUR) obtained by the Client in the disputed transactions should be canceled by the Broker. The Committee members came to this conclusion after comparing the Broker’s quotes offered to the Client with quotes obtained from other reliable sources. During the period of the incident, quotes for the financial instrument EURAUD in the Broker&#8217;s quote stream differed significantly from quotes received from other independent financial service providers, and thus did not reflect the real situation on the market.<\/li>\n<\/ol>\n<ol start=\"6\">\n<li>Finally, it should also be noted that when making a decision on this claim, the members of the Committee took into account the following circumstances:<\/li>\n<\/ol>\n<p style=\"padding-left: 40px;\">a) The Client did not use pending Stop Loss orders to limit potential financial losses on disputed positions ## 50743483, 50900194, 51427174, 52024537, and was thus prepared to lose the entire deposit under certain circumstances.<\/p>\n<p style=\"padding-left: 40px;\">b) a few hours after the incident, the price of the EURAUD financial instrument reached the level at which Stop Out on the Client’s trading account should have been triggered.<\/p>\n<p style=\"padding-left: 40px;\">c) the Client&#8217;s pending Take Profit orders were not and could not be executed until now, since the price of the EURAUD financial instrument did not reach the appropriate levels.<\/p>\n<p>Taking into account the above, as well as the documentary evidence provided by the Broker, the Committee experts came to a consensus that the Broker’s liquidation of the Client’s unprofitable positions ## 50743483, 50900194, 51427174, 52024537 was incorrect. In connection with this circumstance, the members of the Committee proposed a compromise solution to the parties to the dispute: to restore positions ## 50743483, 50900194, 51427174, 52024537, provided that the Client is ready to deposit additional funds into the trading account # XXX necessary to maintain these positions (taking into account the level Stop Out 20%, as well as the price dynamics of the EURAUD financial instrument that took place after the incident).<\/p>\n<p>If the Client is ready to restore the disputed positions, and within three days from the date of this decision fulfills the conditions named by the Committee, the disputed positions must be restored by the Broker.<\/p>\n<p><em>This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/em><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\"><strong>Ruled in Favor<\/strong><\/td>\n<td colspan=\"2\"><strong>Compensation<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Client<\/td>\n<td colspan=\"2\">None<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Acknowledgement<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td><strong>Signature<\/strong><\/td>\n<td colspan=\"3\"><strong>Designation<\/strong><\/td>\n<td><strong>Date<\/strong><\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>17\/04\/2023<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mr. XXX has lodged this complaint with the Financial Commission on the following grounds: The client used account # XXX for active trading operations with Forex and CFD market instruments. At the time of the incident, 4 Short positions on the EURAUD financial instrument were opened on the specified trading account, with a [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-147330","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147330","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=147330"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147330\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=147330"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=147330"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=147330"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}