{"id":147318,"date":"2024-03-05T11:23:23","date_gmt":"2024-03-05T11:23:23","guid":{"rendered":"https:\/\/financialcommission.org\/?p=147318"},"modified":"2024-03-05T12:07:29","modified_gmt":"2024-03-05T12:07:29","slug":"147318","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/03\/05\/147318\/","title":{"rendered":"Customer Complaint Dated December 21st 2023","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Complaint Matter<\/strong><\/p>\n<p>The Client has lodged this complaint with the Financial Commission on the following grounds:<\/p>\n<p>Complaint Matter<\/p>\n<p>The Client used account # XXX (SGD) for active operations with the financial instruments of the FX market. Prior to the incident the Client established several positions (Long and Short) with the financial instrument XAUUSD on the specified account.<\/p>\n<p>Thus, by the time of the incident:<\/p>\n<ul>\n<li>The total volume of Long positions in the financial instrument XAUUSD was equal to 45 lots;<\/li>\n<li>The total volume of Short positions in the financial instrument XAUUSD was equal to 81 lots;<\/li>\n<li>The volume of Aggregate Short position in the financial instrument XAUUSD was equal to 64 lots.<\/li>\n<\/ul>\n<p>The incident on the Client’s account occurred on November 13, 2023, at 01:30 (server time, UTC+2). At the specified time, due to the unfavourable change in the price of the financial instrument XAUUSD, the Equity\/Margin ratio on the Client’s account fell below the critical level of 20%. Therefore, the Client’s positions ## 15277912, 15291904, 15291997, 17598230, 17627465, 17651169, 17735218, 17753357, 17973560, 18009662, 18009713, 18009758, 18009759, 18009893, 18076189, 18105997, 18106345, 18106350, 18106568, 18126509, 18130179, 18130726, 18169068, 18169284, 18176490, 18176499, 18176755, 18177970, 18178101 were liquidated by the Broker due to lack of Margin (Stop Out). The total amount of the Client’s financial losses was 73902.41 SGD.<\/p>\n<p>Following the incident, the Broker admitted that during the period of the incident, the Company experienced a pricing error, that resulted in the erroneous closing of the Client’s positions. According to the Broker, incorrect quotes for the financial instruments XAUUSD, XAUEUR, XAUGBP and XAUAUD were received from one of its liquidity providers at the close of the Client’s trades, and the disputed positions were incorrectly closed. Therefore, on November 13, 2023, between 9:59 and 10:01 (server time) the Broker made the adjustment to the Client’s account in accordance with its Error Handling Policy. Appropriate notifications were sent to affected clients at 16:30 (UTC+8), i.e. just a few hours after the adjustments were made. In addition, as a gesture of goodwill, the Broker offered the Client additional compensation in the amount of 1200 SGD.<\/p>\n<p>The Client is not satisfied with the Broker’s decision on this complaint (see below), holds the Broker responsible for the financial losses that occurred on trading account # XXX and refuses the compensation offered by the Broker. The Client believes that the disputed positions could have been closed with much higher profits, if not for the pricing error on the Broker’s platform, as the price of the financial instrument XAUUSD reached all-time highs in a few days after the incident. In this regard, the Client requests the Dispute Resolution Committee of the Financial Commission to verify the correctness of the Broker’s actions during the incident and demands compensation from the Broker in the amount of 54000 SGD (i.e. 2\/3 of total financial losses caused by the incident).<\/p>\n<p>In turn, the Broker does not see any grounds for the Client&#8217;s complaint, since in their opinion, they acted in full compliance with the provisions of their regulatory documents and trading rules established by the Company. The Broker has provided the investigation with the official response to the Client’s complaint, the history of the Client’s trading \/non-trading operations, as well as the history of quotes on the financial instrument XAUUSD and the server log records in the period of the incident, as documentary evidence<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">13\/11\/2023<\/td>\n<td colspan=\"3\">21\/12\/2023<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint Response:<\/strong><\/p>\n<p>The decision on this complaint is based on the information provided by the brokerage company XXXXX and Ms. XXXXXX.<\/p>\n<p>After a comprehensive analysis of the documentary evidence provided by the Client and the Broker the Dispute Resolution Committee of the Financial Commission has come to the following conclusions:<\/p>\n<p>1. First of all, it should be noted that, based on the information from the documents received from the Broker (full trading statement, server log), the chronology of events in the period of the incident developed as follows:<\/p>\n<p style=\"padding-left: 40px;\">a)  At the end of the trading day on Friday, November 10, 2023, the amount of Equity on the Client’s trading account was 1557.66 SGD. This fact is confirmed by the history of trading operations performed on the Client’s account # 4329333.<\/p>\n<p style=\"padding-left: 40px;\">b) On November 10 and 11, 2023, the Client made additional deposits in the amount of 1500 SGD, as well as the internal transfer of funds in the amount of 236.59 SGD. The fact of the relevant non-trading operations performed on the Client’s account is confirmed by 3 balance sheet transactions ## 18178672, 18180001, 18180007.<\/p>\n<p style=\"padding-left: 40px;\">c) Thus, at the end of Sunday, November 12, 2023, the amount of Equity on the Client&#8217;s trading account should not be less than 3294.25 SGD.<\/p>\n<p style=\"padding-left: 40px;\">d) On 13.11.2023 at 01:30:51-59 non-market quotes from one of the Broker’s liquidity providers entered the price flow for the financial instrument XAUUSD.<\/p>\n<p style=\"padding-left: 40px;\">e) As a result of the pricing incident, the Client’s positions ## 15277912, 15291904, 15291997, 17598230, 17627465, 17651169, 17735218, 17753357, 17973560, 18009662, 18009713, 18009758, 18009759, 18009893, 18076189, 18105997, 18106345, 18106350, 18106568, 18126509, 18130179, 18130726, 18169068, 18169284, 18176490, 18176499, 18176755, 18177970, 18178101 were forcibly closed by Stop Out.<\/p>\n<p style=\"padding-left: 40px;\">f) On November 13, 2023, the Broker made the necessary adjustment to the Client’s account # XXX in the amount of 3251.65 SGD. The fact of the adjustment is confirmed by the balance sheet transactions ## 18186892, 18186893, 18186894, 18186896, 18186899, 18186901, 18186904, 18186907, 18186928, 18186930, 18186931, 18186933, 18186934, 18186935, 18186938, 18186943, 18186944, 18186945, 18186946, 18186992, 18187009, 18187015, 18187024, 18187025, 18187054, 18187055, 18187057, 18187074, 18187095.<\/p>\n<p style=\"padding-left: 40px;\">g) The Broker claims that the amount of compensation was calculated based on the last valid quotes for the financial instrument XAUUSD available in the Broker’s platform before market close on Friday, November 10, 2023, e. 1938.18 \/ 1939.08.<\/p>\n<p>2. Second, the Broker indicates that the adjustment they made based on the last valid quote 1938.18 \/ 08 is the fair offer they can provide to the Client:<\/p>\n<p style=\"padding-left: 40px;\">a) Although the pricing incident did realize 70000 SGD losses, it neither increased the Client&#8217;s loss nor left the Client with less equity than what was in her account immediately before the incident<\/p>\n<p style=\"padding-left: 40px;\">b) In addition, according to the Broker, their investigation revealed that the Client started executing short positions in XAUUSD within an hour of receiving cash adjustments to her trading account. Therefore, the Broker believes that the Client could have instead chosen to re-instate the net 0.64 lot Long position if she had a bullish view at prices that were at a similar level for at least a couple of hours after the first post-adjustment XAUUSD trade.<\/p>\n<p style=\"padding-left: 40px;\">с) Finally, the Broker disagrees with the Client’s belief that she would have recovered all her unrealized losses if she had left the position open. The reason is that if the Client had chosen to reopen her net 64 lot Long position, it would have required the XAUUSD price to rise by around 887 dollars. However, in reality, the XAUUSD price was only averaging about 100 dollars higher, with a peak of 2132 USD registered on December 4, 2023.<\/p>\n<p>In support of their position the Broker referred to the following provisions of its Client Agreement:<\/p>\n<ol start=\"3\">\n<li><em>4<\/em><em> ERRORS IN PRICES<\/em><\/li>\n<\/ol>\n<p><em>Errors<\/em> <em>in<\/em> <em>pricing<\/em> <em>may<\/em> <em>occur<\/em> <em>from<\/em> <em>time<\/em> <em>to<\/em> <em>time.<\/em> <em>In<\/em> <em>these<\/em> <em>circumstances,<\/em> <em>we<\/em> <em>may<\/em> <em>adjust<\/em> <em>any<\/em> <em>element<\/em> <em>of<\/em> <em>your<\/em> <em>Position.<\/em><\/p>\n<p><em>Our prices reflect those in the Underlying Instrument. Prices can vary quickly and in some circumstances prices that <\/em><em>we<\/em> <em>publish<\/em> <em>may<\/em> <em>not<\/em> <em>be<\/em> <em>available<\/em> <em>for<\/em> <em>large<\/em> <em>volumes.<\/em><\/p>\n<p><em>In addition,<\/em> <em>errors<\/em> <em>can occur,<\/em> <em>and we reserve the right to alter<\/em> <em>the price or<\/em> <em>even void the transaction.<\/em> <em>Our<\/em> <em>aim<\/em> <em>in making<\/em> <em>any<\/em> <em>adjustment<\/em> <em>to<\/em> <em>pricing<\/em> <em>will<\/em> <em>be<\/em> <em>to<\/em> <em>act<\/em> <em>fairly<\/em> <em>to<\/em> <em>you.<\/em> <em>We<\/em> <em>will<\/em> <em>not<\/em> <em>seek<\/em> <em>to<\/em> <em>take<\/em> <em>advantage<\/em> <em>of<\/em> <em>pricing<\/em> <em>errors<\/em> <em>to <\/em><em>advantage ourselves.<\/em><\/p>\n<p><em> <\/em><em>If<\/em> <em>we<\/em> <em>consider<\/em> <em>that<\/em> <em>a<\/em> <em>pricing<\/em> <em>Error<\/em> <em>has<\/em> <em>occurred,<\/em> <em>we<\/em> <em>may<\/em> <em>adjust<\/em> <em>various<\/em> <em>parameters<\/em> <em>of<\/em> <em>your<\/em> <em>Position,<\/em> <em>including <\/em><em>potentially reversing or closing out Positions, which may mean that your profit is less than would otherwise be the <\/em><em>case,<\/em> <em>or<\/em> <em>even<\/em> <em>that<\/em> <em>you<\/em> <em>incur<\/em> <em>a<\/em> <em>loss.<\/em> <em>However,<\/em> <em>such<\/em> <em>an<\/em> <em>adjustment<\/em> <em>will<\/em> <em>only<\/em> <em>occur<\/em> <em>when<\/em> <em>we<\/em> <em>are<\/em> <em>satisfied<\/em> <em>that<\/em> <em>a <\/em><em>genuine pricing Error has occurred, that is, the price or value of the Position did not accurately reflect the price or <\/em><em>value<\/em> <em>of<\/em> <em>the<\/em> <em>relevant<\/em> <em>Underlying<\/em> <em>Instrument.<\/em><\/p>\n<p>3. Third, in order to ensure an objective investigation of the case, the DRC requested historical price data for the financial instrument in the disputed transactions from other independent providers of financial services. Financial Commission uses several different sources, such as Tradeproofer, Tradefora, Verify My Trade, TrueFX, FX Benchmark and some others for the purpose of verifying the quality of trades’ execution. The comparison of the Broker’s quotes offered to the Client with the quotes received from independent sources confirmed the fact that the Bid\/Ask quote (1938.18\/1939.08) for the financial instrument XAUUSD registered at the end of the trading day, 10.11.2023, and used by the Broker for the calculation of the amount of compensation, reflected the actual situation on the market. Also, for the purpose of calculating the potential profits\/losses on the Client’s disputed positions, the DRC determined that on December 3, 2023, at 23:33:59 UTC the average Bid\/Ask quotes for the financial instrument XAUUSD reached its all-time high, i.e. 2144.40\/2146.70.<\/p>\n<p>4. Fourth, regarding the unrealized profits on the disputed positions, which the Client claims were missed due to the pricing error on the Broker’s side, the following should be noted:<\/p>\n<p style=\"padding-left: 40px;\">a) According to the documentary evidence provided by the Broker (full trading statement, server log records), the disputed Long positions ## 15277912, 15291904, 15291997, 17973560, 18009893, 18076189, 18105997, 18106345, 18106350, 18106568, 18126509, 18130179, 18130726, 18169068, 18169284 with pending Take Profit orders attached to them could have generated losses in the amount of (-) 2133.56 SGD after their execution (not including additional negative Swap fees since the date of the incident).<\/p>\n<p style=\"padding-left: 40px;\">b) After the execution of the pending Take Profit orders placed by the Client (including the one attached to Long position # 15277912, at the highest price level of 75), the Client’s exposure could have been changed from Net Long 0.64 lots to Net Short 2.61 lots.<\/p>\n<p style=\"padding-left: 40px;\">с) The Client did not attach any Take Profit orders to the disputed Long positions ## 18009662, 18009713, 18009758, In other words, the Client did not in any way indicate her intentions with respect to the relevant positions. Thus, on December 3, 2023, at 23:33:59 UTC the specified positions could have generated profits in the amount of 42550.84 SGD (not including additional negative Swap fees since the date of the incident).<\/p>\n<p style=\"padding-left: 40px;\">d) The Client did not attach any Stop Loss orders to the disputed Short positions ## 17598230, 17627465, 17651169, 17735218, 17753357, 18176490, 18176499, 18176755, 18177970, 18178101. In other words, the Client did not in any way limit the potential losses on the relevant positions. Thus, on December 3, 2023, at 23:33:59 UTC the specified positions could have generated losses in the amount of (-) 120906.80 SGD (not including additional positive Swap fees since the date of the incident).<\/p>\n<p style=\"padding-left: 40px;\">e) Thus, in the absence of the pricing error on the Broker’s platform, the amount of Equity on the Client’s account would have eventually decreased, and the Equity\/Margin ratio would have fallen below the critical Stop-Out level.<\/p>\n<p>Summarizing all the above the Dispute Resolution Committee has ruled in favor of the Broker. Considering the circumstances of the case, as well as the documentary evidence provided by the Broker, the experts of the DRC have found the actions of the Broker in the period of the incident as correct and legitimate. The Client’s suggestion that the Broker “stole her account” is a common misconception by retail traders who don’t understand that from a mark-to-market perspective unrealized losses are the same as realized losses. In the general opinion of the DRC members, the Client does not have sufficient grounds to demand additional compensation from the Broker for the unrealized profits. At the same time, the members of the DRC agreed that the compensation offered by the Broker is reasonable and appropriate in this case.<\/p>\n<p>This complaint was reviewed by the members of the Dispute Resolution<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\"><strong>Ruled in Favor<\/strong><\/td>\n<td colspan=\"2\"><strong>Compensation<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Broker<\/td>\n<td colspan=\"2\">None<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Acknowledgement<\/strong><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td><strong>Signature<\/strong><\/td>\n<td colspan=\"3\"><strong>Designation<\/strong><\/td>\n<td><strong>Date<\/strong><\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>29\/01\/2024<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter The Client has lodged this complaint with the Financial Commission on the following grounds: Complaint Matter The Client used account # XXX (SGD) for active operations with the financial instruments of the FX market. Prior to the incident the Client established several positions (Long and Short) with the financial instrument XAUUSD on the [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-147318","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147318","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=147318"}],"version-history":[{"count":1,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147318\/revisions"}],"predecessor-version":[{"id":147320,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147318\/revisions\/147320"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=147318"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=147318"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=147318"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}