{"id":147861,"date":"2024-03-21T17:03:04","date_gmt":"2024-03-21T17:03:04","guid":{"rendered":"https:\/\/financialcommission.org\/?p=147861"},"modified":"2024-03-21T17:03:04","modified_gmt":"2024-03-21T17:03:04","slug":"ic-markets-partners-with-bloomberg-media-studios-for-season-4-of-ic-your-trade","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/03\/21\/ic-markets-partners-with-bloomberg-media-studios-for-season-4-of-ic-your-trade\/","title":{"rendered":"IC Markets Partners with Bloomberg Media Studios for Season 4 of IC Your Trade","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>IC Markets, retail FX and CFDs brokerage group based in Australia, is excited to announce the launch of the fourth season of its business vodcast, IC Your Trade (ICYT), in partnership with Bloomberg Media Studios. Since its debut in 2021, IC Your Trade has become a well-respected platform in the business world, offering insights and discussions that have attracted a global audience.<\/p>\n<p>The vodcast features interviews with a range of distinguished guests, including Bruce Lee, CEO of Keebeck Wealth Management; Dr. Pippa Malmgren, former adviser to the President of the United States; and Ken Lek, Head of Strategic Finance at Grab. These guests share their perspectives on financial market trends and opportunities.<\/p>\n<p>Season 4 of IC Your Trade continues to explore significant economic trends, with host Pamela Ambler discussing topics like the emergence of SuperApps, advancements in Artificial Intelligence, and the new space race expected in 2024. The series has been recognized for its quality content, receiving the Signal Award for &#8220;Branded Business Show and Advertising&#8221; and being named an Honouree at the Webby Awards.<\/p>\n<p>Eric M. Pascal, Global Head of Digital Currencies at Standard Chartered Bank, shared his experience participating in the vodcast: &#8220;Digital Assets are a complex topic, and IC Your Trade offers a platform to discuss these in depth, thanks to its collaboration with Bloomberg Media Studios.&#8221;<\/p>\n<p>Dr. Pippa Malmgren also praised the program: &#8220;In an age where news is often condensed into brief snippets, IC Your Trade stands out by offering detailed discussions on geopolitics, among other topics.&#8221;<\/p>\n<p>New episodes of IC Your Trade are released biweekly and are available in both Vodcast and Podcast formats. Audiences can find the series on the IC Markets YouTube Channel and on major streaming platforms, including Apple Podcasts, Amazon, Google Podcasts, and Spotify.<\/p>\n<p><strong>About IC Markets<\/strong><\/p>\n<p>Founded in 2007, IC Markets aims to provide the best trading experience for both retail and institutional clients, offering a range of services that cater to a global audience in over 200 countries. With a focus on bridging the gap between retail and institutional trading, IC Markets offers solutions that were once exclusive to investment banks and high-net-worth individuals. This approach has made IC Markets a preferred choice for active traders seeking a supportive and intuitive trading environment.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>IC Markets, retail FX and CFDs brokerage group based in Australia, is excited to announce the launch of the fourth season of its business vodcast, IC Your Trade (ICYT), in partnership with Bloomberg Media Studios. Since its debut in 2021, IC Your Trade has become a well-respected platform in the business world, offering insights and [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":4,"featured_media":103867,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[59,72],"class_list":["post-147861","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news","tag-forex","tag-trading"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147861","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=147861"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147861\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/103867"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=147861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=147861"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=147861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}