{"id":147922,"date":"2024-03-25T19:58:06","date_gmt":"2024-03-25T19:58:06","guid":{"rendered":"https:\/\/financialcommission.org\/?p=147922"},"modified":"2024-03-25T19:58:06","modified_gmt":"2024-03-25T19:58:06","slug":"insights-on-the-ev-supply-chain-from-the-vantage-view-latest-episode","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/03\/25\/insights-on-the-ev-supply-chain-from-the-vantage-view-latest-episode\/","title":{"rendered":"Insights on the EV Supply Chain from &#8220;The Vantage View&#8221; Latest Episode","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>The recent &#8220;The Vantage View&#8221; episode delves into sustainable mobility, with a focus on the electrification of transport in Asia and its potential for investment. It highlights various investment prospects within the EV supply chain, including raw materials, battery technology, and charging infrastructure. This episode presents Asia as a key player in the electric mobility sector, evolving rapidly.<\/p>\n<p>&#8220;EVs are set to constitute 59% of all light-vehicle sales by 2035&#8221;<br \/>\nMarc Despallieres, Chief Strategy and Trading Officer at Vantage, expressed excitement about collaborating again with Bloomberg Media Studios to deliver the latest episode of The Vantage View. He emphasized the show&#8217;s role in providing viewers with in-depth insights into Asia&#8217;s evolving electric mobility scene and the growing adoption of sustainable transportation solutions. This episode is pivotal for understanding investment opportunities and market trends that are shaping the future of transportation.<\/p>\n<p>The episode features insights from Andrey Berdichevskiy of the Boston Consulting Group (BCG), focusing on the future of the automotive industry and the rapid adoption of Battery Electric Vehicles (BEVs). Berdichevskiy&#8217;s analysis predicts that BEVs will represent 59% of all light-vehicle sales by 2035 and expects a significant increase in electric two-wheelers in Asia by 2040. This underscores Asia&#8217;s vital role in the transition towards electric vehicles (EVs).<\/p>\n<p>Launched in Q3 2023 in collaboration with Bloomberg Media Studios, &#8220;The Vantage View&#8221; is a video series that brings expert analysis and opinions on a variety of critical political-economic topics to a wide audience quarterly. The series tackles subjects ranging from the impact of climate change policies on geopolitics to the influence of technological advancements like Artificial Intelligence on the financial markets. It aims to serve as a primary resource for diverse audiences, including investors, professionals, and those interested in global economic complexities.<\/p>\n<p>The series recently introduced an episode on the circular economy, featuring Dr. Seeram Ramakrishna from the National University of Singapore. He discusses the transition from a traditional linear economy to a circular one, emphasizing the societal benefits of the latter. The episode also touches on how the financial sector is moving towards circular practices to mitigate long-term risks and offers retail investors advice on contributing to the circular economy.<\/p>\n<p>The circular economy is a model that prioritizes resource efficiency and sustainability, marking a departure from the conventional linear economy&#8217;s &#8216;take-make-dispose&#8217; approach. This shift aims to minimize waste and environmental impact by focusing on positive societal outcomes, reducing the reliance on finite resources, and eliminating waste. The Ellen MacArthur Foundation reports that adopting circular economy principles could result in a net economic gain of $1 trillion annually by 2025, highlighting its environmental and economic benefits.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>The recent &#8220;The Vantage View&#8221; episode delves into sustainable mobility, with a focus on the electrification of transport in Asia and its potential for investment. It highlights various investment prospects within the EV supply chain, including raw materials, battery technology, and charging infrastructure. This episode presents Asia as a key player in the electric mobility [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":4,"featured_media":147923,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[7323,7324,7325],"class_list":["post-147922","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news","tag-bcg","tag-bevs","tag-evs"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147922","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=147922"}],"version-history":[{"count":1,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147922\/revisions"}],"predecessor-version":[{"id":147932,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/147922\/revisions\/147932"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/147923"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=147922"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=147922"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=147922"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}