{"id":148127,"date":"2024-04-01T20:08:53","date_gmt":"2024-04-01T20:08:53","guid":{"rendered":"https:\/\/financialcommission.org\/?p=148127"},"modified":"2024-04-01T20:08:53","modified_gmt":"2024-04-01T20:08:53","slug":"monetary-authority-of-singapore-mas-introduces-cosmic-for-enhanced-financial-sector-security","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/04\/01\/monetary-authority-of-singapore-mas-introduces-cosmic-for-enhanced-financial-sector-security\/","title":{"rendered":"Monetary Authority of Singapore (MAS) Introduces COSMIC for Enhanced Financial Sector Security","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Monetary Authority of Singapore (MAS) Introduces COSMIC for Enhanced Financial Sector Security<\/strong><\/p>\n<p>The Monetary Authority of Singapore (MAS) has introduced a new digital platform, COSMIC, designed to strengthen efforts within the financial sector to combat money laundering, terrorism financing, and proliferation financing.<\/p>\n<p>Coinciding with the implementation of the Financial Services and Markets (Amendment) Act 2023, COSMIC provides a framework for financial institutions (FIs) to exchange crucial customer information, thereby enhancing global financial crime prevention efforts.<\/p>\n<p><strong>COSMIC: An Outcome of FSMA Legislation Enhancement<\/strong><\/p>\n<p>The introduction of the Financial Services and Markets (Amendment) Act 2023 has expanded the capabilities of the previously established legislative framework under the Financial Services and Markets Act 2022 in Singapore. This amendment has laid the groundwork for COSMIC (Collaborative Sharing of Money Laundering\/Terrorism Financing Information &amp; Cases), a centralized digital platform enabling financial institutions to share customer information. The goal is to effectively tackle challenges such as money laundering, terrorism financing, and proliferation financing.<\/p>\n<p>The amendment introduces several key components:<\/p>\n<p>&#8211; <strong>Legal Framework for Information Sharing:<\/strong> A structured legal environment is established, permitting FIs to exchange details on customers exhibiting potentially suspicious activities, under stringent criteria to safeguard customer information.<br \/>\n&#8211; <strong>Safeguards and Confidentiality:<\/strong> It requires FIs to enforce policies and measures aimed at maintaining the confidentiality and integrity of the shared information through COSMIC, ensuring the protection of individual privacy rights while promoting effective cooperation against financial crimes.<br \/>\n&#8211; <strong>Operational Guidelines:<\/strong> Detailed operational guidelines for FIs participating in COSMIC are outlined, specifying the information that can be shared, conditions for sharing, and the procedures for information exchange.<br \/>\n&#8211; <strong>Promotion of Proactive Customer Engagement:<\/strong> It promotes the importance of customer cooperation with FIs by responding promptly to inquiries about their risk profiles or transactions, aiding in more accurate and effective risk assessments.<\/p>\n<p><strong>Participation by Major Banks in COSMIC<\/strong><\/p>\n<p>Following a public consultation in October 2021 and subsequent amendments to the Financial Services and Markets Act in May 2023, a legislative framework was established enabling FIs to share customer information based on clear suspicion indicators. This framework prioritizes data confidentiality and the protection of legitimate customer interests, encouraging active customer participation in the information-sharing process for precise risk evaluation.<\/p>\n<p>MAS has collaborated with six leading commercial banks in Singapore—DBS, OCBC, UOB, Citibank, HSBC, and Standard Chartered Bank—to initiate COSMIC. These banks represent the first group of participants, focusing on addressing significant financial crime risks within the commercial banking sector. Participation in COSMIC is on a voluntary basis.<\/p>\n<p>As quoted, Loo Siew Yee, Assistant Managing Director of Policy, Payments &amp; Financial Crime at MAS, said: “COSMIC will enable FIs to warn each other of suspicious activities and make more informed risk assessments on a timely basis. It complements the industry’s existing close collaboration with MAS and law enforcement authorities to combat financial crime. This will strengthen Singapore’s capabilities to uphold our reputation as a well-regulated and trusted financial centre.”<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Monetary Authority of Singapore (MAS) Introduces COSMIC for Enhanced Financial Sector Security The Monetary Authority of Singapore (MAS) has introduced a new digital platform, COSMIC, designed to strengthen efforts within the financial sector to combat money laundering, terrorism financing, and proliferation financing. Coinciding with the implementation of the Financial Services and Markets (Amendment) Act 2023, [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":4,"featured_media":148129,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[72,7377,6844,7378],"class_list":["post-148127","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news","tag-trading","tag-cosmic","tag-finance","tag-mas"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/148127","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=148127"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/148127\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/148129"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=148127"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=148127"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=148127"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}