{"id":150265,"date":"2024-08-06T18:52:42","date_gmt":"2024-08-06T18:52:42","guid":{"rendered":"https:\/\/financialcommission.org\/?p=150265"},"modified":"2024-08-14T13:35:08","modified_gmt":"2024-08-14T13:35:08","slug":"naga-introduces-trading-signals-and-updates-copy-trading-incentives","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/08\/06\/naga-introduces-trading-signals-and-updates-copy-trading-incentives\/","title":{"rendered":"NAGA Introduces Trading Signals and Updates Copy Trading Incentives","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>NAGA Enhances User Experience with New Features.<\/p>\n<p>NAGA, a European neobroker recently acquired by CAPEX.com, has announced a series of updates to improve user experience and create a more user-friendly trading environment. These changes affect both the platform and mobile app.<\/p>\n<p>NAGA has integrated Trading Central’s signals into its mobile app, providing users with timely and relevant trading insights. This feature allows traders to stay informed and make smarter trading decisions on the go. Additionally, the NAGA.com platform has revamped its interface, especially the Top Traders and Leaderboard sections, making it easier for users to discover and access detailed trader information.<\/p>\n<p>NAGA has also revised the fee structure and remuneration policy for its copy trading product. Now, fees and premiums are performance-based, reflecting actual trading outcomes. This system rewards successful trading strategies, enhancing overall user satisfaction.<\/p>\n<p>NAGA integrates social trading, stock and crypto investing, and neo-banking into one platform. It serves traders in over 100 countries and offers features like a physical VISA card with automatic crypto conversion and cashback, dynamic social feeds, and advanced auto copy functions for replicating top traders&#8217; strategies.<\/p>\n<p>NAGA is set to merge with Key Way Group Ltd., operating under the CAPEX.com brand, by the end of August 2024. This merger, approved by NAGA shareholders with a 99.81% vote, will create one of the world&#8217;s leading neo-brokers, serving approximately 1.5 million users in over 100 countries.<\/p>\n<p>NAGA has recently strengthened its management team, appointing Michael Milonas as Group CEO and Sam Chaney as Chief Commercial Officer. For the 2023 financial year, NAGA reported brokerage business revenue of €45.5 million, a 20% decline from the previous year&#8217;s €57.6 million. However, the company&#8217;s EBITDA improved significantly to €7 million, up from a loss of €13.7 million the previous year.<\/p>\n<p>Following a summer restructuring, NAGA reduced its cost base by nearly two-thirds compared to the same period the previous year while maintaining new customer growth above 2022 levels. The company also optimized its user acquisition strategy, reducing marketing and sales spending from €26 million in the first nine months of 2022 to €4 million for the same period in 2023. Consequently, the average net acquisition cost per new account dropped from €1,269 in 2022 to €181 in 2023, with NAGA acquiring around 10,000 new funded accounts in the first three quarters of 2023, only 19% less than the previous year.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>NAGA Enhances User Experience with New Features. NAGA, a European neobroker recently acquired by CAPEX.com, has announced a series of updates to improve user experience and create a more user-friendly trading environment. These changes affect both the platform and mobile app. NAGA has integrated Trading Central’s signals into its mobile app, providing users with timely [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":4,"featured_media":150266,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[72,7790],"class_list":["post-150265","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news","tag-trading","tag-naga"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150265","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=150265"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150265\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/150266"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=150265"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=150265"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=150265"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}