{"id":150224,"date":"2024-07-22T19:43:01","date_gmt":"2024-07-22T19:43:01","guid":{"rendered":"https:\/\/financialcommission.org\/?p=150224"},"modified":"2024-07-22T19:53:51","modified_gmt":"2024-07-22T19:53:51","slug":"airwallex-secures-afsl-license-to-introduce-investment-products-in-australia","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/07\/22\/airwallex-secures-afsl-license-to-introduce-investment-products-in-australia\/","title":{"rendered":"Airwallex Secures AFSL License to Introduce Investment Products in Australia","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Airwallex has received an Australian Financial Services Licence (AFSL) from the Australian Securities and Investment Commission (ASIC).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This authorization by the regulator formalizes Airwallex’s entry into investment products, marking the company’s evolution toward becoming a comprehensive financial services platform.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This AFSL is an additional license to the one Airwallex has held for its payments and foreign exchange business since 2016.<\/span><\/p>\n<p><b>Airwallex to Launch Yield Product to Retail Market<\/b><\/p>\n<p><span style=\"font-weight: 400;\">The announcement comes just eight months after Airwallex launched Airwallex Yield for wholesale customers, enabling them to earn attractive returns on their AUD and USD balances without needing to open a foreign bank account – a first in Australia.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With this expansion, Airwallex Yield will now be available to the broader retail market with a lower minimum investment requirement of AUD$10K (or USD equivalent) starting today.<\/span><\/p>\n<p><b>Airwallex Yield will allow customers to:<\/b><\/p>\n<p><span style=\"font-weight: 400;\">&#8211; Invest with a minimum investment of AUD$10K (or USD equivalent);<\/span><\/p>\n<p><span style=\"font-weight: 400;\">&#8211; Invest in funds that have historically returned more than triple the interest rates of saver accounts of the big four banks, with a current daily return of 3.67 percent for AUD balances and 3.95 percent for USD balances (compared to 1.06 percent p.a. and 0.50 percent p.a. respectively*);<\/span><\/p>\n<p><span style=\"font-weight: 400;\">&#8211; Avoid lock-up periods and easily move funds between their cash wallet balances and their Yield account, unlike term deposits.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With Airwallex Yield, customers can invest in a product managed by J.P. Morgan Asset Management (J.P. Morgan), one of the world’s most trusted asset management firms. The J.P. Morgan underlying funds hold the highest rating from Standard &amp; Poor’s at ‘AAAm’ grade, and equally high ratings from all leading rating agencies.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Since its launch, Airwallex Yield has been available to businesses with a minimum investment of AUD $500K or USD equivalent. To date, Airwallex Capital Pty Ltd has attracted over AUD$100M in funds under management from customers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Airwallex Yield has been designed to be a competitive alternative for businesses as its returns more closely track the RBA cash rate than the rates offered by traditional providers – a priority in this high inflation environment. Businesses could earn more than triple the amount of a saver account with a big four bank by investing with Yield.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Yield’s underlying fund, JPMorgan Liquidity Fund, offers a daily return of 3.67 percent on AUD balances and 3.95 percent on USD balances, compared to an average of 1.06 percent per annum for business saver accounts with the big banks for AUD and 0.50 percent per annum for USD*.<\/span><\/p>\n<p><b>Yield for Flexibility, Attractive Rates, and Multi-Currency Capabilities<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Shannon Scott, SVP of Product at Airwallex, said: “We’re excited to expand upon Yield to position Airwallex as the modern alternative to banks for businesses of all sizes. This move into investment products underscores our role as a comprehensive financial services platform that can help businesses manage their finances more efficiently. It’s especially timely as Australian SMEs face economic challenges and rising costs. Yield empowers them with its flexibility, attractive rates of return and multi-currency capabilities – a solution businesses have been craving for years.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">George Boubouras, Managing Director, Research, Investments &amp; Advisory at K2 Asset Management Ltd (an Airwallex partner and issuer of the Yield product) said: “Cross-border trading companies can benefit from exposure to money market funds that are currently taking advantage of the higher yields on offer due to the higher Fed Funds cash rate in the US and domestically the higher cash rate set by the RBA. The benefits of a blended single multi-currency cash account that offers exposure to multiple currencies in a single account can assist with lower transaction costs and shorter settlement times compared to traditional currency accounts that offer lower yields and are more burdensome.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Matthew Le, Head of South East Asia &amp; Australia Sales, Global Liquidity, J.P. Morgan Asset Management, said: “J.P. Morgan Asset Management is delighted to partner with Airwallex. As a leading asset management firm, we have invested in our technology to evolve and meet the needs of financial service providers and the growing demands of customers today.”<\/span><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Airwallex has received an Australian Financial Services Licence (AFSL) from the Australian Securities and Investment Commission (ASIC). This authorization by the regulator formalizes Airwallex’s entry into investment products, marking the company’s evolution toward becoming a comprehensive financial services platform. This AFSL is an additional license to the one Airwallex has held for its payments and [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":4,"featured_media":150233,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[72,7745,7746,7747],"class_list":["post-150224","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news","tag-trading","tag-afsl","tag-airwallex","tag-reugulations"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150224","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=150224"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150224\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/150233"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=150224"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=150224"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=150224"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}