{"id":150846,"date":"2024-09-12T08:07:33","date_gmt":"2024-09-12T08:07:33","guid":{"rendered":"https:\/\/financialcommission.org\/?p=150846"},"modified":"2024-09-13T08:12:38","modified_gmt":"2024-09-13T08:12:38","slug":"tradu-integrates-tradingview-features-at-no-extra-cost","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/09\/12\/tradu-integrates-tradingview-features-at-no-extra-cost\/","title":{"rendered":"Tradu Integrates TradingView Features at No Extra Cost","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Tradu has partnered with TradingView to offer clients access to TradingView’s charting library, enhancing market analysis, creating custom charting templates, and executing trades seamlessly within the Tradu CFD ecosystem. The integration allows Tradu users to utilize TradingView’s powerful front-end tools without any additional fees, accessible through a single sign-on.<\/p>\n<p><strong>TradingView’s Advanced Charting Tools Now Available on Tradu<\/strong><\/p>\n<p>Tradu, part of Stratos and a wholly-owned subsidiary of Jefferies, provides active traders and investors with access to thousands of tradable assets, including equities, commodities, CFDs, forex, treasuries, indices, and cryptocurrencies. By integrating TradingView, Tradu enhances its multi-asset trading platform with top-tier charting and trading capabilities.<\/p>\n<p><strong>Key Features of TradingView on Tradu:<\/strong><\/p>\n<p>&#8211; Over 110 advanced drawing tools, 100+ technical indicators, and 10+ chart types<br \/>\n&#8211; Advanced charting functionalities, including trading from the chart, multiple charts display, custom resolutions, and advanced price scaling<br \/>\n&#8211; Real-time market news updates directly from Tradu’s newsfeed<br \/>\n&#8211; Secure server-side storage of watchlists and settings<\/p>\n<p><strong>Empowering Traders with Sophisticated Tools<\/strong><\/p>\n<p>Brendan Callan, CEO at Tradu, commented: “Our goal at Tradu has always been to provide our clients with the most sophisticated tools available to enhance their trading experience. TradingView has proven itself to be a leader in charting and trading solutions, and we are thrilled to offer its platform to our clients at no additional cost. This partnership aligns perfectly with our mission to deliver cutting-edge resources that empower active traders and investors to succeed.”<\/p>\n<p>Pierce Crosby, General Manager at TradingView, commented: “As a new platform, we find Tradu in a unique position in the market considering they are building all new technology and leveraging the best in class charting tools – among other great resources for traders. We will work closely with the Tradu team to bring new products to market and give traders the ability to trade multiple asset classes all from a single platform.”<\/p>\n<p><strong> Crypto Exchange<\/strong><\/p>\n<p>Tradu recently launched its crypto exchange, expanding beyond its multi-asset trading platform introduced in late 2023. The platform aims to offer low, transparent fees tailored for active traders, featuring over 40 cryptocurrencies, including Bitcoin and Ethereum.<\/p>\n<p><strong>Key Features of Tradu’s Crypto Exchange:<\/strong><\/p>\n<p>&#8211; Transparent fee structure with real-time spreads displayed before placing orders<br \/>\n&#8211; Low commission rate of 0.1%, with instant rebates of up to 0.05% for larger trades<br \/>\n&#8211; Option to choose between Zero Commission and Raw Spreads profiles<br \/>\n&#8211; Equal maker and taker fees for straightforward, fair trading<br \/>\n&#8211; Free crypto deposits and clear, simple withdrawal fees<br \/>\n&#8211; Access to 24\/7 customer support via email, chat, and phone<\/p>\n<p>Tradu’s platform also offers access to over 10,000 trading products across various asset classes, including equities, forex, and CFDs on commodities, stocks, treasuries, and indices. Users can access this robust trading portal through an intuitive mobile app and web platforms, making it easier than ever for traders to manage their investments across multiple markets.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Tradu has partnered with TradingView to offer clients access to TradingView’s charting library, enhancing market analysis, creating custom charting templates, and executing trades seamlessly within the Tradu CFD ecosystem. The integration allows Tradu users to utilize TradingView’s powerful front-end tools without any additional fees, accessible through a single sign-on. TradingView’s Advanced Charting Tools Now Available [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":4,"featured_media":150847,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[72,7683,7827],"class_list":["post-150846","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news","tag-trading","tag-tradingview","tag-tradu"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150846","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=150846"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150846\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/150847"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=150846"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=150846"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=150846"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}