{"id":150912,"date":"2024-09-24T13:39:07","date_gmt":"2024-09-24T13:39:07","guid":{"rendered":"https:\/\/financialcommission.org\/?p=150912"},"modified":"2024-09-24T13:39:07","modified_gmt":"2024-09-24T13:39:07","slug":"webull-reports-100-aum-growth-in-apac-region","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2024\/09\/24\/webull-reports-100-aum-growth-in-apac-region\/","title":{"rendered":"Webull Reports 100% AUM Growth in APAC Region","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>As of July 31, 2024, Webull has achieved an impressive 100% year-over-year (YoY) growth in assets under management (AUM) in the APAC region, according to a recent announcement by the US-based global discount broker.<\/p>\n<p>To celebrate this success, Webull President Anthony Denier visited the company&#8217;s Asia Pacific offices, reaffirming its commitment to expanding in the region.<\/p>\n<p>Building on its success in the U.S., Webull entered the APAC market in 2020, starting with Hong Kong SAR. The company later expanded into Singapore and Australia in 2022, followed by Japan and Indonesia in 2023, and most recently Malaysia and Thailand in 2024.<\/p>\n<p>“We are incredibly proud of Webull’s rapid expansion in the APAC region. Since we entered APAC in 2020, we have seen a steady increase in our user base, with investors leveraging Webull’s trading tools to develop comprehensive and diversified investment portfolios across the U.S. and APAC markets. In the next two years, Webull aims to be a top broker-dealer in every region, and we remain committed to developing innovative solutions that will allow us to grow significantly while ensuring trading remains accessible and affordable for all retail investors,” said Webull President Anthony Denier.<\/p>\n<p>Jonathan Man, Chief Executive Officer of Webull Singapore, commented: “Since we entered the Singapore market in 2022, we have witnessed a strong uptrend in our user base within a short two-year span. Investors in Singapore continue to seek attractive yields for their investments and Webull Singapore will strive to develop better, more innovative products and tools that will cater to the evolving needs of Singapore investors.”<\/p>\n<p>Launched in the U.S. in 2018, Webull has expanded its presence to APAC, Europe, Africa, and Latin America. The platform boasts over 40 million downloads and more than 20 million registered users globally.<\/p>\n<p>In 2023, Webull saw a 38% YoY growth in customer assets, reaching US$8.2 billion. The platform also recorded US$371 billion in U.S. equity notional trading volume and 430 million options contracts traded during the year. With a 98% user retention rate in Q4 2023, Webull continues to build a strong reputation for user experience and trust.<\/p>\n<p>As a leading digital brokerage, Webull is expanding across 13 global markets, empowering investors in the APAC region with tools to access U.S. markets.<\/p>\n<p>Since its 2022 launch, Webull Singapore has rapidly grown its user base, offering overnight U.S. stock trading and access to over 1,000 SGX-listed stocks, REITs, DLCs, and ETFs. Additionally, Webull Singapore provides risk-averse investors with access to 430 mutual funds and wealth management tools like Moneybull and a Regular Savings Plan.<\/p>\n<p>Webull leads Singapore&#8217;s digital brokerage space by offering low commission fees with no platform charges for U.S., Hong Kong, and A-shares trading. The platform charges a 0.025% commission for Singapore stocks and ETFs, with a minimum of SGD 0.80, and offers a 3-year commission-free campaign for local stock trading. It also provides advanced trading tools and level 2 U.S. market data for informed decision-making.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>As of July 31, 2024, Webull has achieved an impressive 100% year-over-year (YoY) growth in assets under management (AUM) in the APAC region, according to a recent announcement by the US-based global discount broker. To celebrate this success, Webull President Anthony Denier visited the company&#8217;s Asia Pacific offices, reaffirming its commitment to expanding in the [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":4,"featured_media":150913,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[59,72,7846,7845],"class_list":["post-150912","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news","tag-forex","tag-trading","tag-apac","tag-webull"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150912","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=150912"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/150912\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/150913"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=150912"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=150912"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=150912"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}