{"id":155461,"date":"2025-02-01T04:37:56","date_gmt":"2025-02-01T04:37:56","guid":{"rendered":"https:\/\/financialcommission.org\/xtb-sees-59-8-client-growth-in-2024-reports-record-investor-activity\/"},"modified":"2025-04-14T22:57:18","modified_gmt":"2025-04-14T22:57:18","slug":"xtb-sees-59-8-client-growth-in-2024-reports-record-investor-activity","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2025\/02\/01\/xtb-sees-59-8-client-growth-in-2024-reports-record-investor-activity\/","title":{"rendered":"XTB Sees 59.8% Client Growth in 2024, Reports Record Investor Activity","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<div><img decoding=\"async\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2025\/04\/xtb-sees-59-8-client-growth-in-2024-reports-record-investor-activity.jpg\" class=\"ff-og-image-inserted\"><\/div>\n<p><span class=\"post-date\">February 1, 2025<\/span><\/p>\n<p>XTB has revealed its preliminary results for 2024, showcasing a significant 59.8% increase in new clients, with 498,400 added throughout the year. This brings its total client base to 1.36 million, marking impressive growth. Active clients on the platform surged to a record 658,500, a 61.2% rise compared to the previous year.<\/p>\n<p>The company recorded consolidated revenues of EUR 435.3 million, up 21.8% from 2023, with net profit reaching EUR 199.7 million, reflecting a 14.3% increase despite higher operating costs, which rose to EUR 205.3 million. XTB attributed this growth to heightened investor interest, fueled by low interest rates and inflation. The company also focused on promoting financial literacy and providing users with tools for portfolio management and real-time transactions.<\/p>\n<p>48% of XTB’s earnings came from Contracts for Difference (CFDs) based on commodities, including gold, natural gas, and cocoa, which contributed most to profitability. Index-based CFDs accounted for 33.3% of total revenue, while currency-based CFDs contributed 14.6%, with bitcoin and the USD\/JPY pair being top performers. Additionally, XTB saw a 138% increase in turnover from shares and ETFs, reaching USD 3.1 billion.<\/p>\n<p>Omar Arnaout, CEO of XTB, said:&nbsp;“2024 has been a landmark year for XTB. I’m particularly excited about the significant growth in new clients, especially active investors, who are vital for our future success. We’ve welcomed nearly half a million new investors, thanks to our diverse product offerings and effective marketing strategies. Remarkably, about 80% of these clients start investing in shares and ETFs, suggesting strong long-term loyalty.”<\/p>\n<p>XTB surpassed its 2024 target of adding 65,000 to 90,000 new clients per quarter. For 2025, the company aims to acquire an average of 150,000 to 210,000 new clients each quarter. XTB also plans to expand its product offerings, including options and cryptocurrency trading, while continuing to enhance its services. The company introduced auto-investing features, new investment accounts in Poland and the UK, and a multi-currency eWallet card.<\/p>\n<p>“Our product plans respond to the dynamic changes in the world of finance and the needs of investors. We are continually developing the XTB application to provide users with a highly functional and comprehensive financial management platform. These new solutions bring us closer to becoming a European leader in the industry,” Omar Arnaout added.<\/p>\n<p>Looking ahead, XTB plans to enter the Brazilian market, introduce investment accounts in Poland and France, and further enhance its eWallet. The company is also preparing to expand into Indonesia by mid-2025.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>XTB has revealed its preliminary results for 2024, showcasing a significant 59.8% increase in new clients, with 498,400 added throughout the year. This brings its total client base to 1.36 million, marking impressive growth. Active clients on the platform surged to a record 658,500, a 61.2% rise compared to the previous year. The company recorded [&#8230;]<\/p>\n<p>The post <a href=\"https:\/\/financialcommission.org\/2025\/02\/01\/xtb-sees-59-8-client-growth-in-2024-reports-record-investor-activity\/\">XTB Sees 59.8% Client Growth in 2024, Reports Record Investor Activity<\/a> appeared first on <a href=\"https:\/\/financialcommission.org\">Home<\/a>.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":10,"featured_media":155464,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[],"class_list":["post-155461","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155461","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=155461"}],"version-history":[{"count":1,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155461\/revisions"}],"predecessor-version":[{"id":155463,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155461\/revisions\/155463"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/155464"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=155461"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=155461"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=155461"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}