{"id":155457,"date":"2025-02-11T09:17:56","date_gmt":"2025-02-11T09:17:56","guid":{"rendered":"https:\/\/financialcommission.org\/dma-to-acquire-majority-stake-in-saxo-australia-strategic-expansion-into-the-australian-market\/"},"modified":"2025-04-14T22:57:18","modified_gmt":"2025-04-14T22:57:18","slug":"dma-to-acquire-majority-stake-in-saxo-australia-strategic-expansion-into-the-australian-market","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2025\/02\/11\/dma-to-acquire-majority-stake-in-saxo-australia-strategic-expansion-into-the-australian-market\/","title":{"rendered":"DMA to Acquire Majority Stake in Saxo Australia: Strategic Expansion into the Australian Market","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<div><img decoding=\"async\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2025\/04\/dma-to-acquire-majority-stake-in-saxo-australia-strategic-expansion-into-the-australian-market.jpg\" class=\"ff-og-image-inserted\"><\/div>\n<p><span class=\"post-date\">February 11, 2025<\/span><\/p>\n<p>DMA, a leading global provider of all-in-one software solutions for financial advisers and wealth managers, has announced an agreement to acquire a majority stake in Saxo Australia, a prominent multi-asset investing specialist. This acquisition marks DMA’s strategic expansion into the Australian market, reinforcing its position as a key player in the financial technology and services sector.<\/p>\n<p>As part of the agreement, Saxo Australia will continue to rely on Saxo Bank’s renowned platform and trading technology, ensuring business continuity and minimal disruption for existing clients. The transaction is expected to close in the second half of 2025.<\/p>\n<p>Following regulatory approvals, DMA will assume an 80.1% ownership stake in Saxo Australia, with Saxo Bank retaining a 19.9% equity interest. This sale comes after Saxo Bank’s announcement in June 2024 regarding a review of strategic opportunities in the Asia Pacific region, aimed at accelerating growth and enhancing regional presence.<\/p>\n<p>The business will retain its current name during a transitional period, with plans to establish a new brand identity post-acquisition. Saxo Australia’s dedicated staff, led by CEO Adam Smith, will continue to serve clients while strengthening the firm’s local customer support and service capabilities.<\/p>\n<p>Smith says Saxo will ensure a smooth transition and aim to enhance the offerings and services provided. “The clients of Saxo Australia will notice no disruption in service, product range, or platform access. We are very pleased to partner up with DMA and believe that this will be a game changer for Australian clients,” he adds.<\/p>\n<p>The partnership will combine Saxo Australia’s extensive investment product range and high-touch brokerage services with DMA’s cutting-edge business-to-business expertise, global advisor network, and growth-focused strategy.<\/p>\n<p>Once fully integrated, DMA’s proprietary Software-as-a-Service (SaaS) platform will empower Australian institutional investors—such as financial advisers, asset managers, and fund managers—to streamline front, middle, and back-office operations. The SaaS solution will cover everything from clearing and settlement to execution and custody, offering a comprehensive, integrated approach to asset management.<\/p>\n<p>Richard North, CEO of DMA, believes the platform’s capabilities will bring significant value to Australian financial advisers and wealth managers. “This partnership combines the best of both Saxo and DMA, offering Australian investors a comprehensive solution for their entire investment lifecycle,” North says.<\/p>\n<p>DMA, headquartered in Johannesburg, South Africa, is a global leader in technology and financial services. The company manages and administers over €15 billion ($24.67 billion) in assets through its integrated SaaS platform. More than 160 wealth managers and adviser networks across Africa, Europe, and the UK currently rely on DMA’s platform to access global markets, simplifying their operations and reducing costs.<\/p>\n<p>DMA Chief Executive Officer Richard North believes DMA’s platform offering will bring tangible benefits to Australian financial advisers and wealth managers, while the business will continue to focus on delivering high-touch, high-quality service for self-directed retail clients. “It’ll be the best of Saxo and the best of DMA and we think that adds up to the marketplace’s best choice for investors across the entire lifecycle,” says North.<\/p>\n<p>DMA’s SaaS platform is designed to streamline asset management processes, enabling institutional investors to focus on wealth growth while reducing operational costs. Saxo Bank has operated in Australia since 2012 and is a licensed subsidiary regulated by ASIC, offering robust multi-asset trading capabilities and award-winning platforms to clients across the region.<\/p>\n<p>This acquisition sets the stage for a new chapter in the Australian financial services market, combining the best of technology and client service to deliver unparalleled value to investors.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>DMA, a leading global provider of all-in-one software solutions for financial advisers and wealth managers, has announced an agreement to acquire a majority stake in Saxo Australia, a prominent multi-asset investing specialist. This acquisition marks DMA’s strategic expansion into the Australian market, reinforcing its position as a key player in the financial technology and services [&#8230;]<\/p>\n<p>The post <a href=\"https:\/\/financialcommission.org\/2025\/02\/11\/dma-to-acquire-majority-stake-in-saxo-australia-strategic-expansion-into-the-australian-market\/\">DMA to Acquire Majority Stake in Saxo Australia: Strategic Expansion into the Australian Market<\/a> appeared first on <a href=\"https:\/\/financialcommission.org\">Home<\/a>.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":10,"featured_media":155460,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[],"class_list":["post-155457","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155457","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=155457"}],"version-history":[{"count":1,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155457\/revisions"}],"predecessor-version":[{"id":155459,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155457\/revisions\/155459"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/155460"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=155457"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=155457"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=155457"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}