{"id":155465,"date":"2025-01-30T18:15:44","date_gmt":"2025-01-30T18:15:44","guid":{"rendered":"https:\/\/financialcommission.org\/trade-republic-expands-into-italy-and-addresses-the-pension-gap\/"},"modified":"2025-04-14T22:57:18","modified_gmt":"2025-04-14T22:57:18","slug":"trade-republic-expands-into-italy-and-addresses-the-pension-gap","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2025\/01\/30\/trade-republic-expands-into-italy-and-addresses-the-pension-gap\/","title":{"rendered":"Trade Republic Expands into Italy and Addresses the Pension Gap","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<div><img decoding=\"async\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2025\/04\/trade-republic-expands-into-italy-and-addresses-the-pension-gap.jpg\" class=\"ff-og-image-inserted\"><\/div>\n<p><span class=\"post-date\">January 30, 2025<\/span><\/p>\n<p>Trade Republic, a leading digital bank and broker, has further expanded its European presence by launching a free current account and local IBAN in Italy. The company now offers automated tax deduction through the Regime Amministrato, directly competing with local banks. This follows its recent expansion into France, enhancing its services across Europe.<\/p>\n<p>With over 8 million customers and €100 billion in assets under management, Trade Republic continues to innovate in the fiat-to-crypto space. Its offerings include a free current account, 1% Saveback on card payments reinvested into savings plans, 3% annual interest on balances, and free savings plans for customers.<\/p>\n<p>Christian Hecker, co-founder of Trade Republic, said: “Millions of Europeans have realized that their governments lack solutions for one of the most critical challenges of our time. The pension gap is a predictable and measurable problem that continues to be overlooked in political discussions. With our full banking license, national branches, and proprietary infrastructure, we are committed to develop localized and cost-effective savings products to empower people to take control of their financial future.”<\/p>\n<p>Julian Collin, general manager international markets at Trade Republic, said: “The pension gap is a European problem. However, the solutions for our customers must be tailored to local needs. Our mission is to offer every European the best possible tools for long-term saving. Following France, Italy is the second major European market this year where we’ve localized our product. This is another step forward in driving European growth and increasing competition within the traditional banking sector.”<\/p>\n<p>Trade Republic, which doubled its customer base to 8 million and saw assets grow to €100 billion, continues to expand its influence across European markets. The company has made substantial investments in its infrastructure, achieving significant growth while maintaining a profitable year despite passing on full ECB interest rates to customers.<\/p>\n<p>Looking ahead to 2025, Trade Republic plans to further accelerate international growth by establishing local bank branches across Europe, offering localized banking services and savings products. For example, over 1 million French customers now benefit from commission-free savings plans and 3% interest on their balances with a national IBAN.<\/p>\n<p>Trade Republic’s innovations, such as the Visa card offering 1% Saveback rewards, highlight its commitment to making financial tools accessible. The Trade Republic card, with no monthly fees and free worldwide ATM withdrawals, offers users competitive benefits alongside high interest on savings.<\/p>\n<p>Having secured a full banking <a href=\"https:\/\/financefeeds.com\/trade-republic-bafin-regulated-broker-turns-into-full-blown-bank\/\" target=\"_blank\" rel=\"noopener\">license from the European Central Bank (ECB) in late 2023<\/a>, Trade Republic has expanded its product offerings, including bond trading and fractional investing, while also passing 4% interest to its customers.<\/p>\n<p>The company’s expansion into banking services, including deposit and lending services, positions Trade Republic as a comprehensive financial institution, providing a wide array of services to customers across Europe.<\/p>\n<p>As a fully-regulated bank supervised by BaFin, Trade Republic is reshaping the financial landscape by offering commission-free access to capital markets, including ETFs, bonds, derivatives, and crypto, and creating new ways to save through ETF savings plans.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Trade Republic, a leading digital bank and broker, has further expanded its European presence by launching a free current account and local IBAN in Italy. The company now offers automated tax deduction through the Regime Amministrato, directly competing with local banks. This follows its recent expansion into France, enhancing its services across Europe. With over [&#8230;]<\/p>\n<p>The post <a href=\"https:\/\/financialcommission.org\/2025\/01\/30\/trade-republic-expands-into-italy-and-addresses-the-pension-gap\/\">Trade Republic Expands into Italy and Addresses the Pension Gap<\/a> appeared first on <a href=\"https:\/\/financialcommission.org\">Home<\/a>.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":10,"featured_media":155468,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7243],"tags":[],"class_list":["post-155465","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-news"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155465","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=155465"}],"version-history":[{"count":1,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155465\/revisions"}],"predecessor-version":[{"id":155467,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/155465\/revisions\/155467"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/155468"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=155465"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=155465"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=155465"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}