{"id":65073,"date":"2018-02-06T14:26:14","date_gmt":"2018-02-06T14:26:14","guid":{"rendered":"https:\/\/financialcommission.org\/?p=65073"},"modified":"2018-02-20T15:23:21","modified_gmt":"2018-02-20T15:23:21","slug":"not-get-fooled-trading-bonuses","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/02\/06\/not-get-fooled-trading-bonuses\/","title":{"rendered":"Do not get Fooled by Trading Bonuses","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\"><strong><a href=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/02\/forex_trading_bonuses.jpg\"><img fetchpriority=\"high\" decoding=\"async\" class=\"alignnone size-large wp-image-65074\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/02\/forex_trading_bonuses-1024x511.jpg\" alt=\"\" width=\"1024\" height=\"511\" \/><\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">While bonuses and incentives offered by brokers have become a common practice, we bring your attention to the fact that not all bonus programs are created equal. Trading bonuses can be difficult to understand for a new trader or even experienced trader and we advise customers to review any bonus program or promotion before entering into one.<\/p>\n<p style=\"text-align: justify;\">Each bonus program offered by a particular broker should have terms and conditions that clearly indicate the way the bonus or incentive structure will work. Given our industry experience, below we present some important things to look for when choosing a bonus program from a broker.<\/p>\n<p style=\"text-align: justify;\"><strong>Review the Terms and Conditions<\/strong><\/p>\n<p style=\"text-align: justify;\">The most important thing that a trader must do when deciding to participate in a bonus program is to evaluate the terms and conditions of the offer. Only then can a trader make an informed decision on whether the bonus structure and amount is suitable for him.<\/p>\n<p style=\"text-align: justify;\">The terms of the offer should present to the trader the scenarios in which a bonus will be granted and in what way the bonus will be given to the customer. This may include a cash deposit into the customers trading account, a reduced spread to trade on or a physical gift that can be mailed to the customer.<\/p>\n<p style=\"text-align: justify;\">Keep in mind that the scenario should give a clear example of how the bonus can be achieved. Make sure to check the start and end date of a bonus promotion to make sure that you can participate or complete any trade requirements in the allotted time. Likewise, if the promotion includes a trading requirement, you should evaluate your costs of achieving that trade requirement with your trading goals. It may turn out that your trading costs, including spread paid ultimately is higher than the bonus amount you earned.<\/p>\n<p style=\"text-align: justify;\"><strong>Amount of bonus offered<\/strong><\/p>\n<p style=\"text-align: justify;\">We often see brokers offering very large bonuses to customers either as a cash value or as a percentage of their deposit. Often times, the bonus is structured around the customer’s first time deposit with the broker. In such cases, we advise clients to evaluate the terms and conditions before making a decision to enter the program.<\/p>\n<p style=\"text-align: justify;\">Often times, high bonus amounts are not eligible for withdrawal by the customer. In such cases, you can receive the bonus on your account, but you can only use these funds for trading and cannot return them to your bank or card account. Again, the terms and conditions should always give you a description of how the bonus can be used.<\/p>\n<p style=\"text-align: justify;\">In certain instances, high bonus amounts, especially those that are up to 100% of a customer’s deposit will have restrictions that do not permit the customer to withdraw any funds from their account until a certain amount of trading volume is conducted. In such cases, the trading volume requirement is significantly high. Traders using such bonus programs often find that they either do not have enough funds (including the bonus) to complete the trading requirement or incur losses during trading towards fulfilling the requirement and are forced to deposit new funds into their account. These types of aggressive bonus offers are likely to be detrimental to the customer, rather than a benefit.<\/p>\n<p style=\"text-align: justify;\">Also keep in mind that a large bonus deposited to your account will likely increase the amount of funds you have to trade, especially if you are trading with leverage. In this case, while you have more funds to trade with and can open bigger market positions, you must always be aware of the risks of leverage trading. If you open a big position, you must maintain a margin requirement on this position. It is likely that a market move against your position will cause your position to be liquidated quicker than had you have a smaller position and employed proper risk\/reward strategy.<\/p>\n<p style=\"text-align: justify;\">A similar, but more risky bonus promotion can contain an increase in “buying power”. These types of offers will allow the bonus amount to be deposited into your account only to increase the maximum position size that you can open by increasing your account balance, but when calculating the margin requirement for a position, this bonus amount will not be counted. As such, you can open a larger position, but you cannot withstand a larger loss in your account before a margin call. Trading with this type of bonus significantly increases the risk of losses for customers.<\/p>\n<p style=\"text-align: justify;\"><strong>Calculating a bonus<\/strong><\/p>\n<p style=\"text-align: justify;\">The broker’s bonus promotion should also provide you with a simple way to calculate what your bonus amount is or will be in the future. More often these days bonuses are offered as a percentage of your initial deposit. In such cases, you should keep in mind that the bonus calculation will only include new funds that you have deposited and not those that you may have transferred from an existing trading account at your broker or an account at another broker. Likewise, some bonus programs will not count any subsequent deposit you have made towards a bonus calculation.<\/p>\n<p style=\"text-align: justify;\">Some bonus programs also have a tiered structure, meaning that the amount you will receive in bonus increases as you deposit more funds or conduct more trades. We advise you to be careful when evaluating such programs and keep in mind your financial and trading strategy. You should be aware of how much money you can afford to invest in trading and how many trades you are willing to conduct based on your risk profile. As we mentioned above, sometimes the costs associated with completing the required number of trades is higher than the actual bonus amount you receive.<\/p>\n<p style=\"text-align: justify;\"><strong>Where to get help<\/strong><\/p>\n<p style=\"text-align: justify;\">We advise you to carefully evaluate a bonus program based on your trading goals. If you have any questions about a bonus program, you should contact your broker directly before making a decision to enter into the program.<\/p>\n<p style=\"text-align: justify;\">You can also <a href=\"mailto:info@financialcommission.org\">contact the Financial Commission<\/a> with questions as we offer assistance to traders free of charge.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>While bonuses and incentives offered by brokers have become a common practice, we bring your attention to the fact that not all bonus programs are created equal. Trading bonuses can be difficult to understand for a new trader or even experienced trader and we advise customers to review any bonus program or promotion before entering [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":65074,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[14,6394],"tags":[],"class_list":["post-65073","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-commission-news","category-tips-for-all"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/65073","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=65073"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/65073\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/65074"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=65073"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=65073"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=65073"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}