{"id":67349,"date":"2016-02-05T00:00:00","date_gmt":"2016-02-05T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/02\/05\/financial-commission-2015-annual-report-2\/"},"modified":"2016-02-05T00:00:00","modified_gmt":"2016-02-05T00:00:00","slug":"financial-commission-2015-annual-report-2","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/02\/05\/financial-commission-2015-annual-report-2\/","title":{"rendered":"Financial Commission 2015 Annual Report","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p dir=\"ltr\"><strong>2015 Membership Growth, New Appointments, Key Events and Industry Observations<\/strong><\/p>\n<p dir=\"ltr\"><strong>February 4 2016:<\/strong> New York &amp; Hong Kong: FinaCom PLC, operator of the Financial Commission (<a href=\"http:\/\/xcv.financialcommission.org\/\">FinancialCommission.org<\/a>) &#8211; the first independent neutral mediator for multi-asset brokers offering Forex, CFD’s, Binary Options and Cryptocurrency, announces today its Annual Report for 2015.<\/p>\n<p dir=\"ltr\">Presented here below, Financial Commission’s 2015 annual report highlights another outstanding year which further solidified the need for increased self-regulatory efforts, such as the benefits provided by the Financial Commission to its members &#8211; who join and maintain membership voluntarily while adhering to strict guidelines.<\/p>\n<p dir=\"ltr\"><strong>About the Financial Commission<\/strong><\/p>\n<table border=\"0\">\n<tbody>\n<tr>\n<td><a href=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg\"><img decoding=\"async\" alt=\"FullSizeRender\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg\" width=\"116\" height=\"100\" \/><\/a><\/td>\n<td style=\"padding-left: 30px;\">The Financial Commission provides an unparalleled dispute resolution process between online brokerages and their end-customers and encompassing a wide range of complaints-processing related to product, market and pricing related issues brought by financial market participants. The Commission guarantees protection of the interests of both brokers and traders, thus providing a fair and neutral platform to effectively resolve complaints.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h3>Key Milestones in 2015: Growth Channels<\/h3>\n<p dir=\"ltr\">2015 saw growth across many of Financial Commission&#8217;s key business drivers including the number of important news that was reported on the website of the Financial Commission during the year that aided the organization&#8217;s developments.<\/p>\n<p dir=\"ltr\">New appointments to the Dispute Resolution Committee (DRC) were made during 2015, and three new members of the Commission were approved, bringing the current total number to fifteen members. In addition, Financial Commission participated in key industry events across the globe, meeting with clients and members at important industry conferences.<\/p>\n<p dir=\"ltr\">Below the Commission presents its Annual Report for 2015, which also provides statistics on the number of complaints handled and key metrics regarding processing and mediation results.<\/p>\n<p dir=\"ltr\">The statistics information is insightful to our Members, their clients and the public, and for brokerages that are considering the benefits of obtaining membership with the Financial Commission, and interested in learning about the organization&#8217;s structure.<\/p>\n<h3 dir=\"ltr\">Complaint Statistics for 2015 in Review<\/h3>\n<p dir=\"ltr\">The need for transparency continues to grow. Building trust is more important than ever, and a using fair and neutral 3rd party dispute resolution &#8211; that Financial Commission provides &#8211; is an effective solution in cases where clients or brokers cannot resolve matters together and seek an independent channel, and wish to avoid often complex legal or costly arbitration alternatives. The Financial Commission continues to achieve this objective &#8211; by providing brokerages and technology firms with the benefits that accompany membership status &#8211; and as seen in the statistics reviewed for 2015.<\/p>\n<p dir=\"ltr\">60% higher Year-over-Year (YOY), a significant increase in the total number of complaints received in 2015, 18% YOY increase in the proportion of complaints that escalated to the Arbitration Committee. The increase was mainly fueled by the addition of new members, when compared to the prior year.<\/p>\n<p dir=\"ltr\">The monetary amounts of complaints filed during 2015 ranged between $27 to $40482, from a total of 93 complaints filed.<\/p>\n<p dir=\"ltr\">From the total number of complaints, 82 were Forex related, and the remaining 11 were related to Binary Options trading.<\/p>\n<p dir=\"ltr\">73 complaints were successfully resolved through the Financial Commission Dispute Resolution Process, and 1 still remain in progress (as of this writing), and 15 complaints lacked sufficient information to further proceed. Overall, from the number of complaints that met the information requirements to proceed nearly all have been successfully processed with one case still in progress and pending resolution.<\/p>\n<p><strong>General complaints Statistics:<\/strong><\/p>\n<ul>\n<li>Complaints filed against Members 64<\/li>\n<li>Complaints filed against non-Members 29<\/li>\n<li>Maximum complaint amount $ 40482<\/li>\n<li>Minimum complaint amount $ 27<\/li>\n<li>Not Enough Information 15<\/li>\n<li>Still In Progress 1<\/li>\n<\/ul>\n<p>Summing up 2015, several important points and trends are noted in the activity of the Financial Commission below:<\/p>\n<p><b id=\"docs-internal-guid-e5af0475-c9e9-e9b8-73a5-ad7596eee484\">Complaints Related to Stop-Out Liquidations<\/b><\/p>\n<p dir=\"ltr\">Just as in 2014 a significant portion of complaints (about 25%) were related to the problem of forced liquidation of clients’ positions by brokers in view of margin deficit (also known as “stop-out”).<\/p>\n<p dir=\"ltr\">Traders often do not pay enough attention to the risk management and consequently get a stop-out from the combined leverage and\/or market volatility that can turn even a small position into a huge loss forcing a liquidative margin call or stop-out to occur.<\/p>\n<p dir=\"ltr\">This can either happen quickly on large positions &#8211; even with stop-loss orders attached &#8211; or over a long period of time (or sooner) when a stop-loss order is not attached to a trade.  The main risk factors that are overlooked by traders with lack of experience are:<\/p>\n<ul>\n<li>The use of excessive leverage;<\/li>\n<li>The high level of Stop Out set by the broker on certain types of accounts;<\/li>\n<li>Wide spreads on financial instruments in the portfolio of the trader;<\/li>\n<li>Trading in periods of high market volatility.<\/li>\n<li>Lack of stop-loss orders attached to trades (i.e. naked positions) combined with leaving a high percentage of usable margin available<\/li>\n<\/ul>\n<p dir=\"ltr\">It’s important to note how while the mechanism of Stop Out (i.e. margin-call or liquidation-call)  may vary by broker, the main proponents are to protect the brokers trading capital and the client’s capital from adverse price fluctuations.<\/p>\n<p dir=\"ltr\"><b id=\"docs-internal-guid-b2183c3d-c9ef-431d-a36d-5a5925d1fd15\">Background on Stop-Out Liquidations:<\/b><\/p>\n<p dir=\"ltr\">The liquidation of trades that occur when a stop-out (i.e. margin call or liquidation call)  is triggered attempts to act as a sort of insurance in the form of a financial airbag or safety net that is used by the parties of transactions in situations that could otherwise cause a deficit balance or more substantial loss.<\/p>\n<p dir=\"ltr\">Quite often the situation is such that if the broker does not forcibly close the loss-making positions of the client, the client’s losses will exceed the amount of the available margin (or cash deposit) in their account, and consequently, the broker will have to cover this difference at their own expense or based on the customer agreement if enforceable.<\/p>\n<p dir=\"ltr\">The most common reason for closing positions by Stop Out or Liquidation Call is that during the period of increased market volatility the amount of spread on financial instruments is expanding as well as the price itself moving rapidly.<\/p>\n<p dir=\"ltr\">As a consequence, having an opened position or several opened positions, can add to the amount of floating loss (or Marked-to-Market) into the unrealized Profit and Loss (P&amp;L) total, while the amount of floating income &#8211; if any &#8211; is falling or offset by a larger degree.<\/p>\n<p dir=\"ltr\">The consequence or cause of this phenomenon is mainly lack of margin &#8211; as the available margin is eaten up by the floating losses thus creating the stop-out scenario, without which could not prevent to attempt to stop a negative balance from occurring.<\/p>\n<p dir=\"ltr\">Thus, when the ratio of Equity\/Margin (cash equity including floating P&amp;L relative to margin collateral used for opened positions) falls below the critical stop-out level (triggering a liquidation) defined by the broker, then the closure (stop-out) of unprofitable positions of the client occurs, or in some cases all positions may be closed during the stop-out event (depending on the broker\/customer agreement) and stop-out\/margin-call policy (and level or percentage).<\/p>\n<p><b id=\"docs-internal-guid-d8cb1483-c9f9-5df0-a400-cdb8283ef786\">News-Driven Increased Market Volatility<\/b><\/p>\n<p dir=\"ltr\">The publication of important economic and political news continues to attract many novice traders who are trying to earn large sums in short periods of time, based on the sharp fluctuations in price. However, it is necessary to understand that in such market conditions slips and expansion of the spread often occurs, among other risks during new events.<\/p>\n<p>These events have been the main cause of market volatility contributing to the Stop Out or Liquidation calls examined by the Financial Commission’s 2015 complaint findings.<\/p>\n<p>One of the complaints received recently by the Financial Commission deserves special attention, although it belongs to the type of complaints described above.<\/p>\n<p>The situation faced by the client is extraordinary in the sense that Stop Out was made due to the specific queue of pending orders caught in a price gap. In this particular case several client’s pending orders of different volumes got caught in the price gap generated immediately after the publication of Non-Farm Employment report in the US. As a result, all pending orders were activated on the broker’s server simultaneously. However, the first order executed was the maximum volume order, but not the order that was the first in terms of the order price. Consequently, the margin deficit appeared on the client’s account, resulting in Stop Out. For instance, on the interbank market in the situation similar to the above-mentioned &#8211; it is more likely that the larger volume order would be executed first as it corresponds with the logic of the market. The technology of execution of orders\/transactions is structured in a way where orders\/transactions of a larger volume are executed first and only afterwards the smaller volume orders\/transactions could be executed at prices that remained.<\/p>\n<p>The Financial Commission notes that, in 2015 one of the problems that traders continue to face is the delay in payments of earned income and the remaining trading capital by dishonest brokers. It is important to say that none of these complaints were brought against member-brokers of the Financial Commission.<\/p>\n<p><b id=\"docs-internal-guid-614c1bc7-c9fb-fc2a-3b38-1dac58010074\">Broker Deposit Bonus Promotion Disputes:<\/b><\/p>\n<p dir=\"ltr\">Apart from the cases mentioned above, the Financial Commission received complaints on the brokers&#8217; rejections to pay rewards citing violation of regulations set in some bonus programs offered. It should be noted that in some cases the terms and conditions were insufficient.<\/p>\n<p dir=\"ltr\">The Financial Commission strongly recommends that the brokers should describe such regulations or terms and conditions very carefully to clients, and also use various examples of trading requirement calculations (for bonus redemption) for a clearer perception of the information by the clients. This will help to avoid misinterpretation of data and reduce the number of disputes as well as the reputational risks for companies, or any stigma left on the bonus promotions industry-wide.<\/p>\n<p dir=\"ltr\">At the same time the Financial Commission strongly recommends that the clients should carefully study the conditions offered by brokers’ bonus programs and ask clarifying questions via e-mail or other recorded transcripts. If the communication with the company’s representatives is carried out via online chat, the client has to be sure that he keeps a log of the discussion for reference. This will help to protect clients’ interests if a dispute arises, and lessen the need for a complaint.<\/p>\n<p dir=\"ltr\">Special attention has to be paid to the bonus programs which restrict client’s access to their own funds. Typically, these promotion programs offer incredibly high bonuses (up to 100% of the deposit amount) and signing of a separate contract with the broker, and require clients to perform certain actions. Financial Commission found that in most cases the requirements put forward by the brokers were extremely high and led to a situations where the client had to make a large number of transactions (pay high commissions) and\/or meet specific total trading volume thresholds, before getting access to their funds.<\/p>\n<p dir=\"ltr\">In other words, the client guarantees to pay commission to the broker, thus putting himself in a vulnerable position where the high-trading requirements add further pressure and increased risk. The Financial Commission does not encourage such programs and calls on clients to study the proposed conditions very carefully and decide whether the requirements warrant the effort and based on their experience and skill level. Ask your broker to show you the size of the required fees and required trading volume in US dollars, and also specify whether the bonus funds cover possible losses from trading operations.<\/p>\n<h3>Participation in Forex Industry Conferences in 2015<\/h3>\n<div dir=\"ltr\">\n<table>\n<colgroup>\n<col width=\"188\" \/>\n<col width=\"436\" \/><\/colgroup>\n<tbody>\n<tr>\n<td>\n<p dir=\"ltr\"><img decoding=\"async\" alt=\"11343018135_911aa4da41_o.jpg\" src=\"https:\/\/lh5.googleusercontent.com\/E90uQAg21It6fjrAcpRixWjmJ0Pypjoz8QipZGvZfUEdrJ_puIFKyth6ua9NBHpTwNSJjPQMb5qkTMKb4CJ2CSEdbIjeEWEcgodKgyO-kBwBWZzhDZgGjiND8KilK6Ov5VngTfmw\" width=\"141\" height=\"95\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">In June, the Financial Commission participated in international forex conference FXIC in New York. On the agenda of the conference was innovations in trading technologies, development of international forex regulations as well as the development of cryptocurrency as a modern financial instrument.<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td>\n<p dir=\"ltr\"><img decoding=\"async\" alt=\"Micex.jpg\" src=\"https:\/\/lh3.googleusercontent.com\/VTq59XgnWNQZ8E6NH4WN9d3WoSYS7b1x-fWm27hGtTU9D-y8VdbkFZlMaJuDbwCLPCelhKw9-nx1mlfgdC2zCVn7U8MiiJfX26K8nZ_aMButnUSB2zKlFQ1K8zLoePWsNAdDfFEK\" width=\"145\" height=\"97\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">In October, the Financial Commission visited the MICEX forum in New York. The forum highlighted the success of modernization of Russian market infrastructure, problems of corporate governance that Russia continue to face and growth of domestic investors base.<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td>\n<p dir=\"ltr\"><img loading=\"lazy\" decoding=\"async\" alt=\"11010582_1090326980992087_5620565652811211866_n.jpg\" src=\"https:\/\/lh4.googleusercontent.com\/ZlJuztPuwaFBA8HT7kiGS9u9NkrcHGm9ftIgfWOFs8pq_2Zv3HrPGmQPWOB0Ib3tmDtsYJW3r3tkcjK0OR-qOMkCyZ-Qwbsjkil9SNNkRsWatmZPMfCzcyfRDDWCPDR-YdJW0idn\" width=\"142\" height=\"112\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">In November, the Financial Commission participated in Forex Magnates London event which was visited by over 1000 professionals from the online brokerage industry.  Broker-Members of the Financial Commission were able to meet with the organization’s representatives, including DRC members who were present and had visited the Commission’s dedicated exhibitor booth, including firms that cater to traders in forex, CFD, Binary options and Cryptocurrency markets.<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<p>&nbsp;<\/p>\n<h3 dir=\"ltr\">Key Appointments<\/h3>\n<div dir=\"ltr\">\n<table>\n<colgroup>\n<col width=\"140\" \/>\n<col width=\"484\" \/><\/colgroup>\n<tbody>\n<tr>\n<td>\n<p dir=\"ltr\" style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"\" src=\"https:\/\/lh5.googleusercontent.com\/K4E2h0itwOXmIGmknIuaWCxGqM79jB3l1-aEy97c_YlDtVRB3-mpvsaazjA_d9oCopxr7V0jsSSStrTosmvWjDKgRgoyz39yoto2XkbYHP8mE2RmY_rUDXkSRRX-QPEy0sOEUVLI\" width=\"75\" height=\"112\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">August: Maor Lahav – COO and co-founder of Panda Trading Systems in Haifa, Israel, has joined the Dispute Resolution Committee (DRC) of the Financial Commission.<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td>\n<p dir=\"ltr\" style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"\" src=\"https:\/\/lh5.googleusercontent.com\/IZXbh0hCLmORhS6SnnoW14M_P5a5qodhJfX12COMCRsKdt-PXdG33bkyFurq7-05tvxL_5sPJzL5-KuNY4HvRkN_dhhHz4b-7Sx0EkcYjjRR_qYpadU3WMe4T0YXiWYHjybnKJK4\" width=\"92\" height=\"92\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">October: Financial Commission Chairman Peter Tatarnikov joins CRFIN advisory board. In August of the same year, the Financial Commission and CRFIN announced a partnership.<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td>\n<p dir=\"ltr\" style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"\" src=\"https:\/\/lh6.googleusercontent.com\/sVpiSAu-HKru5XGcjNYscDEubMxMuuwXgBBEalTPo9n5b9CAv--MPOmeB933ge3TZ3rjIHGCWaBfQTxgwipox5ouee1vBYzs30u-VPV2_QTjQbDWRPaZyNXKHv0aNMWnHoarHYMA\" width=\"92\" height=\"92\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">December: Kristina Nettles, Vice President of Integral Development Corp, Palo Alto, CA United States, has joined the Dispute Resolution Committee (DRC).<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<h3 dir=\"ltr\">New Member Announcements during 2015<\/h3>\n<div dir=\"ltr\">\n<table>\n<colgroup>\n<col width=\"176\" \/>\n<col width=\"448\" \/><\/colgroup>\n<tbody>\n<tr>\n<td>\n<p dir=\"ltr\" style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"\" src=\"https:\/\/lh6.googleusercontent.com\/kK2-FdSyABqqBNsbLtwbroVG9t3DbPXU-k_EGj6jiae46IrT5oFTuG4O4lwmwxTffH0kALQws4ArRfYPR6sBSJSQrJqMvtRx7CAp_pfEZNi-D8MyqeLo8lVrqfi_oclebQ311rS_\" width=\"74\" height=\"16\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">December: NPBFX is an international forex broker registered in Belize and regulated by International Financial Services Commission has joined the Financial Commission.<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td>\n<p dir=\"ltr\" style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"\" src=\"https:\/\/lh4.googleusercontent.com\/tPHDB9oBxGcNqFJ7E59GkFfz8YFygLugSN78CNjI9wy7_etrunjbu_hQfmvGK6XX84IgJnN4mL0WDtQGu7_7-eFEpRR--90LQZHQ2csRLeqFPGHDweQFJyMT7gQAjz2EmzGpMW1X\" width=\"94\" height=\"37\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">December: ЕQMarkets (Infinity Trade LTD) registered office is located in Saint Vincent and the Grenadines, has joined the Financial Commission.<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td>\n<p dir=\"ltr\" style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"\" src=\"https:\/\/lh6.googleusercontent.com\/JRd6SIkUU9ORt2wvw4v8HTqpO6aTxNI37GxpD_XBfjAO3cj0fFcRmrk3vxYoWgk__xjbGd5vj3f8NNwfLibmvW-qXHHm7DYtqAwQDuRw_Aco_B3hIniIDrm6jy_nyGPlToxd-XcZ\" width=\"77\" height=\"31\" \/><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\">November: AITS FX is the new global brand in forex industry, which is located in Saint Vincent and the Grenadines, has joined the Financial Commission.<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<h4><\/h4>\n<h3>Current Members of the Financial Commission<\/h3>\n<div dir=\"ltr\">\n<table>\n<colgroup>\n<col width=\"*\" \/>\n<col width=\"*\" \/>\n<col width=\"*\" \/>\n<col width=\"*\" \/>\n<col width=\"*\" \/><\/colgroup>\n<tbody>\n<tr>\n<td><a href=\"http:\/\/www.alpari.ru\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"Alpari_Logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/Alpari_Logo.png\" width=\"97\" height=\"72\" \/><\/a><\/td>\n<td><a href=\"http:\/\/www.amarkets.org\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"logo amarkets\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2015\/04\/logo-amarkets-e1428954297456.png\" width=\"77\" height=\"46\" \/><\/a><\/td>\n<td><a href=\"https:\/\/www.fxclub.org\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"logo-forex-club\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/logo-forex-club.jpg\" width=\"93\" height=\"62\" \/><\/a><\/td>\n<td>\n<p dir=\"ltr\"><a href=\"https:\/\/www.fxopen.ru\/ru\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"FxOpen-Logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/FxOpen-Logo.png\" width=\"122\" height=\"46\" \/><\/a><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\"><a href=\"http:\/\/www.roboforex.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"Roboforex_logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2014\/01\/Roboforex_logo-300x85.png\" width=\"128\" height=\"37\" \/><\/a><\/p>\n<\/td>\n<\/tr>\n<tr>\n<td>\n<p dir=\"ltr\"><a href=\"http:\/\/www.eqtrades.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" alt=\"logo_eq_white\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2016\/01\/logo_eq_white.png\" width=\"113\" height=\"38\" \/><\/a><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\"><a href=\"http:\/\/www.hdforex.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"HDFX\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/HDFX.png\" width=\"117\" height=\"58\" \/><\/a><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\"><a href=\"https:\/\/grandcapital.ru\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"grandcapitallogo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/grandcapitallogo.png\" width=\"89\" height=\"34\" \/><\/a><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\"><a href=\"http:\/\/eqmarkets.com\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"eq\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/eq-300x116.jpg\" width=\"117\" height=\"45\" \/><\/a><\/p>\n<\/td>\n<td>\n<p dir=\"ltr\"><a href=\"http:\/\/www.mtrading.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"Roboforex_logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/Mtrading_Horizontal_logo.png\" width=\"112\" height=\"32\" \/><\/a><\/p>\n<\/td>\n<\/tr>\n<tr>\n<td><a href=\"http:\/\/binarystation.com\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" alt=\"Binarystation_logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2014\/07\/Binarystation_logo1-.png\" width=\"126\" height=\"36\" \/><\/a><\/td>\n<td style=\"padding-left: 30px;\"><a href=\"http:\/\/www.ibinex.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"Ibinex_Logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2014\/07\/Ibinex_Logo-e1418328850508.jpg\" width=\"70\" height=\"20\" \/><\/a><\/td>\n<td><a href=\"http:\/\/www.aitsfx.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"AITS-FX-126x50png\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2015\/11\/AITS-FX-126x50png.png\" width=\"57\" height=\"23\" \/><\/a><\/td>\n<td><a href=\"http:\/\/www.npbfx.org\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"NPB_logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/NPB_logo.png\" width=\"67\" height=\"14\" \/><\/a><\/td>\n<td><a href=\"www.t4b.com\"><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" alt=\"Tools4Brokers-logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2014\/07\/Tools4Brokers-logo.png\" width=\"104\" height=\"21\" \/><\/a><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<h3>Current Members of the Dispute Resolution Committee (DRC)<\/h3>\n<ol>\n<li>Anatoly Bulanov – <em>Head of Dispute Resolution Committee <\/em><\/li>\n<li>Ilan Azbel – <i>CEO, AutoChartist<\/i><\/li>\n<li>Francesc Riverola – <i>CEO, FX Street <\/i><\/li>\n<li>Carl Elsammak – <i>CEO, <\/i><i>Kammas<\/i><i> <\/i><i>Trading<\/i><\/li>\n<li>Ilya Sorokin – <i>CEO, ACT Forex <\/i><\/li>\n<li>Simon Grunfeld<em>  <em>–<\/em> Founder, Gallant Partners<\/em><\/li>\n<li>Andrew Ralich – <i>Co-Founder, oneZero Financial<\/i><\/li>\n<li>Lior Nabat <em>–<\/em> <em>CEO, Tradency<\/em><\/li>\n<li>Aleksey Kutsenko – <em>CEO, Tools4Brokers<\/em><\/li>\n<li>Maor Lahav – <em>COO\/co-founder, Panda Trading Systems<\/em><\/li>\n<li>Juan Pablo Jutgla – <i>CEO, Better Way FX Consulting<\/i><\/li>\n<li>Akin Abbak – <i>Managing Partner,  Abbak Attorneys at Law <\/i><\/li>\n<li>Kristina Nettles – <em>Vice President, Integral<\/em><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h3><b id=\"docs-internal-guid-c96151aa-ca18-0586-7e80-2dfed5b45a87\">2016 Outlook: Expansion, Volatility, and Client Education<\/b><\/h3>\n<p dir=\"ltr\">With 2016 already underway, the Financial Commission had just returned at the end of January after successfully participating as an exhibitor at the iFX Expo in Hong Kong.<\/p>\n<p>The event marked expansion in Asia for the Financial Commission as new agreements were reached with providers in the region, and as the online brokerage industry sees strong demand in Asia. The growth noted both at the event and in the media &#8211; included from China and ASEAN countries, and as a large percentage of the world population circles within a dense area of East Asia where brokers eye to acquire new and existing market-share. The iFX expo event took place within the major financial hub that Hong Kong is, and at the modern Hong Kong Exhibition Centre in the city’s financial district.<\/p>\n<p>In addition to future participation in key industry events during 2016, Financial Commission expects to see continued interest from brokers both in Asia, Africa, and Europe, as well as from the Americas, where both technology providers and brokers aim to build trust and integrity with their clients by taking steps to improve credibility and transparency.<\/p>\n<p>Brand promise steps revolve around product offerings (marketing), sales efforts, customer support and retention, and include broker’s own steps from self-regulatory compliance,  obligatory regulatory mandates, and voluntary efforts &#8211; such as afforded by membership with the Financial Commission.<\/p>\n<p><b id=\"docs-internal-guid-bac8acf6-ca1a-2218-c3a7-37e1e1274f73\">Volatile Market Conditions in FX, and Global Stock Markets<\/b><\/p>\n<p dir=\"ltr\">The increased market volatility of 2015 continues to escalate into 2016 and is still accelerating and creating huge risk\/reward opportunities for market participants and as higher volatility drives trading volumes and broker revenues. While this can be an exciting opportunity for new and experienced traders, such market conditions can also provide traders &#8211; especially new entrants &#8211; with either unrealistic expectations or the exact opposite &#8211; an unexpected market move and potentially substantial losses.<\/p>\n<p dir=\"ltr\">If 2015 taught traders one thing, following the CHF anomaly, and subsequent weekend-opening volatility surrounding the GREXIT crisis, clients need to be aware of the risks of holding open positions through news events and especially over weekends or when markets are closed.<\/p>\n<p><b id=\"docs-internal-guid-465110eb-ca1b-1858-2c71-61354217cde3\">Customer Education still Key Driver of Relationship and Sales<\/b><\/p>\n<p dir=\"ltr\">Online brokerages who put their clients interests first, whether agency brokers, market-maker or both, show a firm commitment when joining the Financial Commission, as do technology providers who aim to employ best practices.<\/p>\n<p dir=\"ltr\">Client education continues to be on the forefront of brokers concerns as it’s seen as both a tool to improve sales results and conversions, while reducing the chance of complaints from misunderstandings, or scenarios where clients had misinformation about a product or service (i.e. education improves retention rates and conversion).<\/p>\n<p dir=\"ltr\">Financial Commission continues to aim to educate clients and support related initiatives, as a large number of complaints are related to such issues &#8211; compared with purely technical complaints &#8211; as an example.<\/p>\n<p dir=\"ltr\">To learn more about the benefits and requirements of joining the Financial Commission, available for brokerages and technology providers, contact us and visit <a href=\"http:\/\/xcv.financialcommission.org\">www.financialcommission.org<\/a><\/p>\n<p><b id=\"docs-internal-guid-f5403ef8-ca1b-bf8c-afdd-2783652b1066\">Closing Remarks from Financial Commission Chairman<\/b><\/p>\n<p dir=\"ltr\"><em>“We are pleased to report a successful 2015 in our annual report, and as the value that Financial Commission brings to the online brokerage industry has proven to be of great importance to companies and their clients, and as evidenced by our expanded membership growth.<\/em><\/p>\n<p dir=\"ltr\"><em>Over the last few years the Financial Commission has evolved from a core mission statement and set of standards, to provide the online trading community with a specialized and reliable alternative dispute resolution platform, and since then our fitness has strengthened to process complaints and handle membership needs and certifications more efficiently and effectively. We’ve achieved a reliable and robust organizational structure and look forward to an already promising 2016.<\/em><\/p>\n<p dir=\"ltr\"><em>We welcome brokerages and technology providers, both regulated or unregulated, and self-regulated, to join the Financial Commission and by doing so to remind your clients of your commitment to them. We will stand by both of your sides in cases where a complaint is brought, and with the aim to bring it to resolution quickly and fairly.&#8221;<\/em><\/p>\n<p dir=\"ltr\"><em>Peter Tatarnikov,<\/em><\/p>\n<p dir=\"ltr\"><em>Chairman,<\/em><\/p>\n<p dir=\"ltr\"><em>Financial Commission<\/em><\/p>\n<\/div>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>2015 Membership Growth, New Appointments, Key Events and Industry Observations February 4 2016: New York &amp; Hong Kong: FinaCom PLC, operator of the Financial Commission (FinancialCommission.org) &#8211; the first independent neutral mediator for multi-asset brokers offering Forex, CFD’s, Binary Options and Cryptocurrency, announces today its Annual Report for 2015. Presented here below, Financial Commission’s 2015 [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[],"tags":[],"class_list":["post-67349","post","type-post","status-publish","format-standard","hentry"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/67349","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=67349"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/67349\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=67349"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=67349"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=67349"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}