{"id":67429,"date":"2017-07-18T00:00:00","date_gmt":"2017-07-18T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/07\/18\/verifymytrade-porque-todo-comerciante-debe-saber\/"},"modified":"2017-07-18T00:00:00","modified_gmt":"2017-07-18T00:00:00","slug":"verifymytrade-porque-todo-comerciante-debe-saber","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/07\/18\/verifymytrade-porque-todo-comerciante-debe-saber\/","title":{"rendered":"VerifyMyTrade – Porque todo comerciante debe saber!","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Si estás haciendo comercio en el mercado de forex, probablemente estás pensando que tan bien tu corredor está ejecutando tus ordenes. Si no estás pensando esto, entonces tal vez es el momento de empezar a ser curioso. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Desafortunadamente, los corredores no proveen a sus clientes con herramientas para confirmar la ejecución de la calidad de las órdenes. Esto no necesariamente significa que los corredores están haciendo un mal desempeño, pero tampoco confirma lo contrario. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">En un mercado descentralizado como lo es forex, no hay un solo precio disponible para todos, y presupuestos del mercado pueden diferir del otro. En este asunto, el promedio de comercio no tiene la oportunidad de analizar la calidad de ejecución, excepto para analizar independientemente los precios de diferentes corredores en cada momento. Sin la tecnología correcta, este es una tarea difícil y prolongada.    <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Pero ahora ya hay dicha herramienta! Introduciendo <\/span><a href=\"http:\/\/www.verifymytrade.com\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">VerifyMyTrade<\/span><\/a><span style=\"font-weight: 400;\">, un depósito de datos independiente que provee análisis de comercio posterior de ejecución de orden por transacciones forex.   <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Como se esperaba, después del lanzamiento del servicio los desarrolladores recibieron muchas reacciones, ambas positivas y negativas. Muchos proveedores de servicios financieros acordaron que esta herramienta crea la base para un desacuerdo porque puede llevar a corredores a llegar a conclusiones inadecuadas acerca de la calidad del orden de ejecución. Con honestidad debe ser dicho que este servicio no garantiza al 100% la exactitud de evaluación de desarrollo, pero al menos provee alguna indicación general de exactitud. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Al mismo tiempo, casi a todos los que respondieron apoyaron la iniciativa porque en verdad da luz al proceso de precios en el mercado forex. Estoy totalmente de acuerdo con todos los argumentos y quiero explicar el porqué. Vamos a presentar un ejemplo de dos usuarios móviles en una ciudad. El primero paga $100 por mes y el segundo solo $80. Muchas personas pueden pensar que el primero paga de más. Sin embargo, ¿es posible hacer una evaluación comparativa sin detallar un estimado de la cantidad y duración de las llamadas, al igual que otras opciones  disponibles en el contrato? No, esto es simplemente imposible. Con este respecto el  mercado Forex no es diferente; sin entender en qué momento un comerciante concluye  tratos y en qué volúmenes, es imposible evaluar con exactitud la calidad del rendimiento. Sin embargo, todos entendemos  que en cualquier mercado siempre hay un margen de precios realistas, dentro de donde la compra de bienes y servicios no debería causar sorpresa a ningún consumidor.     <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Del ejemplo anterior le sugiero visitar <\/span><a href=\"http:\/\/www.verifymytrade.com\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">VerifyMyTrade<\/span><\/a><span style=\"font-weight: 400;\"> desde la perspectiva de lo que el servicio trata de lograr: primero para determinar si el precio recibido de su distribuidor está fuera del rango cuando se es comparado a precios recibidos de otros distribuidores. Segundo, para mostrar qué tan competitivo el precio fue en comparación con los precios de otros mercados participantes- un factor que es dependiente de muchos factores; como se muestra en el ejemplo del celular anteriormente.     <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Vamos a mirar al verdadero problema que es enfrentado por distribuidores y comerciantes todos los días. En el inmenso mayor de los casos, comerciantes solo revisan la ejecución del precio en pérdidas de cambio. Cuando hace una perdida, es la psicología humana que le dicta a uno a revisar de quien fue la culpa. ¡Estamos convencidos de que hubo un error y que la culpa fue de alguien más! <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>¿Que hace en comerciante en esta situación?<\/b><\/p>\n<table>\n<tbody>\n<tr>\n<td><img decoding=\"async\" class=\"alignleft wp-image-39074\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/07\/злой.png\" alt=\"%d0%b7%d0%bb%d0%be%d0%b9\" width=\"150\" height=\"123\" \/><\/td>\n<td>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\"> Como regla, el ve el precio de ejecución de su comercio, y después busca un distribuidor que sus precios a la hora de ejecución sean más beneficiosos para el comercio ejecutado.El problema es que dentro de la estructura del mercado descentralizado, la probabilidad de encontrar un precio más beneficioso es muy alto, y en esta base el comerciante presentó un reclamo al distribuidor.  <\/span><\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><b>¿Qué es lo que un distribuidor hace en este caso? <\/b><\/p>\n<table>\n<tbody>\n<tr>\n<td><img decoding=\"async\" class=\"alignleft wp-image-39075\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/07\/no.png\" alt=\"no\" width=\"150\" height=\"150\" srcset=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2017\/07\/no.png 157w, https:\/\/financialcommission.org\/wp-content\/uploads\/2017\/07\/no-150x150.png 150w\" sizes=\"(max-width: 150px) 100vw, 150px\" \/><\/td>\n<td style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">El distribuidor le recuerda al comerciante de la naturaleza descentralizada del mercado forex, resalta los términos legales y condiciones de acuerdo a lo cual el distribuidor tiene la última palabra en determinar el precio del mercado! Eso es todo el distribuidor no quiere comenzar un diálogo acerca de la disponibilidad de un mejor precio en algún otro lado. <\/span><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><b>Problema – Conflicto de interés<\/b><\/p>\n<table>\n<tbody>\n<tr>\n<td><img decoding=\"async\" class=\"alignleft wp-image-39076\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/07\/2.png\" alt=\"2\" width=\"150\" height=\"132\" \/><\/td>\n<td>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">Desde este momento en adelante los desacuerdos comienzan. Solo un tercero independiente como <\/span><a href=\"https:\/\/xcv.financialcommission.org\/\"><span style=\"font-weight: 400;\">Financial Commission<\/span><\/a><span style=\"font-weight: 400;\"> es capaz de juzgar dichos casos. Apesar de haber firmado documentos, el comerciante solo ve los vacíos pequeños y prejuicios y se consideran decisivos. El ya no quiere escuchar ningún argumento de los distribuidores y creen que el contrato está estructurado en una manera la cual le da el poder legal absoluto para toda ocasiones.<\/span><\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><b>Resolviendo el problema en la etapa de su ocurrencia <\/b><\/p>\n<table>\n<tbody>\n<tr>\n<td><a href=\"http:\/\/www.verifymytrade.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-38798\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/03\/Снимок-экрана-2017-06-21-в-15.11.04.png\" alt=\"Verify My Trade\" width=\"150\" height=\"113\" \/><\/a><\/td>\n<td style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">Un comerciante educado es un cliente leal. <\/span><span style=\"font-weight: 400;\"><a href=\"http:\/\/www.verifymytrade.com\/\" target=\"_blank\" rel=\"noopener\">VerifyMyTrade<\/a> <\/span><span style=\"font-weight: 400;\">le da a los comerciantes un entendimiento de lo que es un mercado descentralizado antes de que independiente llegue a una conclusión y presente un reclamo. Al proveer a los comerciantes con una herramienta para analizar la calidad de sus propios comerciantes, el distribuidor declara transparencia y compromiso a negocios honestos. El cliente después aprenderá que ese precio de ejecución no existe solo como “correcto” o “incorrecto”, pero con varias opciones y factores de por medio. Como consecuencia, aunque se haya encontrado un problema en ejecución el cliente lo verá como un error en vez que como un acto mal intencionado. <\/span><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><b>La posicion de Financial Commission<\/b><\/p>\n<table>\n<tbody>\n<tr>\n<td><a href=\"https:\/\/xcv.financialcommission.org\/\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-26663 size-full\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2014\/07\/finCom_1501.png\" alt=\"finCom_150\" width=\"150\" height=\"150\" \/><\/a><\/td>\n<td style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">La misión de nuestra organización es crear una atmósfera más honesta y confiable en el mercado forex. Esta misión es realizada al unir a corredores los cuales se comprometen a observar los más  altos estándares de honor comercial y las mejores prácticas de negocios, al igual que promocionan el crecimiento del conocimiento comercial acerca de los trabajos dentro del mercado forex. VerifyMyTrade es una excelente iniciativa diseñada para aumentar la transparencia de la industria y el nivel de conciencia de los comerciantes- lo cual es una medida perfecta junto a nuestra misión de nuestra organización. <\/span><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Si estás haciendo comercio en el mercado de forex, probablemente estás pensando que tan bien tu corredor está ejecutando tus ordenes. Si no estás pensando esto, entonces tal vez es el momento de empezar a ser curioso. Desafortunadamente, los corredores no proveen a sus clientes con herramientas para confirmar la ejecución de la calidad de [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[],"tags":[],"class_list":["post-67429","post","type-post","status-publish","format-standard","hentry"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/67429","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=67429"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/67429\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=67429"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=67429"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=67429"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}