{"id":67435,"date":"2017-08-03T00:00:00","date_gmt":"2017-08-03T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/08\/03\/financial-commission-apoya-a-los-hallazgos-recientes-en-el-reporte-de-forex-cfd-comparando-las-jurisdicciones\/"},"modified":"2017-08-03T00:00:00","modified_gmt":"2017-08-03T00:00:00","slug":"financial-commission-apoya-a-los-hallazgos-recientes-en-el-reporte-de-forex-cfd-comparando-las-jurisdicciones","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/08\/03\/financial-commission-apoya-a-los-hallazgos-recientes-en-el-reporte-de-forex-cfd-comparando-las-jurisdicciones\/","title":{"rendered":"Financial Commission apoya a los hallazgos recientes en el reporte de Forex\/CFD comparando las jurisdicciones.","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Julio 26, 2017: Financial Commission, <\/span><span style=\"font-weight: 400;\">una organización líder de resolución de conflictos externos (EDR), operada por FinaCom PLC, servicio en línea de corretaje forex, agentes CFD y proveedores de tecnología en la industria de servicios financieros, anunció  hoy el apoyo al mas reciente hallazgo en el reporte publicado por Traction Fintech. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Un artículo reciente fue publicado por el especialista en cumplimiento de normas de Traction FinTech, que examinó las diferencias entre los derivados del comercio extrabursátil (OTC) influenciado, tales como los contratos de diferencia (CFD), incluyendo Forex en cuatro jurisdicciones.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">El informe completo al que se hace referencia en el artículo fue escrito por James O&#8217;Neill, director del corredor con sede en Australia, ILQ y comparó requisitos relacionados con el manejo del dinero del cliente, precios justos del mercado, influencias y requisitos de capital a través de Australia, Chipre, el Reino Unido (Reino Unido) y los Estados Unidos (EEUU).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Financial Commission <\/span><span style=\"font-weight: 400;\">apoya la necesidad de jurisdicciones para mejorar las reglas que rodean el manejo de dinero del cliente y los métodos de descubrimiento de precios justos (como el código global de FX) para ayudar a mantener la mejor ejecución en los corretrajes globales de Forex y CFD, entre otros temas explorados en el informe.<\/span><\/p>\n<p><b>Comparando cuatro grandes jurisdicciones. <\/b><\/p>\n<p><span style=\"font-weight: 400;\">Un índice en el artículo, que se puede ver a continuación, proporciona una visión general de alto nivel de las diferencias en cada país, y llega poco después de la legislación revisada por el gobierno de Australia en virtud de la ley de sociedades anónimas relacionadas con cómo se manejan las cuentas de fideicomiso dirigidas a ayudar para salvaguardar los fondos del cliente.<\/span><\/p>\n<p>&nbsp;<\/p>\n<table>\n<tbody>\n<tr>\n<td><img fetchpriority=\"high\" decoding=\"async\" class=\"alignleft wp-image-39312 size-full\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/08\/Снимок-экрана-2017-08-03-в-17.48.54.png\" alt=\"%d1%81%d0%bd%d0%b8%d0%bc%d0%be%d0%ba-%d1%8d%d0%ba%d1%80%d0%b0%d0%bd%d0%b0-2017-08-03-%d0%b2-17-48-54\" width=\"593\" height=\"367\" \/><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><b>Precio y ejecucion justo. <\/b><\/p>\n<p><span style=\"font-weight: 400;\">El autor del informe observó que Chipre y Australia rindió por debajo de sus posibilidades al asegurar precios justos y transparentes por los corredores, en comparación con los Estados Unidos y el Reino Unido, y sugirió que Australia examinara normas específicas para hacer frente a su mandato en virtud de la regla 912 (1) (a). Por ejemplo, la definición actual de la fabricación de mercado en Australia es muy general y difícil para disputar deslizamientos asimétricos en términos de infringir el mandato.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">El autor agregó que las obligaciones en el Reglamento de Chipre – concretamente, el artículo 36 de los servicios y actividades de inversión y la ley de mercados regulados del 2007, van más allá del equivalente australiano cuando se trata de deslizamiento de precios asimétricos al ejecutar las órdenes del cliente (aunque ambos se arrastran detrás de los Estados Unidos y el Reino Unido).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">En términos de <\/span><span style=\"font-weight: 400;\">comparación de diferencias en la forma en que los fondos de los clientes se manejan en cada jurisdicción por los corredores autorizados, el autor argumentó algunas de las ventajas y desventajas de permitir que los corredores agregaran capital para ayudar a las cuentas del cliente de búfer para evitar un déficit.<\/span><\/p>\n<p><b>Reglas de cuentas de solución regulatoria y cuentas de fideicomiso. <\/b><\/p>\n<p><span style=\"font-weight: 400;\">Por ejemplo, en el caso de una cuenta de fideicomiso en los Estados Unidos donde se permite solución reguladora-un agente puede mezclar su propio dinero en las cuentas del cliente para ayudar a mantener el exceso de capital y evitar un déficit en el margen requerido (es decir, durante períodos de alta volatilidad).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">El autor argumentó que mezclar el dinero de un corredor en cuentas de fideicomiso de los clientes podría ofuscar la línea entre los fondos que pertenecen a la cuenta y el del dinero del corredor en el caso de la insolvencia.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Mientras tanto, los corredores que pueden utilizar el dinero del cliente para cubrir y para el propósito de margen endosan la idea que no todos los corredores que son parte contraria al comercio de un cliente están actuando como fabricantes de mercado.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Además, permitir el uso de fondos del cliente para cubrir y marginar podría ofuscar la línea entre el comercio propietario y la cobertura que es común para un principal emparejado. El autor también señaló el riesgo sistémico que existe con las cuentas segregadas por el cliente cuando los fondos se agrupan en la misma cuenta, y cómo esto podría remediarse si se requiere que los fondos de cada cliente se mantengan en una cuenta bancaria separada.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Cathe Armour, una comisionada de la Comisión Australiana de valores e inversiones (ASIC) comentó sobre la modificación de las reglas: &#8220;las enmiendas al régimen monetario del cliente que se han hecho en el proyecto de ley han fortalecido la protección del dinero del cliente que se proporciona a clientes de derivados minoristas. Al hacerlo ayudará a aumentar la confianza de los inversores en el sistema financiero australiano&#8221;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sophie Gerber, Directora de Traction FinTech comentó en el artículo, &#8220;Este ha sido un tema muy divisorio en la industria. Lo que podría haber sido un enfoque más beneficioso para esta cuestión sería haber rechazado el uso de las prohibiciones de la ley de corporaciones para el uso de dinero del cliente para el margen\/cobertura, etc. con partes relacionadas y también prohibir el pago de cualquier forma de conflicto remuneración en estas relaciones. Tiempo nos mostrará si estas reformas tienen o no han beneficiado a la industria, creo que, lamentablemente, en este caso el cliente minorista no verá ningún beneficio, y en los próximos años los resultados reducirán la competencia y aumentarán los costos&#8221;.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">El autor notó que a pesar de las revisiones de la regla el dinero del cliente todavía se agrupa en la misma cuenta bancaria y no está protegido contra el riesgo de la parte contraria en caso de la insolvencia del corredor. Agregó cómo la prohibición de ASIC de permitir una solución reguladora contrastada con otras jurisdicciones donde mantener el exceso de capital es necesario, por ejemplo, en Estados Unidos.<\/span><\/p>\n<p><b>Apalancamiento financiero<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Como el comercio de Forex apalancado  y comercio CFD se realiza desde una cuenta de margen, los requisitos mínimos de margen a menudo varían de corredor a corredor con una ola de restricciones en los últimos años, reduciendo el apalancamiento máxim que se puede ofrecer en diferentes países.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">El autor explicó que el apalancamiento se culpa a menudo como la causa de las pérdidas de los clientes, y mientras que tales restricciones se han puesto en marcha en muchas jurisdicciones importantes, el Reino Unido todavía no ha puesto en marcha una. Y aunque el más alto apalancamiento ha sido atractivo para muchos comerciantes, en jurisdicciones como Japón, una reducción del apalancamiento no parece haber obstaculizado su industria de Forex minorista, ya que un apalancamiento más bajo puede haber ayudado a que se convierta en una clase de activos más aceptada para inversionistas domésticos.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">El artículo citó una extensa lista de artículos de noticias de la industria, incluyendo anuncios de los reguladores, para ver el artículo completo<\/span> <a href=\"http:\/\/tractionfintech.com\/uk\/blog\/comparison-regulators-rules-cfds-forex\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">haga click aquí<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p>© <a href=\"http:\/\/tractionfintech.com\/uk\/\" target=\"_blank\" rel=\"noopener\">Traction Fintech<\/a><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Julio 26, 2017: Financial Commission, una organización líder de resolución de conflictos externos (EDR), operada por FinaCom PLC, servicio en línea de corretaje forex, agentes CFD y proveedores de tecnología en la industria de servicios financieros, anunció  hoy el apoyo al mas reciente hallazgo en el reporte publicado por Traction Fintech. Un artículo reciente fue [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[],"tags":[],"class_list":["post-67435","post","type-post","status-publish","format-standard","hentry"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/67435","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=67435"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/67435\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=67435"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=67435"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=67435"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}