{"id":71612,"date":"2013-09-11T00:00:00","date_gmt":"2013-09-11T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2013\/09\/11\/the-financial-commission-launches-with-first-5-members\/"},"modified":"2013-09-11T00:00:00","modified_gmt":"2013-09-11T00:00:00","slug":"the-financial-commission-launches-with-first-5-members","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2013\/09\/11\/the-financial-commission-launches-with-first-5-members\/","title":{"rendered":"The Financial Commission Launches with First 5 Members","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Posted by <a href=\"http:\/\/www.prweb.com\/releases\/2013\/9\/prweb11111443.htm\" target=\"_blank\" rel=\"noopener\">PR Web<\/a><\/p>\n<div class=\"one content\">\n<p class=\"subtitle\"><strong>The Financial Commission has launched the first global Forex alternative dispute resolution organization with the goal to facilitate a way for brokers and clients to solve disputes without the need of a time consuming and expensive regulatory process.<\/strong><\/p>\n<p><!--more--><\/p>\n<p>Hong Kong, China (PRWEB) September 11, 2013<\/p>\n<p>The Financial Commission, a new dispute resolution organization specializing in the Forex market, is pleased to announce the initial participating members of their organization. The Commission was formed to provide consumers with an alternative to legal or regulatory proceedings for resolving Forex related disputes with broker members of the Financial Commission.<\/p>\n<p>The participating brokers of the Financial Commission are<\/p>\n<p>AForex<\/p>\n<p>Alpari<\/p>\n<p>FXOpen<\/p>\n<p>FX Fair<\/p>\n<p>LionStone UK<\/p>\n<p>Commenting on their membership in the committee, Financial Commission CEO Jeffrey Baskin said, “We are proud to have these companies as members of the Financial Commission. We feel this will provide their clients a fair and convenient way to voice any complaints they may have. The Financial Commission also has confidence that the members of the Dispute Resolution Committee will be able to resolve any complaints in a manner that is fair for both the trader and the broker.”<\/p>\n<p>The Financial Commission feels that a well-functioning alternative dispute resolution process in the Forex industry will encourage traders to seek solutions to the problems they encounter when trading the Forex market. This will help both the trader and the broker save time and resources which can be better spent elsewhere. In addition, an efficient alternative dispute resolution process will help boost trader confidence in their broker as well as the Forex industry. The Financial Commission is open for membership to brokers across the world and plans to hear disputes from traders of all monetary value.<\/p>\n<p>The Financial Commission features a Dispute Resolution Committee (DRC) comprised of senior members in the Forex industry. The DRC members include Carl Elsammak, CEO Kammas Trading; Ilan Azbel, CEO Autochartist; Francesc Riverola, Founder FXStreet and Ilya Sorokin, CEO Act Forex. The DRC members bring diverse backgrounds, strong legal skills and extensive experience to the role. This experience will enable the DRC to review and resolve disputes providing both the broker and trader an amicable solution to any issues that arise in the course of Forex trading.<\/p>\n<p>As of now, the Financial Commission is finalizing the final details of the rules and the organization setup with both its members and Dispute Resolution Committee. They intend on hearing complaints on October 1st 2013 if not sooner.<\/p>\n<p>Interested parties can contact the Financial Commission at: <a onclick=\"linkClick(this.href)\" href=\"http:\/\/xcv.financialcommission.org\" rel=\"nofollow\">http:\/\/xcv.financialcommission.org<\/a> or via email info(at)financialcommission(dot)org.<\/p>\n<\/div>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Posted by PR Web The Financial Commission has launched the first global Forex alternative dispute resolution organization with the goal to facilitate a way for brokers and clients to solve disputes without the need of a time consuming and expensive regulatory process.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71612","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71612","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71612"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71612\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71612"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71612"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71612"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}