{"id":71613,"date":"2013-09-25T00:00:00","date_gmt":"2013-09-25T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2013\/09\/25\/the-financial-commission-dispute-resolution-committee-welcomes-two-new-members\/"},"modified":"2013-09-25T00:00:00","modified_gmt":"2013-09-25T00:00:00","slug":"the-financial-commission-dispute-resolution-committee-welcomes-two-new-members","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2013\/09\/25\/the-financial-commission-dispute-resolution-committee-welcomes-two-new-members\/","title":{"rendered":"The Financial Commission Dispute Resolution Committee Welcomes Two New Members","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Posted by <a href=\"http:\/\/www.prweb.com\/releases\/2013\/9\/prweb11150622.htm\" target=\"_blank\" rel=\"noopener\">PR Web<\/a><\/p>\n<p><strong>The Financial Commission continues to expand after their recent launch adding two new members to their Dispute Resolution Committee.<\/strong><br \/>\n<!--more--><br \/>\n<em>Hong Kong, China (PRWEB) September 24, 2013<\/em><\/p>\n<p>The Financial Commission welcomes Simon Grunfeld and Andrew Ralich to their Dispute Resolution Committee.<\/p>\n<p><strong>Simon Grunfeld – Principal | Gallant Partners LLC <\/strong><br \/>\nSimon is the Founder and CEO of Gallant Partners LLC, a custom web &amp; software development and Internet strategies company. Simon started his career in IT and then became a registered CTA (2006 &#8211; series 3) to form Gallant FX. Then co-founded and headed up the product development of Gallant VPS, which launched the first Institutional VPS provider to the retail Forex market. Soon after, was one of two partners in the very first BVI FSC registered broker dealer and co-founded Gallant Capital Markets (GCMFX). As an innovator for new and emerging technologies, with focus on Development, Hosting, Security, Mobile, in industries like the Financial Markets and Healthcare (Primarily), Simon most recently was part of a Pharmaceuticals\/Biotech project involving Big Data integration for the pharma and aesthetics industry.<\/p>\n<p><strong>Andrew Ralich | Co-Founder\/CEO oneZero Financial Systems <\/strong><br \/>\nAndrew has extensive experience in both the software development and financial technology fields. Andrew was awarded a patent for work on a data migration utility for Goldman Sachs during his time at EMC (2005-2008). In parallel he founded reThink LLC (2007–2009), a software consulting firm targeted at financial applications and algorithmic trading systems. Through multiple successful projects for technology firms, managed funds, and brokerages, Andrew has gained experience in advanced trading-systems development, back-office system development, and enterprise risk management. Andrew has combined his programming skills, options trading expertise, and ability to identify enterprise-level solutions for brokerages, managers, and traders in his role at oneZero Financial.<\/p>\n<p>The Financial Commission Chairman of the Board Peter Tatarnikov said, “The Financial Commission has added two more great members to our already impressive Dispute Resolution Committee. Andrew and Simon are foremost experts in the Forex industry and their expertise is a great asset to our DRC, which will help us to resolve any complaints. We look forward to their contribution.<\/p>\n<p>The two new members of the Dispute Resolution Committee join the Financial Commission at an exciting time. The Financial Commission has also just announced their first five members and plan to begin taking complaints shortly which Andrew and Simon will be participating in the decision making process for those complaints.<\/p>\n<p>For more information, please contact The Financial Commission – info(at)financialcommission(dot)org or by phone 212-655-5493<\/p>\n<p><strong>About the Financial Commission<\/strong><br \/>\nThe Financial Commission is an external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes with financial services providers that are members of the Financial Commission.<br \/>\nThe Financial Commission set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading the Forex market.<br \/>\nThe Financial Commission was established to be a neutral 3rd party committee to fairly review and resolve complaints in an effort to facilitate a simpler, swifter resolution than through industry regulators and the legal system<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Posted by PR Web The Financial Commission continues to expand after their recent launch adding two new members to their Dispute Resolution Committee.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71613","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71613","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71613"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71613\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71613"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71613"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71613"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}