{"id":71611,"date":"2013-08-15T00:00:00","date_gmt":"2013-08-15T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2013\/08\/15\/fx-industry-welcomes-new-global-dispute-resolution-committee-financial-commission\/"},"modified":"2013-08-15T00:00:00","modified_gmt":"2013-08-15T00:00:00","slug":"fx-industry-welcomes-new-global-dispute-resolution-committee-financial-commission","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2013\/08\/15\/fx-industry-welcomes-new-global-dispute-resolution-committee-financial-commission\/","title":{"rendered":"FX Industry Welcomes New Global Dispute Resolution Committee: Financial Commission","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Posted By <a href=\"http:\/\/forexmagnates.com\/financial-commission-brings-a-fresh-direction-to-resolving-traderbroker-disputes-in-the-forex-industry\/\" target=\"_blank\" rel=\"noopener\">Forex Magnates<\/a><\/p>\n<p><em>Financial Commission brings a fresh direction to resolving trader\/broker disputes in the Forex industry<\/em><\/p>\n<p>Composed of experienced and influential figures of Forex, the Financial Commission is launching today an alternative dispute resolution committee to provide the industry a way to review and resolve complaints without legal or regulatory interference.<\/p>\n<p><!--more--><\/p>\n<ul>\n<li>Qualified and experienced Dispute Resolution Committee consists of members from all areas of the Forex industry from Compliance to Trading<\/li>\n<li>The Financial Commission challenges the limitations of traditional Forex regulators<\/li>\n<\/ul>\n<p><a href=\"http:\/\/forexmagnates.com\/wp-content\/uploads\/2013\/07\/FC-logo.png\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignleft size-full wp-image-24911\" alt=\"FC logo\" src=\"http:\/\/forexmagnates.com\/wp-content\/uploads\/2013\/07\/FC-logo.png\" width=\"140\" height=\"140\" \/><\/a><\/p>\n<p>Hong Kong, China July 9th, 2013 – <a href=\"http:\/\/xcv.financialcommission.org\/\" target=\"_blank\">The Financial Commission<\/a> is pleased to announce the launch of their new Dispute Resolution Committee. The Financial Commission is an alternative dispute resolution organization based in Hong Kong, the Forex and financial center of the East. The Commission was formed to provide consumers with an alternative to legal or regulatory proceedings for resolving Forex related disputes with broker members of the Financial Commission.<\/p>\n<p>The Financial Commission feels that well-functioning alternative dispute resolution procedures in the Forex industry will encourage traders to seek solutions to the problems they encounter when trading Forex. This will help both the trader and the broker save time and money which can be better spent on trading. In addition, an efficient alternative dispute resolution procedures will help boost trader confidence in their broker as well as the Forex industry. The Financial Commission will be open for membership to brokers across the world and plans to hear disputes from traders of all monetary value.<\/p>\n<p>The Financial Commission features a Dispute Resolution Committee (DRC) comprised of senior members in the Forex industry. The DRC members include Carl Elsammak CEO Kammas Trading, Michael Brand former Compliance Officer of both FXCM and Boston Technologies, Ilan Azbel CEO AutoChartist, and Francesc Riverola Founder FXStreet. The DRC members bring diverse backgrounds, strong legal skills and extensive experience to the role. This experience will enable the DRC to review and resolve disputes providing both the broker and trader an amicable solution to any issues that arise in the course of Forex trading.<\/p>\n<p>Commenting on the company launch today, Michael Greenberg and Peter Tatarnikov from the Board of Directors of the Financial Commission said in a joint statement: “We are happy to launch the Financial Commission. An alternative dispute resolution organization comprised of members from the Forex industry has been needed for a long time. Many times regulatory committee members don’t have any practical market experience. We felt providing brokers and traders a way to resolve complaints without involving legal or regulatory proceedings is going to benefit the FX industry tremendously. It offers traders a voice to file complaints as well as the broker an efficient way to respond without having their reputation possibly tarnished for an unjust complaint.”<\/p>\n<p>The Financial Commission’s Board of Directors has a vast array of experience that is second to none. It is comprised of Forex Magnates Founder Michael Greenberg, Former CEO of Forex Club USA Peter Tatarnikov, co-CEO and Founder of Leverate Ran Strauss, and Former CMO of Forex Club Alex Pavlenko.<\/p>\n<p>The Financial Commission has appointed Jeffrey Baskin, current CEO of ForexEducation.com and former Director of Client Education for FXDD as the CEO of the company and Michael Brand former Compliance Officer of both FXCM and Boston Technologies, as the Head of DRC.<\/p>\n<p>The Financial Commission is now reviewing the first round of applications from a few leading Forex brokerages who are interested in becoming initial members of the commission.<\/p>\n<p>Interested parties can contact the Financial Commission at: <a href=\"http:\/\/xcv.financialcommission.org\/\" target=\"_blank\">www.financialcommision.org<\/a> or the CEO <a href=\"mailto: Jeffrey@financialcommission.org\">Jeffrey Baskin<\/a> directly.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Posted By Forex Magnates Financial Commission brings a fresh direction to resolving trader\/broker disputes in the Forex industry Composed of experienced and influential figures of Forex, the Financial Commission is launching today an alternative dispute resolution committee to provide the industry a way to review and resolve complaints without legal or regulatory interference.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71611","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71611","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71611"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71611\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71611"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71611"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71611"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}