{"id":71618,"date":"2013-10-23T00:00:00","date_gmt":"2013-10-23T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2013\/10\/23\/the-financial-commission-welcomes-lior-nabat-ceo-of-tradency-to-their-dispute-resolution-committee\/"},"modified":"2013-10-23T00:00:00","modified_gmt":"2013-10-23T00:00:00","slug":"the-financial-commission-welcomes-lior-nabat-ceo-of-tradency-to-their-dispute-resolution-committee","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2013\/10\/23\/the-financial-commission-welcomes-lior-nabat-ceo-of-tradency-to-their-dispute-resolution-committee\/","title":{"rendered":"The Financial Commission welcomes Lior Nabat CEO of Tradency to their Dispute Resolution Committee.","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Lior Nabat, is a hi-tech veteran which co-founded Tradency in early 2005. Following his long career in the technology arena, Nabat became interested in the financial industry, specifically the foreign exchange market. He found the high liquidity, round-the-clock nature of the business and high level of the technology in this field exciting and fascinating.  Nabat, with the help of his partners developed an automated Forex trading software solution involving signal providers and originated the Mirror Trading concept &#038; trading platform. Nabat has an extensive technological background starting with the Israeli air force’s telecommunications division, through to various hi-tech companies, all in the telecommunications field and currently as an entrepreneur in the financial technology industry. Nabat holds a degree in mathematics and computer science through the Open University in Israel.<\/p>\n<p>The Financial Commission Chairman of the Board Peter Tatarnikov said, “The Financial Commission has added another great member to our already impressive Dispute Resolution Committee. Lior is a pioneer in the Forex industry and has expertise in both Forex trading and technology, which will help us to resolve any complaints that come into the Financial Commission. We look forward to his contribution.<\/p>\n<p>Lior joins the Financial Commission at an exciting time. The Financial Commission has recently launched with 5 members and will be adding new members to their existing roster very soon.  They have also begun taking complaints which Lior will be participating in the decision making process for those complaints.<\/p>\n<p><strong>For more information, please contact The Financial Commission – info@financialcommission.org or by phone 212-655-5493<\/strong><\/p>\n<p><strong>About the Financial Commission<\/strong><br \/>\nThe Financial Commission is an external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes with financial services providers that are members of the Financial Commission.<br \/>\nThe Financial Commission set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading the Forex market.<br \/>\nThe Financial Commission was established to be a neutral 3rd party committee to fairly review and resolve complaints in an effort to facilitate a simpler, swifter resolution than through industry regulators and the legal system.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Lior Nabat, is a hi-tech veteran which co-founded Tradency in early 2005. Following his long career in the technology arena, Nabat became interested in the financial industry, specifically the foreign exchange market. He found the high liquidity, round-the-clock nature of the business and high level of the technology in this field exciting and fascinating. Nabat, [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71618","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71618","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71618"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71618\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71618"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71618"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71618"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}