{"id":71621,"date":"2013-11-18T00:00:00","date_gmt":"2013-11-18T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2013\/11\/18\/the-financial-commission-welcomes-aleksey-kutsenko-ceo-of-tools4brokers-com-to-their-dispute-resolution-committee\/"},"modified":"2013-11-18T00:00:00","modified_gmt":"2013-11-18T00:00:00","slug":"the-financial-commission-welcomes-aleksey-kutsenko-ceo-of-tools4brokers-com-to-their-dispute-resolution-committee","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2013\/11\/18\/the-financial-commission-welcomes-aleksey-kutsenko-ceo-of-tools4brokers-com-to-their-dispute-resolution-committee\/","title":{"rendered":"The Financial Commission welcomes Aleksey Kutsenko CEO of Tools4Brokers.com to their Dispute Resolution Committee.","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Aleksey has his education in the fields of physics and mathematics in addition to many years of software development experience. Based on this combination it was a perfect fit for Aleksey to create his own IT-company, Tools For Brokers Inc., which allowed him to put all his ideas and plans into practice.  Aleksey was the first in the world to develop a One-Click-Trading plug-in for MetaTrader4, which is used by the world’s leading Forex brokers.<br \/>\nIn 2011 Aleksey also became a co-founder and technological inspiration of the Forex Stars project – the first independent platform in the World to host universal Forex-tournaments for traders.  Today Tools For Brokers Inc. cooperates with more than 100 brokers around the world and provides solutions for many trading platforms.<br \/>\nThe next milestone in his career will come when Tools For Brokers Inc. introduces a proprietary trading platform that will take retail Forex trading to a whole new level.<\/p>\n<p>The Financial Commission Chairman of the Board Peter Tatarnikov said, “The Financial Commission continues to add All-Star talent to their roster in the Dispute Resolution Committee.  Aleksey is one of the best Metatrader 4 software engineers in the industry.  His experience with retail traders, brokers, and the trading platform will be a vital addition to the Financial Commission and his experience will be a great help to resolving any disputes that come in.  We look forward to his contribution.”<\/p>\n<p>Aleksey joins the Financial Commission as they continue to grow. The Financial Commission has recently  added its 6th member MFX Broker and will continue to review any complaints that come in from their existing broker members.   In addition the Financial Commission estimates there should be a few more members who will be announced before the end of 2013.<\/p>\n<p>For more information, please contact The Financial Commission – info@financialcommission.org or by phone 212-655-5493<\/p>\n<p>About the Financial Commission<br \/>\nThe Financial Commission is an external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes with financial services providers that are members of the Financial Commission.<br \/>\nThe Financial Commission set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading the Forex market.<br \/>\nThe Financial Commission was established to be a neutral 3rd party committee to fairly review and resolve complaints in an effort to facilitate a simpler, swifter resolution than through industry regulators and the legal system<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Aleksey has his education in the fields of physics and mathematics in addition to many years of software development experience. Based on this combination it was a perfect fit for Aleksey to create his own IT-company, Tools For Brokers Inc., which allowed him to put all his ideas and plans into practice. Aleksey was the [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71621","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71621","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71621"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71621\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}