{"id":71620,"date":"2013-11-08T00:00:00","date_gmt":"2013-11-08T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2013\/11\/08\/the-financial-commission-continues-to-expand-now-offering-5-languages-for-clients-and-members\/"},"modified":"2013-11-08T00:00:00","modified_gmt":"2013-11-08T00:00:00","slug":"the-financial-commission-continues-to-expand-now-offering-5-languages-for-clients-and-members","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2013\/11\/08\/the-financial-commission-continues-to-expand-now-offering-5-languages-for-clients-and-members\/","title":{"rendered":"The Financial Commission continues to expand, now offering 5 languages for clients and members.","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>November 7, 2013 Hong Kong <\/p>\n<p>The Financial Commission, the first dedicated Forex dispute resolution organization, continues to be a trend setter in the area of Forex dispute resolution, now offering 5 languages to cater to a global Membership and client base.  <\/p>\n<p>The Financial Commission initially launched with just English and in less than a month now offers service in Russian, Chinese, Spanish, Arabic, and Indonesian.  The Financial Commission will also soon be offering Turkish and Hebrew as well.<\/p>\n<p>Speaking with Peter Tatarnikov, Chairman of the Board of the Financial Commission, he said “The Forex market is a global industry and most brokers have clients from over 50 different countries around the world who all don’t necessarily speak English.  We felt it was a necessity to offer multiple languages especially when it comes to discussing trading disputes.  A client must be able to communicate in his\/her native language so they can express their concerns and file their dispute most effectively.  The Financial Commission is the first to offer this type of service in multiple languages and we look forward to continuing to be a pioneer in this industry.”<\/p>\n<p>The Financial Commission will continue their growth and development adding support in both Hebrew and Turkish very soon as well as currently adding new members to the Financial Commission.  In addition the Financial Commission recently brought on multiple Forex experts to their constantly expanding Dispute Resolution Committee including Tradency CEO Lior Nabat and Tools4Brokers.com CEO Aleksey Kutsenko. <\/p>\n<p>For more information, please contact The Financial Commission – info@financialcommission.org or by phone 212-655-5493<\/p>\n<p>About the Financial Commission<br \/>\nThe Financial Commission is an external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes with financial services providers that are members of the Financial Commission.<br \/>\nThe Financial Commission set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading the Forex market.<br \/>\nThe Financial Commission was established to be a neutral 3rd party committee to fairly review and resolve complaints in an effort to facilitate a simpler, swifter resolution than through industry regulators and the legal system.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>November 7, 2013 Hong Kong The Financial Commission, the first dedicated Forex dispute resolution organization, continues to be a trend setter in the area of Forex dispute resolution, now offering 5 languages to cater to a global Membership and client base. The Financial Commission initially launched with just English and in less than a month [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71620","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71620","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71620"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71620\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71620"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71620"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71620"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}