{"id":71636,"date":"2014-07-24T00:00:00","date_gmt":"2014-07-24T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2014\/07\/24\/financial-commission-2013-report\/"},"modified":"2014-07-24T00:00:00","modified_gmt":"2014-07-24T00:00:00","slug":"financial-commission-2013-report","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2014\/07\/24\/financial-commission-2013-report\/","title":{"rendered":"Financial Commission 2013 Report","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: left;\" align=\"center\"><b>A New Player in the Forex Scene – Six-Months Up and Running, with a Promising Future Ahead<\/b><\/p>\n<p>In the industry of Forex, there is a distinct collection of entities that interact; the brokers (and IBs), the clients and the regulatory bodies. Like in every field or industry, friction and disputes do arise, and up till now – it has often been a long and rigid process to reach resolutions and manage disputes. Moreover, there has always been a veil of mystery around these disputes, with resolutions not being found, or even sought. This is where Financial Commission comes into the picture.<\/p>\n<p><b>What the Financial Commission is all about<\/b><\/p>\n<p>The Financial Commission is a neutral, third party dispute resolution entity in the field of Forex trading; solving disputes between traders and their brokers. A new player indeed, Financial Commission has filled a big vacuum of need in the industry. The Commission bases its philosophy on the following pillars:<\/p>\n<p><i>1. Education<\/i>. Knowledge is power. Oftentimes, disputes arise from a lack of knowledge or misunderstandings on the side of the traders, about how the Forex industry works. Slippage, pip spread, spikes and more could throw traders off track and cause them to believe there has been misconduct. Whether the dispute has arisen from a lack of knowledge or not, the disgruntled trader will in both cases feel acute lack of fairness. The Financial Commission has outlined its mission to give knowledge to the traders, so they are <i>partners<\/i> in their success, as opposed to mere onlookers, and never in the dark about how the industry works. On the other side of the same coin, Financial Commission educates its members on how to better communicate with their traders, in order to make the relationship a healthy two-way dialogue. For Financial Commission, education is of utmost importance due to its mission to deal with the <i>root<\/i> of the problems, rather than only providing on-the-spot solutions. This is the very philosophy that, for all parties involved, will transform our industry into a clearer and fairer one.<\/p>\n<p>2. <i>Transparency<\/i>. Having a neutral, professional and unaffiliated body you can trust in this tumultuous world of Forex can make all the difference. The interest-free Financial Commission and the Dispute Resolution Committee (DRC) that is built up of a fascinating mosaic of experienced and esteemed figures in the industry, work together to review each and every case with one goal only; dispute resolution on the side of justice. With the bigger picture always in the background of making this industry clearer and granting traders more knowledge, Financial Commission zooms in on any complaint that arises in order to make sure that the parties walk away with the knowledge they need about the case, as well as an amicable and fair resolution. The healthiest dispute resolution that exists is one where a neutral body is pre-defined and gears into operation to objectively solve a dispute when needed. In the world of Forex, Financial Commission is it.<\/p>\n<p>3. <i>Swiftness and efficiency<\/i>. The Financial Commission with the DRC at the heart of its operation works like clockwork on each and every complaint. In concretely organized steps, the DRC will reach a resolution of the case within several weeks, with intermediary milestones of communication along the way, with both sides of the dispute. Alongside the dedication to education and reliability, Financial Commission believes in the highest level of professionalism and meticulous conduct in every endeavor, in order to continue its impressive track record for years to come.<\/p>\n<p><b><\/b><b>In Only Six Months, Impressive Results<\/b><\/p>\n<p>During only six months of operation, the Financial Commission has resolved around 20 complaints from traders; most of which were only in the last 2 months. Alongside this, we are pleased to know that the traders’ community awareness regarding an independent arbitrator who can address their disputes against service providers in the financial markets has increased significantly. A remarkable fact is, that the bulk of claims are directly related to the most basic principles of Forex trading, which are still poorly understood by traders. This is purely in line with Financial Commission’s overall philosophy of giving education a major role within dispute resolution. Among these are some aspects of trading, such as execution of pending orders during the publication of important economic news, the way the margin for open positions is calculated in all trading platforms or for example, the purpose and the operation principle of Stop Out or Margin Call. Some traders get a better understanding of these things too late, and very often their open positions are closed by the broker because of lack of free margin. In this regard, the Financial Commission recommends that the brokerage companies pay more attention to the education of their customers. All brokers must do so in order to help their customers avoid some unpleasant situations while trading.<\/p>\n<p>In addition to offering a dispute resolution framework and enhancing the education of the traders in order to reduce the overall number of disputes and grievances in the long run, the most important aspect of this mechanism, is that it helps the brokers to retain their critical mass of clientele. That is, due to the fact that many small traders never actually file complaints, but simply leave negative feedback in traders’ forums and spread the word in their communities, (often stemming from lack of knowledge), brokers could slowly but surely lose a significant number of traders, who will simply wander elsewhere in these cases.<\/p>\n<p>Financial Commission also helps to expose new trends and phenomena that come up in the industry, based on the claims it receives. It is particularly interesting to note one category of claims, which included cases where clients of brokerage firms either intentionally or unknowingly used special software (Expert Advisors), which was designed to cheat, using trading technologies. The Financial Commission has taken a tough stance on this issue and believes that the use of such methods to generate profits is a violation of generally accepted norms and principles of doing business based on fair and mutually beneficial partnership. We feel it`s very important to mention here that Financial Commission may never be used as a bargaining tool for the traders who utilize such methods. The founders of the Financial Commission have repeatedly witnessed situations where a person using such techniques was identified and expelled from the ranks of customers of the affected companies. However, in some cases, such clients managed to withdraw some dishonest profits from their accounts. The official position of the Financial Commission on this issue is that on regulated markets such actions should be classified as fraud. Finally, we selected a specific category of claims related to failures in the technical provision of brokerage companies. Typically, such claims do not cause any problems and are resolved in favor of traders.<ins cite=\"mailto:Peter\" datetime=\"2014-02-03T14:46\"><\/ins><\/p>\n<p>Looking at the final statistics on claims admitted to the Financial Commission during the period of its existence, around 26% of the claims were resolved in favor of traders<del cite=\"mailto:user1\" datetime=\"2014-02-11T10:43\"> <\/del>.<\/p>\n<p>In addition to the aforementioned claims, the Financial Commission has received 12 complaints from clients of brokerage firms, who are not yet members of our organization. The geographical span of these customers is very extensive; clients from Russia, other countries of Eastern Europe and the CIS, China and Southeast Asia, the Arab countries and more. This again reinforces that fact that the problem of lack of a fair dispute resolution mechanism, actually exists. We are communicating with brokerage companies from these regions and highly recommend to them to join the Financial Commission in order to further work together to solve these problems in a more efficient way. Finally, there is a mechanism to do so, which will be favorable for all.<\/p>\n<p><b>The Members of the Financial Commission<\/b><\/p>\n<p>Over the course of only six months, Financial Commission has already had the pleasure of welcoming <a title=\"Participating members of the Financial Commission\" href=\"http:\/\/xcv.financialcommission.org\/members\/participating-members-of-the-financial-commission\/\">seven of the biggest names of the industry<\/a> as members, and the activity of the Financial Commission is gaining speed, as this new and exciting mechanism is gaining its well-deserved place on the map.<\/p>\n<p>AForex, Alpari, FXOpen FXFair, Lionstone Investment<del cite=\"mailto:Peter\" datetime=\"2014-02-03T14:47\"> <\/del>,MFX Broker and RoboForex are among the recent members to join the Commission, many of which have already experienced successful and satisfactory dispute resolution. The companies are from various regions around the world, and some are already members of local EDRs, yet still saw the need to join the Commission. This clearly reinforces the fact that the Commission fills an important need in the industry, and that its geographical grasp and popularity are spreading.<\/p>\n<p><b>The Dispute Resolution Committee<\/b><\/p>\n<p>The driving mechanism of the Commission as a whole is the <a href=\"http:\/\/xcv.financialcommission.org\/resolving-a-dispute\/dispute-resoultion\/\">Dispute Resolution Committee<\/a>, the DRC. Top and esteemed figures from the industry; no less than the CEOs and Presidents of the leading Forex educational bodies and technical provider companies come together to make up the DRC, which solves each and every dispute that reaches it.<\/p>\n<p>The disputes are addressed, investigated and solved by a combined endeavor of this impressive group of top figures. The goal is to create a framework where rich experience and knowledge are key, as well as giving a multi-dimensional view of every dispute, based on the variety and diversity of expertise these top figures bring with them, after years in their respective fields. When having one’s dispute resolved by the Financial Commission, and in essence by the DRC, every Forex trader knows that his\/her dispute will be overseen by the absolute top levels, with the highest and most refined levels of expertise, and of course – with full neutrality and objectivity.<ins cite=\"mailto:user1\" datetime=\"2014-02-11T12:34\"><\/ins><\/p>\n<p><em>The Current DCR Members are:<\/em><ins cite=\"mailto:user1\" datetime=\"2014-02-11T12:38\"><\/ins><\/p>\n<p>Anatoly Bulanov – <a title=\"Anatoly Bulanov – The New Head of the Dispute Resolution Committee at the Financial Commission\" href=\"http:\/\/xcv.financialcommission.org\/2014\/02\/04\/anatoly-bulanov-the-new-head-of-the-dispute-resolution-committee-at-the-financial-commission\/\">Head of the DRC<\/a><\/p>\n<p>Ilan Azbel – CEO, AutoChartist<\/p>\n<p>Francesc Riverola – CEO, FX Street<\/p>\n<p>Carl Elsammak – CEO, Kammas<\/p>\n<p>Ilya Sorokin – CEO, ACT Forex<\/p>\n<p>Simon Grunfeld – Partner, Stone Street Solutions<\/p>\n<p>Andrew Ralich – Co-Founder, oneZero Financial<\/p>\n<p>Lior Nabat – CEO, Tradency<\/p>\n<p>Aleksey Kutsenko – CEO, Tools4Brokers.com<\/p>\n<p>Kevin Millien – President, Millien Consulting Group<\/p>\n<p>Financial Commission is on a constant quest to enrich the DRC, by welcoming no less than the very top figures of the industry. These leading individuals in the field come together to form the ultimate dispute resolution setting; a trader or broker could not ask for more.  The accumulated years of experience and profound knowledge, sitting in one room, to deal with each and every dispute is the very reason why the Financial Commission has made such a grand appearance on the scene of the Forex industry.<\/p>\n<p>The DRC is expanding and enriching its collection of members, and this manifests itself especially in <a href=\"http:\/\/xcv.financialcommission.org\/2014\/02\/04\/anatoly-bulanov-the-new-head-of-the-dispute-resolution-committee-at-the-financial-commission\/\">the latest new appointment<\/a>; Anatoly Bulanov as the Head of the DRC. Mr. Bulanov is a well-known figure in the industry, having over a decade and a half’s worth of acumen; with an emphasis on traders’ education, live trading, analysis and the technical aspects of trading and platforms as well.<\/p>\n<p><b>Financial Commission in the Press<\/b><\/p>\n<p>With the appearance of the unique Financial Commission onto the scene, the media and press have noted this as a turning point in the field and have been covering its developments closely. Big names in the media such as the examples below, have been seeking to tell the FX world about the Commission and its mission;<\/p>\n<p>FXStreet; <i>“if the commission should succeed, no doubt it is a good and a right step towards making FX a real asset class for traders all over the world”<\/i><\/p>\n<p>iLearney alluded to the importance of Financial Commission’s role in Russia; <i>“protecting the rights of the traders and investors is vital, because according to experts, Russia has around 400 thousand people in the FX industry, and with this growth brings with it a higher number of claims against brokers”<\/i><\/p>\n<p>Interfax, a leading news agency in Russia, has been following Financial Commission and included its developments in their prestigious Annual FX Market Development Research outlining the fact that Financial Commission is an important and effective tool in the field of Forex, bridging traders and brokers and playing a crucial role.<\/p>\n<p>In addition to this buzz in the media, Financial Commission is invited to many global FX events and Conferences; the Forex Magnates Summits in London and Tokyo in 2013, as well as the iFX expo in Macau, 2014 are just a few examples of the global presence Financial Commission has gained in the industry.<\/p>\n<p>Financial Commission has received vast support from the industry, on regional and international levels, and this reinforces the notion that this unique type of operation is much needed in the FX field and shows very clearly, where it is going from here.<\/p>\n<p><b>At the Start of 2014; Looking Forward<\/b><\/p>\n<p>After six months, it is safe to say that the Financial Commission has paved its way into the Forex industry, and was certainly welcomed by it. It is clear that the need for neutral and hassle-free dispute resolution has been around for a while, and the time has come to address this need. As the famous phrase says; “necessity is the mother of invention” – this was indeed the case in the creation and introduction of this first-ever neutral and professional dispute resolution body, which seeks to resolve disputes as well as transform the whole industry and the way Forex traders’ grievances are addressed and handled. Looking forward to following years, the Financial Commission will be welcoming additional members, and will be expanding its activity to more and more geographical locations.<\/p>\n<p>Most importantly, and being the very fabric of the Financial Commission’s activity, the Commission will be responsible for a new way of thinking. Finally, for the traders, there <i>is<\/i> a body, which is there to resolve disputes. For the brokers, there <i>is<\/i> a way to show reliability and enhance credibility and thus confidence, for existing and potential clients. In addition to constant expansion and global exposure, Financial Commission is also enhancing its capabilities on a professional and technical level. That is, Financial Commission is extending its operation to cover more financial instruments and trading mechanisms, as well as branching out to more and more areas within the FX industry where disputes could arise.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>A New Player in the Forex Scene – Six-Months Up and Running, with a Promising Future Ahead In the industry of Forex, there is a distinct collection of entities that interact; the brokers (and IBs), the clients and the regulatory bodies. Like in every field or industry, friction and disputes do arise, and up till [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6401],"tags":[],"class_list":["post-71636","post","type-post","status-publish","format-standard","hentry","category-commission-reports"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71636","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71636"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71636\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71636"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71636"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71636"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}