{"id":71646,"date":"2014-09-08T00:00:00","date_gmt":"2014-09-08T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2014\/09\/08\/chairmans-peter-tatarnikov-interview-on-binary-options-development\/"},"modified":"2014-09-08T00:00:00","modified_gmt":"2014-09-08T00:00:00","slug":"chairmans-peter-tatarnikov-interview-on-binary-options-development","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2014\/09\/08\/chairmans-peter-tatarnikov-interview-on-binary-options-development\/","title":{"rendered":"Chairman’s Peter Tatarnikov interview on Binary Options development","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Binary options can now be described as the most discussed financial product. Some call them &#8220;the new generation of forex&#8221;, others tell on the forums how they doubled their deposit in a couple of hours, and, the rest still do not understand what it is. By the way, the last group is shrinking in size &#8211; as in the last two years the interest in this topic has grown considerably. To date, there are tens of companies and technologies for the binary options trading &#8211; on the Russian market as well.<\/p>\n<p>Although the binary options are not so long ago on the market, there are already more questions about them than the facts. Many are interested in the problem industry regulation: who controls it all? Who will protect the capital of investors, and in general &#8211; their interests? It is clear that, if there are any problems &#8211; they seldom reach any international bodies. For this reason, of course, there is an urgent need for a regulatory body which is closer to an average trader: with transparent conditions and reliable documentation.<\/p>\n<p>The Financial Commission has started to provide such functions. It accepts the membership of the brokerage firms that meet all requirements and standards. In addition, their platform must be certified by the Commission. So that those traders who particularly care about the issue of control are encouraged to first pay attention to the &#8220;approved&#8221; companies, because deposits of their customers are protected by the Compensation Fund of the Financial Commission. This, I think you agree, means quite a lot.<\/p>\n<p>Another question is, of course, quotes. To what extent are they real? How do they correspond to reality? The fractions of price interest point, which in fact, affect the outcome of the transaction, give some room for maneuver on the part of the broker. Or is it not the case? Some brokers decide such problems in quite a simple way: they integrate the quotes from the MetaTrader4 terminal into the binary options platform. In fact, it is convenient: you can open your transactions in the foreign exchange market and in the binary options market simultaneously. You can do this either in the same direction in order to earn more, or in different directions to hedge you risk.<\/p>\n<p>As you understand, this is not all the issues that the industry has yet to decide. But one fact leaves no doubt: there is a future for the binary options &#8230; or is it not?<\/p>\n<p><strong><i>Chairman of the Financial Commission:<\/i><\/strong><\/p>\n<p><em><b>iLearney<\/b>: Peter, you&#8217;ve worked in the United States in the field of financial markets from 2005 to 2012 and you probably observed how binary options started to gain popularity in this period. Please tell us, how was it? How it became a notable process and whether binary options gained popularity immediately among the American traders?<\/em><\/p>\n<p><b>Peter Tatarnikov  (PT):<\/b> Alas, I can not tell much. Almost immediately after the appearance of this instrument on the United States market, binary options came under the regulation of the CFTC and the SEC, and as a result, ceased to exist in the form in which they are known by the rest of the world. The regulation came into force in 2008 and currently the &#8220;American binary options&#8221; are available in a few exchanges. However, as I said, they are very different from what we see through our web-platforms &#8211; at minimum, they are deprived of their simplicity. What was the result of the Americans, in my opinion, is too complicated for non-professional traders. It is for this reason that such product is not very popular in the United States.<\/p>\n<p><em><b>iLearney<\/b>: What regulation of the binary options industry currently exist in the world, and what &#8211; in Russia? What laws do you think we need?<\/em><\/p>\n<p><b>P.T.:<\/b> United States, Japan, England, Australia, Cyprus and the British Virgin Islands regulate the companies offering binary options to their customers. In any case, this product is still new, not only to traders, but also to the regulatory bodies. For example, in December of last year, the Japanese JFSA announced major changes in the existing regulation of binary options. These changes brought them closer to the standards of the United States, essentially, determining possible types of proposed contracts, and the terms of their acquisition.<\/p>\n<p>Thus, regulators are beginning to introduce the changes to the trading process, and despite the fact that they approach the problem from the point of view of protecting the interests of traders, unfortunately, the product does not always win from such changes.<\/p>\n<p>At the same time, in England, for example, binary options fall under the betting licensing. In fact, such trades are defined as betting transactions. But let us remember that the classic Forex trading not so long ago was also defined in the same manner. In Russia there is no regulation for the currency market, therefore, the laws for binary options do not exist as well. The Financial Commission, of course, has its own ideas on this subject, which are now being partially implemented. At the current stage, we do not adhere to the constraining strategy and do not interfere with the trading terms of member-companies. At the same time, we collect the statistics that will allow to offer the most effective model of regulation in the future.<\/p>\n<p><em><b>iLearney:<\/b> What issues are handled by the Financial Services Commission for the participants of the binary options market: traders, brokers, developers? To which countries, except Russia, do you extend your activity in this market segment?<\/em><\/p>\n<p><b>P.T.:<\/b> As an organization which is independent from countries and regulators, we offer our services to companies and clients on a global level. To date, we support seven languages. Recently, we have started accepting claims involving binary options, but only in respect to certified technologies. In other words, if the broker wants to become a member of the Financial Commission and to give its clients the possibility of alternative dispute resolution, the broker must first obtain a certificate for its trading platform. The fact is that new technologies are emerging almost every day, and we cannot know about the features of each of them. Accordingly, first of all, we must make sure that the Commission is able to obtain the necessary information at any time &#8211; to make a fair decision. The trading platforms certification affects such parameters as security, performance, available instruments, types of options, pricing, reporting, information storage, as well as the principle of transaction processing and system restoration in case of failures.<\/p>\n<p><em><b>iLearney<\/b>: Can a trader contact the Financial Commission if he is dissatisfied with his binary options broker? What kind of complaints you consider and how you can help?<\/em><\/p>\n<p><b>P.T.:<\/b> Yes, the Financial Commission accepts client complaints related to the trading process. For example, in cases when a binary option was incorrectly executed, was not executed at all or the client doubts the price at the time of execution. We specialize precisely<i> <\/i>in such matters. However, if the customer has other claims, we never leave them unattended. Our main task is to unite those companies which know that the proper conduct of business is of the greatest value and the key to a solid reputation in the industry.<\/p>\n<p><em><b> <\/b><b>iLearney:<\/b> Tell us about the compensation fund of the Financial Commission. To whom it applies and under what conditions?<\/em><\/p>\n<p><strong>P.T.<\/strong>: The Compensation Fund acts as an insurance policy for members’ clients. This fund is held in a separate bank account and is only used when a company refuses to adhere to the decision of the Financial Commission regarding the client’s claim. For example, if we decided in favor of a client in relation to a certain trade, but the broker refused to pay &#8211; the Compensation Fund is activated. It covers judgments up to $10,000 per client of an A-Category Member and up to $5,000 per client of a B-Category Member.<\/p>\n<p><em><b>iLearney<\/b>: You built your career on Forex. For you, as a practicing trader and consultant, what looks more promising and interesting: the familiar foreign exchange market, or the rapidly expanding binary options market?<\/em><\/p>\n<p><b>P.T.:<\/b> I will answer this way. Binary options will not replace the classic Forex-trading. However, this industry is growing every day. We could not leave it unattended and we want our expertise to help this industry to develop in the right way.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Binary options can now be described as the most discussed financial product. Some call them &#8220;the new generation of forex&#8221;, others tell on the forums how they doubled their deposit in a couple of hours, and, the rest still do not understand what it is. By the way, the last group is shrinking in size [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71646","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71646","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71646"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71646\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71646"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71646"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71646"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}