{"id":71642,"date":"2014-08-26T00:00:00","date_gmt":"2014-08-26T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2014\/08\/26\/stop-and-limit-orders-execution\/"},"modified":"2014-08-26T00:00:00","modified_gmt":"2014-08-26T00:00:00","slug":"stop-and-limit-orders-execution","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2014\/08\/26\/stop-and-limit-orders-execution\/","title":{"rendered":"Stop and Limit Orders Execution","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>Limit-Orders and Stop-Orders are some of the most basic forms of order types used by traders whether dealing in electronic markets trading via a platform, or submitting orders to a voice broker via telephone.<\/p>\n<p>The essence of Stop-orders and Limit-orders will be described here below, in addition to common best practices that should be followed in order to provide traders with fair dealing.<\/p>\n<p>However, because the rules governing how orders function from one broker to the next may vary, it is always critical to understand in detail how exactly orders function, including their limitations and various outcomes that can occur depending on market conditions &#8211; when placing stop and limit orders for example.<\/p>\n<p><b>Orders Can Vary Across Providers Yet Share Common Traits<\/b><\/p>\n<p>Generally a Limit-Order is an order to either buy or sell (not both) at a specific price or better, This implies that if the specific rate is reached, the trade must be executed at that rate as soon as it becomes available or at a more favorable rate (i.e. positive slippage) than the rate specified.<\/p>\n<p>A Stop Order on the other hand, functions similarly to a limit except that the executed rate may be less favorable (i.e. negative slippage) than the rate requested, although it could also be more favorable in certain conditions.<\/p>\n<p><b>Key Difference Between Stop and Limit Orders<\/b><\/p>\n<p>The key difference here between limits and stops is that a limit can be executed at the requested rate or better, whereas a stop can be at the requested rate or better or worse. Thus, in situations like these, stops can carry additional risks.<\/p>\n<p>This can apply to both stop orders to enter the market with a new position (i.e. entry orders), as well as stop-loss orders to close a position at a certain risk-threshold.<\/p>\n<p>Also for Limits, the rules generally speaking as to how they function may be similar across both Entry Limit orders (i.e. to enter the market with a new position) as well as for Limit Orders to take profit and close an order at a certain profit target.<\/p>\n<p><b>How Orders Can Function Depend on Their Specific Rules from the Broker<\/b><\/p>\n<p>Because all of these differences in order functions and the rules governing how they operate can vary from one broker to the next, as described above, in addition to other order types that may be offered, it is always key to understand the specific order characteristics that a particular broker provides. Extra caution should be taken on the language used as the same term can have different meanings across providers.<\/p>\n<p>In addition, even the most basic of orders, a “Market Order” which is an order to buy or sell at the current market rate, which may be executed at the next available price, may act like a Stop-Order or in essence become a Stop-Order where a trader may realize either positive or negative slippage. This is an example of why it’s important for traders to understand all orders types offered by their broker, and the underlying meaning of the terms used to describe how the orders function.<\/p>\n<p>The Financial Commission takes an approach of understanding how its members order types function and then is able to review execution reports to help ensure that orders functioned according to brokers’ own policies- when reviewing related trade-execution complaints or disputes about a specific order, or about how an order functioned during market conditions.<\/p>\n<p>For Example, when reviewing a complaint regarding a stop-order, the Financial Commission will review trade logs, rate logs, price history, tick data, execution reports, or other such data available provided by both customers and their broker, in order to ascertain whether or not there was any fault with how the order was handled.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Limit-Orders and Stop-Orders are some of the most basic forms of order types used by traders whether dealing in electronic markets trading via a platform, or submitting orders to a voice broker via telephone. The essence of Stop-orders and Limit-orders will be described here below, in addition to common best practices that should be followed [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[],"class_list":["post-71642","post","type-post","status-publish","format-standard","hentry","category-tips-for-all"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71642","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71642"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71642\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71642"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71642"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71642"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}