{"id":71656,"date":"2014-12-19T00:00:00","date_gmt":"2014-12-19T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2014\/12\/19\/what-are-binary-options\/"},"modified":"2014-12-19T00:00:00","modified_gmt":"2014-12-19T00:00:00","slug":"what-are-binary-options","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2014\/12\/19\/what-are-binary-options\/","title":{"rendered":"What are Binary Options?","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><strong>Binary Options Introduction<\/strong><\/p>\n<p>Binary Options are a type of investment instrument that can be traded electronically both over-the-counter (off-exchange) and on regulated exchanges (on-exchange), through online brokers.<\/p>\n<p>These contracts are an increasingly popular form of trading and provide investors and speculators (traders) the ability to have potential risk\/reward exposure to an underlying asset. This type of investment exposure includes certain unique characteristics with regards to time and other conditions, as will be explained below.<\/p>\n<p>While the regulatory status with regards to binary options varies per jurisdiction, the space is growing and evolving at a steady pace. The Financial Commission as part of its mission statement aims to provide traders with educational content to help better their understanding of this type of trading instrument. The next section will compare some differences within options.<\/p>\n<p><strong>Not all Options are Created Equal<\/strong><\/p>\n<p>Buying options typically conveys the right – but not the obligation – to buy or sell an underlying asset at a specified price, and which can be exercised within a certain duration of time (with key differences between how American and European style options can be exercised) until the expiration date is reached.<\/p>\n<p>Binary options share many similarities with traditional options, yet have many components that have been removed from the equation by incorporating pre-determined criteria into the process to simplify it.<\/p>\n<p>Therefore while trading stock options is often for more advanced traders and is more complex in nature, Binary Options offer an easy way for the  beginner trader to learn about speculating in the financial markets. At the same time there are still some key parallels with regards to options that every trader should know, such as the time component as will be detailed next.<\/p>\n<p><strong>All Options Have an Expiration Date<\/strong><\/p>\n<p>One common theme all options share is that they are a wasting asset. This means that they expire worthless if not exercised (and if they are not in-the-money or passed their break-even point), and are either cash-settled or deliver a multiplier of the underlying asset (i.e. 100 shares, etc&#8230;).<\/p>\n<p>In essence this time component means that the time value ticks away and degrades over time regardless of market conditions, and therefore choosing the right amount of time (duration until expiry) is an important element of timing an option trade correctly.<\/p>\n<p>For this reasons it’s crucial to understand the particular options contract specification, and how your broker processes any profits or break-even scenarios which may be either automatically paid out upon or before expiration and\/or whether the contracts can be manually exercised before or at expiration.<\/p>\n<p>With binary options this entire process is typically very simple (when compared to trading stock options) and can be clarified by your broker, but it’s a good ideas to see it in writing &#8211; normally in the account agreement or product listing under the contract\/instrument specifications so there is no uncertainty .<\/p>\n<p><strong>How are Binary Options Different?<\/strong><\/p>\n<p>Binary Options simplify the often complex dimensions of risk characteristics that traditional options trading carries, by creating only two possible outcomes – either a profit or a loss – hence the dualistic name “Binary” which has been appropriately designated to these option contracts (keep in mind that a third outcome is possible in some cases if a trade reaches a break-even outcome and there is neither a profit or loss.)<\/p>\n<p>This simplification enables traders of nearly all experience levels to understand the basics of binary options trading without having to learn the complexities of traditional options investing which can include premiums that change in value over time, time-value, and intrinsic and extrinsic value, as well as the historical and implied volatility of the underlying asset, all factors that can directly affect the options value over time.<\/p>\n<p>With Binary Options nearly all of those components are removed and the focus is entirely on the payoff and break-even price since this will enable a trader to gauge how much to risk based on the trade size and depending on their outlook of the underlying asset over time. Time is of course a key part as well, and typically is chosen based on the outlook of the investors, with regards to their view on the underlying assets.<\/p>\n<p><strong>What is the Payoff?<\/strong><\/p>\n<p>With binary options the return component is typically called the “pay-off” where the value can be either zero or positive, and both of which are known in advance. In essence the payoff is the result of the trade and depends on whether the binary option trade becomes in-the-money by surpassing its break-even price, and if not the cost of the investment is the loss generated on the trade.<\/p>\n<p>Therefore, a trader who establishes a bullish trade or “call” with a $50 payoff, can expect to make a $50 return if the price of the underlying asset increases over a specific rate &#8211; say for example $6.50 (for the price of an underlying stock), within a fixed period of time (i.e. 60 seconds, 60 minutes, 1 week, etc..) .<\/p>\n<p>In such a scenario there are two main outcomes: either both the $6.50 price is surpassed and the trade realizes a $50 profit on the $50 capital investment (100% return), or if the price is not reached &#8211; thus there is a $50 loss (100% loss).<\/p>\n<p>However, in some cases (varies per broker) if the call price of $6.50 is reached exactly and doesn’t increase any tick higher from that break-even point, then the cost of the trade is returned (i.e. the trader will receive his initial cost back and has a 0% gain or loss) where the trade is flat with a break-even return.<\/p>\n<p>Customer should fully understand the characteristics of binary options and the often unique features or policies that their brokerage may have with regards to how orders are handled, and how positions and options contracts function, including the various possible outcomes that can result from trading binary options.<\/p>\n<p>The Financial Commission aims to provide educational content to traders, such as the information above, to support a key part of our mission statement. For more information please contact us.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Binary Options Introduction Binary Options are a type of investment instrument that can be traded electronically both over-the-counter (off-exchange) and on regulated exchanges (on-exchange), through online brokers. These contracts are an increasingly popular form of trading and provide investors and speculators (traders) the ability to have potential risk\/reward exposure to an underlying asset. This type of investment [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[],"class_list":["post-71656","post","type-post","status-publish","format-standard","hentry","category-tips-for-all"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71656","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71656"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71656\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71656"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71656"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71656"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}