{"id":71673,"date":"2015-12-30T00:00:00","date_gmt":"2015-12-30T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2015\/12\/30\/financial-commission-announces-%d0%b5qmarkets-as-latest-member\/"},"modified":"2015-12-30T00:00:00","modified_gmt":"2015-12-30T00:00:00","slug":"financial-commission-announces-%d0%b5qmarkets-as-latest-member","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2015\/12\/30\/financial-commission-announces-%d0%b5qmarkets-as-latest-member\/","title":{"rendered":"Financial Commission Announces ЕQMarkets as Latest Member","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><b>December 30th, 2015 Hong Kong &amp; New York<\/b> – For Immediate Release: The Financial Commission (financialcommission.org) announces its newest member firm <a href=\"http:\/\/www.eqmarkets.com\/\" target=\"_blank\" rel=\"noopener\">www.ЕQMarkets.com<\/a> , operated by Infinity Trade LTD.<\/p>\n<p>As a neutral mediator serving the online foreign exchange and binary options industry and operated by Hong Kong based FinaCom PLC, the Financial Commission board approved the membership application for ЕQMarkets. Joining the Financial Commission provides ЕQMarkets a value-added service to its members with an objective and cost-effective dispute resolution process that is independent of any broker and regulatory organization.<\/p>\n<p>Peter Tatarnikov, Chairman of the Financial Commission said regarding the announcement, “We are glad to welcome ЕQMarkets as our latest member and happy to see more brokers joining as the value of what we do plays a key role for broker’s client relationships. I’m sure that this is a positive step for ЕQMarkets business.”<\/p>\n<p>ЕQMarkets Head of Public Relations Alexander Pashkovski commented, “We reviewed the Financial Commissions value proposition and felt it was aligned with our commitment to best serve customers. We believe having such an option is an integral part of complementing an already successful customer support and relationship management process, when dealing with a large number of traders in markets such as foreign exchange.”<\/p>\n<p>ЕQMarkets joins a growing list of members who have joined Financial Commission to provide their end-customers with a neutral 3rd party mediator to help resolve complaints in cases of disputes where customers are unable to come to an agreement with their broker.<\/p>\n<table border=\"0\">\n<tbody>\n<tr>\n<td><a href=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/eq.jpg\"><img decoding=\"async\" class=\"alignleft  wp-image-31485\" alt=\"eq\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/eq-300x116.jpg\" width=\"210\" height=\"81\" \/><\/a><\/td>\n<td>ЕQMarkets (Infinity Trade LTD) registered office is located in Saint Vincent and the Grenadines. According to the company’s website, the firm offers more than 200 currency pairs to traders and accounts denominated in multiple currencies, as well as a copy trading and social trading feature.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><b><i>About Financial Commission:<\/i><\/b><\/p>\n<p>The Financial Commission is an industry-specific dispute resolution service, and supported by an experienced Dispute Resolution Committee comprised of recognized forex industry professionals. The organization was established to be a neutral 3rd party committee to fairly review and resolve complaints in an effort to facilitate a simpler and swifter resolution than through industry regulators and the legal system. As an external dispute resolution (EDR) organization for consumers and traders who are unable to resolve disputes directly with their financial services providers, the Financial Commission provides its services to clients of brokerages that are members of the Financial Commission. The Financial Commission set out to provide a new approach for traders and brokers alike to resolve any issues that arises in the course of trading the Forex market.<\/p>\n<p>For more information, please contact The Financial Commission: info@financialcommission.org<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>December 30th, 2015 Hong Kong &amp; New York – For Immediate Release: The Financial Commission (financialcommission.org) announces its newest member firm www.ЕQMarkets.com , operated by Infinity Trade LTD. As a neutral mediator serving the online foreign exchange and binary options industry and operated by Hong Kong based FinaCom PLC, the Financial Commission board approved the [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71673","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71673","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71673"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71673\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}