{"id":71683,"date":"2016-04-21T00:00:00","date_gmt":"2016-04-21T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/04\/21\/financial-commission-announces-starfishfx-as-latest-member-firm\/"},"modified":"2016-04-21T00:00:00","modified_gmt":"2016-04-21T00:00:00","slug":"financial-commission-announces-starfishfx-as-latest-member-firm","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/04\/21\/financial-commission-announces-starfishfx-as-latest-member-firm\/","title":{"rendered":"Financial Commission Announces StarfishFX as Latest Member Firm","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>21 April 2016 – Hong Kong &amp; New York: FinaCom PLC, operator of FinancialCommission.org, a neutral mediator serving the online foreign exchange and binary options industry, announces today its newest member firm Starfish Markets Limited (<a href=\"https:\/\/starfishfx.com\" target=\"_blank\" rel=\"noopener\">Starfish FX<\/a>).<\/p>\n<table border=\"0\">\n<tbody>\n<tr>\n<td><a href=\"https:\/\/starfishfx.com\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" width=\"200\" height=\"70\" class=\"alignleft  wp-image-32484\" alt=\"starfishfx-logo\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/starfishfx-logo.png\" \/><\/a><\/td>\n<td>\n<p style=\"padding-left: 30px;\">Starfish FX is managed by Starfish Markets Ltd. &#8211; an online brokerage firm that provides FX, CFD and Binary options trading,with its main office in New Zealand and licensed under the laws of Vanuatu.<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>It is the latest member to engage the services of the Financial Commission to provide its customers with a neutral 3rd party mediator to help resolve complaints in cases of disputes where customers are unable to come to an agreement with their broker.<\/p>\n<p>Following the approval of its application by the FinaCom PLC’s board, Starfish FX’s status as an official member of the Financial Commission took effect on April 19th, 2016.<\/p>\n<p>Financial Commission Chairman Peter Tatarnikov commented,<em> “We are proud to welcome Starfish FX as our newest member and glad to see more brokers joining the Financial Commission. In addition to obtaining any existing regulatory licenses, it has become increasingly important for providers to demonstrate their participation with industry associations and commitment to self-regulatory efforts, such as by becoming a member of the Financial Commission.”<\/em><\/p>\n<p>StarfishFX Chief Marketing Officer Michael Townsend commented,<em> “We offer a number of products that we want to continue to build clients’ trust around and we believe that by joining the Financial Commission, we show customers our level of commitment in helping to ensure they receive fair treatment from us by having a third-party that they can go to if any disputes arise that we are unable to resolve.”<\/em><\/p>\n<p>Mr. Townsend added, <em>“As people explore foreign exchange trading for the first time, we believe that providing them with additional options and education can only be a benefit, and we believe this step we have undertaken helps meet that objective in addition to what we have already established internally at StarfishFX.”<\/em><\/p>\n<h3><strong>About Starfish FX <\/strong><\/h3>\n<p>Starfish Markets Limited is a large player in Asia’s FX market formed by a group of experienced and established finance professionals. Having received multiple global awards and accolades, the company specializes in forex and binary options trading and has a strong commitment to maintaining a long-term relationship with their clients. Starfish FX has established multiple service centers in many countries while increasing their exposure in fast developing Asian regions.<\/p>\n<h3><strong>About The Financial Commission<\/strong><\/h3>\n<p>The Financial Commission is an external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes with financial services providers that are members of the Financial Commission. The Financial Commission set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading the Forex market. The Financial Commission was established to be a neutral 3rd party committee to fairly review and resolve complaints in an effort to facilitate a simpler, swifter resolution than through industry regulators and the legal system.<\/p>\n<p>For more information please contact us at <span style=\"text-decoration: underline; color: #3366ff;\">info@financialcommission.org<\/span><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>21 April 2016 – Hong Kong &amp; New York: FinaCom PLC, operator of FinancialCommission.org, a neutral mediator serving the online foreign exchange and binary options industry, announces today its newest member firm Starfish Markets Limited (Starfish FX). Starfish FX is managed by Starfish Markets Ltd. &#8211; an online brokerage firm that provides FX, CFD and [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71683","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71683","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71683"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71683\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71683"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71683"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71683"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}