{"id":71684,"date":"2016-04-21T00:00:00","date_gmt":"2016-04-21T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/04\/21\/fair-dealing-in-forex-from-myth-to-reality\/"},"modified":"2016-04-21T00:00:00","modified_gmt":"2016-04-21T00:00:00","slug":"fair-dealing-in-forex-from-myth-to-reality","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/04\/21\/fair-dealing-in-forex-from-myth-to-reality\/","title":{"rendered":"Fair Dealing in Forex: From Myth to Reality","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p dir=\"ltr\">In recent years, such aspects as financial market manipulation and fair-dealing have come under scrutiny of state regulators, as well as high-frequency trading (HFT) was blamed for providing an unfair playing field despite existing best-execution regulations in place in the U.S. and Europe<\/p>\n<p dir=\"ltr\">As technology and financial markets evolve, along with regulatory guidelines, the need for high standards of best execution of orders on decentralized markets such as Foreign Exchange (Forex) has become even more significant thus, the Financial Commission highlights some approaches to this challenge across Forex market.<\/p>\n<p dir=\"ltr\"><strong>Exchange versus off-exchange<\/strong><\/p>\n<p dir=\"ltr\">Unlike an exchange, where a centralized order book or bid\/ask process is standardized for price discovery, in the over-the-counter (OTC) foreign exchange (forex) market, dealers make markets independently and pull prices from various sources.<\/p>\n<p dir=\"ltr\"><strong>Policy of Best Execution<\/strong><\/p>\n<p dir=\"ltr\">There are several best execution policies exists in our days, for example, in the U.S. Stock Markets there is a National Best-bid Best-offer (NBBO) policy, while Europe has its own best execution within Markets in Financial Instruments Directive (MiFID). These policies are the main components in the financial services regulation and are designed to ensure the protection of investors, pricing transparency and healthy competition among trading floors in a growing number of fragmented markets.<\/p>\n<p dir=\"ltr\"><strong>General idea of the Best Execution policy<\/strong><\/p>\n<p dir=\"ltr\">Best execution purports that each company is required to take all reasonable measures to achieve the best possible result for the client, taking into account the entire range of factors affecting the execution of orders while carrying them out for transactions with financial instruments on client&#8217;s behalf. The Company is obliged to act as much as possible in the interests of the client when receiving and transmitting client&#8217;s orders for execution to other companies.<\/p>\n<p dir=\"ltr\"><strong>Nature of FX Markets<\/strong><\/p>\n<p dir=\"ltr\">In the US, the best execution policy does not extend its effect on the Forex market, though Europe&#8217;s MiFID directive requires uniform application of best execution policy to all markets. In reality, the decentralized nature of forex market makes this task difficult to implement and leads to a systematic misunderstanding between dealers and regulators.<\/p>\n<p dir=\"ltr\">However, in the cases when market maker is a bank, investment company or the dealer himself, companies tend to quote a client as close as possible to the current interbank market rates while executing orders. Thus, they remain competitive, including any spreads, which are added as a commission.<\/p>\n<p dir=\"ltr\">This situation occurs because there is no centralized single price that represents the true market, at any given moment. Consequently, a blend of some of the leading prices is typically used as an indicator to see where the majority of the interbank dealers are trading. Thanks to evolving technology the degree of difference across major providers is extremely small, what indicates the high efficiency of the existing market.<\/p>\n<p dir=\"ltr\"><strong>Price Origination<\/strong><\/p>\n<p dir=\"ltr\">Prices may be originating on platforms like EBS, Reuters, and other interdealer matching systems, where banks and counterparties can trade with each other. Prices from sources like these are nearly instantly disseminated across the entire collective forex market through other intermediaries and price data providers, and reaches brokerages and other companies that use real-time fx data for their business.<\/p>\n<p dir=\"ltr\"><strong>What is a fair dealing in Forex?<\/strong><\/p>\n<p dir=\"ltr\">Fair dealing in forex means that when a price is offered and available to a broker it is shown to the broker’s client without any additional changes \/ interventions (except spread and commissions), regardless of counterparty and the client&#8217;s current position.<\/p>\n<p dir=\"ltr\">The idea of best execution applies the concept of «legitimate reliance». This concept is applicable to non-professional (retail) customers. Ie there is a rule which obliges the company to act as much as possible on behalf of the client, but the client does not control the process of execution and forced to rely on the company.<\/p>\n<p dir=\"ltr\">In most cases, companies are taking orders from their clients and executing them with third parties (exchanges, dealers and other counterparties), in such case, the company always acts on behalf of the client and, in turn, the client has a «legitimate reliance» that the company acts in his best interests.<\/p>\n<p dir=\"ltr\">However, even in a situation where the company acts as a counterparty in transactions, it still can act in the client&#8217;s interests and comply with the rule of the best execution, despite the fact that in such cases the client does not have «legitimate reliance».<\/p>\n<p dir=\"ltr\">For instance, a client has the best price in the platform which was displayed by some market-maker, the client received a price and made the transaction, however, the execution was not carried out by that particular market-maker.<\/p>\n<p dir=\"ltr\"><strong>What is unfair dealing in Forex?<\/strong><\/p>\n<p dir=\"ltr\">US and European regulators have given particular attention to how the work should be carried out with the price slippage (the difference between the price specified in the order and the execution price), as companies were carryin out unbalanced \/ unfair trade at a time of heightened market volatility when the price was changing intensively. In particular, regulators were categorically unsatisfied that the companies wanted to &#8220;cash in&#8221; on the client at the time of price slippage. It is a situation when the price moves against the client in the period of time between placing the order and its execution.<\/p>\n<p dir=\"ltr\">In order to prevent such practices, regulators have introduced a rule requiring dealers to use identical parameters for possible slippage of prices regardless of market direction. The requotes, if applicable, must be carried out both, when the price moves against the client and in favor of the client.<\/p>\n<p dir=\"ltr\">It is also important that the company should have evidence that the slippage was caused by external factors (market data latency, client&#8217;s  Internet connection speed, excessive volatility of the market, etc.), but not artificially produced by the company.<\/p>\n<p dir=\"ltr\">Unfortunatelly, despite the constant work of regulators to protect private investors and ensure fair trading, the nature of the forex market makes its own reality. This is a very tech and fast-paced market. Regulation always catches up with innovations. Earlier, talking about forex trading we meant seconds and pips, but today it is a milliseconds and fractional pricing pips.<\/p>\n<p dir=\"ltr\">There is still no unified approach from regulators that helps resolve matters regarding fair dealing, that isn’t either overly cumbersome for clients and\/or brokers, and still fails to ensure that all brokers are always executing client orders fairly.<\/p>\n<p dir=\"ltr\"><strong>More than just best execution<\/strong><\/p>\n<p dir=\"ltr\">The Financial Commission has considerable expertise, having dealt with a large number of related complaints, and by understanding the nature of the FX markets, and how brokers operate, we are able to process related complaints very efficiently for brokers and their clients.<\/p>\n<p dir=\"ltr\">There are many issues which resolution requires not only compliance with the best execution policy, but compliance with the highest standards and best practices of the industry. However, all of this is possible when the broker voluntarily seeks to adhere to the highest ethical standards so clients can rely on fair pricing and orders execution.<\/p>\n<p dir=\"ltr\"><strong>Effective complaints resolving<\/strong><\/p>\n<p dir=\"ltr\">In the case of a client complaint over trade execution, Financial Commission takes a systematic approach starting with analysis of the market situation and the asset price behavior at the time of the incident. This is the very first step which helps to carefully evaluate all of the factors that could affect the deterioration of trading conditions (widening of spreads, delay in the orders execution, price slippage etc.) at the time of the transaction. The second stage involves the study of the Client Agreement terms and conditions, which forms the basis of the relationships between the client and the broker.<\/p>\n<p dir=\"ltr\"><strong>Discovery and Ruling<\/strong><\/p>\n<p dir=\"ltr\">The next step is investigation of the evidences provided by the parties and the analysis of the price at which the transaction was executed. The Commission necessarily requesting the data from price providers, which were used by  the dealer, as well as runs a comparative analysis of the leading market makers on the forex market in order to have a common vision of fair market price of the asset at the time of the incident.<\/p>\n<p dir=\"ltr\">The fourth stage includes the analysis of historical data of the system, namely, at what time and what price has been put into the platform, what price was given to the client, when the order was sent, when it was executed and at what price.<\/p>\n<p dir=\"ltr\">Finally, the case is then reviewed by the Financial Commission’s Dispute Resolution Committee (DRC) where further consideration is made and final decision is taken in order to indicate the guilty party and the measure of its responsibility.<\/p>\n<p dir=\"ltr\"> <span style=\"line-height: 1.5em;\">To learn more about membership benefits of joining the Financial Commission, contact a representative today or visit <\/span><a style=\"line-height: 1.5em;\" href=\"http:\/\/xcv.financialcommission.org\">financialcommission.org<\/a><span style=\"line-height: 1.5em;\">.<\/span><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>In recent years, such aspects as financial market manipulation and fair-dealing have come under scrutiny of state regulators, as well as high-frequency trading (HFT) was blamed for providing an unfair playing field despite existing best-execution regulations in place in the U.S. and Europe As technology and financial markets evolve, along with regulatory guidelines, the need [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[],"class_list":["post-71684","post","type-post","status-publish","format-standard","hentry","category-tips-for-all"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71684","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71684"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71684\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71684"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71684"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71684"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}