{"id":71693,"date":"2016-07-28T00:00:00","date_gmt":"2016-07-28T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/07\/28\/informational-newsletter-july-2016\/"},"modified":"2016-07-28T00:00:00","modified_gmt":"2016-07-28T00:00:00","slug":"informational-newsletter-july-2016","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/07\/28\/informational-newsletter-july-2016\/","title":{"rendered":"Informational Newsletter July 2016","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p dir=\"ltr\">July 28th, 2016, Hong Kong &amp; New York: Financial Commission is pleased to announce the launch of Informational Newsletters that will assist traders in understanding trends and challenges related to foreign exchange disputes.<\/p>\n<p dir=\"ltr\">As a result of the growing number of companies within our organization, and as the underlying number of traders protected directly by the Financial Commission continues to rise, the newsletters will provide traders unique insight about brokerage complaints &#8211; to help traders be better-informed when considering where to trade.<\/p>\n<p dir=\"ltr\">The Informational Newsletters will be posted on a new section on FinancialCommission.org and will highlight forex industry issues and trends identified by the Commission during the examination of claims &#8211; including any fraudulent activity of unscrupulous market participants, in addition to other industry trends that will be shared in the updates.<\/p>\n<p dir=\"ltr\"><strong><span style=\"font-size: medium;\">External dispute resolution trends<\/span><\/strong><\/p>\n<p dir=\"ltr\">By informing traders of challenges that exist within the industry, and helping inform the public on how complaints are handled via an External Dispute Resolution (EDR) process, Financial Commission continues to strive towards its goal to educate clients.<\/p>\n<p dir=\"ltr\">In addition, Financial Commission will be sharing complaint data received about non-member firms, highlighting the interest that traders have in attempting to resolve complaints via a 3rd party EDR &#8211; even when their broker is not currently a member.<\/p>\n<p dir=\"ltr\">The timing of this launch follows shortly after the recent Global Code of Conduct issued by the Bank for International Settlements (BIS) which aims to provide a basis for best practices in global FX markets.<\/p>\n<p dir=\"ltr\"><strong><span style=\"font-size: medium;\">Binary Options Complaints<\/span><\/strong><\/p>\n<p dir=\"ltr\">Among the Members of the Financial Commission there are more and more companies offering binary options trading and an increasing amount of claims are connected with these products. It is obvious that Binary Options trading is becoming increasingly popular and attracts many inexperienced traders, yet the escalating number of complaints is intelligible.<\/p>\n<p dir=\"ltr\"><strong><span style=\"font-size: medium;\">Violation of payment processing regulations<\/span><\/strong><\/p>\n<p dir=\"ltr\">Financial Commission has also observed a slight increase in the amount of complaints related to customers payment processing requests that exceeded the regulations time-limits. Almost every complaint was connected with a refund directly to a client&#8217;s bankcard. This withdrawal method has become increasingly popular in recent years, however, sometimes such payments are processed longer than bank transfer since they depend on a chain of intermediaries. All such complaints were upheld by member firms within 1-3 days, reflecting benefits from the Commission&#8217;s members.<\/p>\n<p dir=\"ltr\"><strong><span style=\"font-size: medium;\">Nonpayment of funds.<\/span><\/strong><\/p>\n<p dir=\"ltr\">An increase in complaints from traders regarding nonpayment of funds by brokerage companies that are nonmembers of the Financial Commission was also observed. Unfortunately, these traders are not under the direct protection of Financial Commission, and its resources are limited in this connection, yet it is important for the public to be aware of such claims.<\/p>\n<p dir=\"ltr\">We once again urge clients to work with companies that are members of our organization, as well as take advantage of our advice on selecting companies that we <a href=\"http:\/\/xcv.financialcommission.org\/2014\/11\/12\/how-to-choose-a-broker\/\">cited earlier<\/a>, in order to have the related potential benefits of Financial Commission membership.<\/p>\n<p dir=\"ltr\"><strong><span style=\"font-size: medium;\">Fraudulent activity of unscrupulous brokers and asset managers in the field of asset management.<\/span><\/strong><\/p>\n<p dir=\"ltr\">We also observed an alarming trend worsen, as numerous complaints were received of unfair brokerage firms operating in the field of investment and asset management over the last six months.<\/p>\n<p dir=\"ltr\">In the modern world of investment consulting, services such as wealth and portfolio management as well as trading and investment advisory services are very common. However,  distinguishing between legitimate professional management firms and from among the many non-professional deceitful entities &#8211; especially in markets where such services are not regulated, remains a challenge for both investors and traders.<\/p>\n<p dir=\"ltr\">First of all, firms that guarantee clients extraordinary profits without any risks should be the first red flag to look for when evaluating an opportunity.<\/p>\n<p dir=\"ltr\">For example, a client may be offered to invest and use instructions (trading signals) of &#8220;professional&#8221; analyst who in most cases has nothing to do with the broker itself. As a result, under the mentor guidance the client opens several large transactions which can instantly zero out the trading account. In this case mentor offers to replenish your account in order to recover the loss and the same story happens again after a subsequent deposit is made.<\/p>\n<p dir=\"ltr\"><strong><span style=\"font-size: medium;\">Avoid non-market losses that result from scams by avoiding their initial bait:<\/span><\/strong><\/p>\n<p dir=\"ltr\">Financial Commission has prepared some recommendations in this regard:<\/p>\n<p dir=\"ltr\">1. Before you open a trading account, check whether the broker is a member of the Financial Commission.<\/p>\n<p dir=\"ltr\">2. Examine clients comments through the internet about brokers (forums, ratings, media) yet keep in mind not all comments reflect fully factual statements as some feedback reflects clients perceptions or wishes yet reviews can provide clients with a wider view.<\/p>\n<p dir=\"ltr\">3. Examine the contract and client agreement when opening the account, and read all the fine print to understand the legal aspects of your relationship with each broker.<\/p>\n<p dir=\"ltr\">4. In case of dealing with an asset manager, do not forget to conclude an additional agreement (that provides trading authorization) that contains the trading strategy, specifies the maximum risks and responsibilities of the parties, and provide it to the broker and\/or make sure they permit such activity. Beforehand, be sure to become familiar with the fund manager and its trading operations and history (track-record).<\/p>\n<p dir=\"ltr\">5. Always remember that active trading is a high risk activity and each individual&#8217;s personal suitability should be taken into account in terms of whether such risk is suitable, before deciding to invest. We strongly recommend that traders constantly improve their knowledge in this area in order to make the right decisions both in trading and <a href=\"http:\/\/xcv.financialcommission.org\/members\/participating-members-of-the-financial-commission\/\">choice of partners.<\/a><\/p>\n<p dir=\"ltr\"><strong><span style=\"font-size: medium;\">List of nonmember companies against which complaints have been received.<\/span><\/strong><\/p>\n<div dir=\"ltr\">\n<table>\n<colgroup>\n<col width=\"*\" \/>\n<col width=\"*\" \/><\/colgroup>\n<tbody>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">Company<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Complaint description<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">Fort Financial Services<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Profit annulment<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">GAINSY<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Trading advising and forex investment proposals,<\/p>\n<p dir=\"ltr\">  falsification of known analysts names<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">MXTrade<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Nonpayment of funds<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">MyBoption<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Nonpayment of funds<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">Pegase Capital Ltd<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Nonpayment of funds<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">SunbirdFX<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Nonpayment of funds<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">PLUS500<\/p>\n<\/td>\n<td style=\"border: 1px solid #000000;\">\n<p dir=\"ltr\">  Nonpayment of funds<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<\/div>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>July 28th, 2016, Hong Kong &amp; New York: Financial Commission is pleased to announce the launch of Informational Newsletters that will assist traders in understanding trends and challenges related to foreign exchange disputes. As a result of the growing number of companies within our organization, and as the underlying number of traders protected directly by [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[],"class_list":["post-71693","post","type-post","status-publish","format-standard","hentry","category-tips-for-all"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71693","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71693"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71693\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71693"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71693"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71693"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}