{"id":71706,"date":"2016-11-01T00:00:00","date_gmt":"2016-11-01T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/11\/01\/financial-commission-announces-axiory-global-as-latest-approved-member\/"},"modified":"2016-11-01T00:00:00","modified_gmt":"2016-11-01T00:00:00","slug":"financial-commission-announces-axiory-global-as-latest-approved-member","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/11\/01\/financial-commission-announces-axiory-global-as-latest-approved-member\/","title":{"rendered":"Financial Commission Announces Axiory Global as Latest Approved Member","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"font-weight: 400;\">November 1, 2016 – Hong Kong &amp; New York: Leading external dispute resolution (EDR) organization, Financial Commission, catering to the financial services industry and operated by FinaCom PLC, today announces Axiory Global as its newest approved member.  <\/span><\/p>\n<table>\n<tbody>\n<tr>\n<td><a href=\"http:\/\/www.axiory.com\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignleft wp-image-34243\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/Axiory_logo-300x44.png\" alt=\"axiory_logo\" width=\"187\" height=\"28\" \/><\/a><\/td>\n<td style=\"padding-left: 30px;\"><a href=\"http:\/\/www.axiory.com\" target=\"_blank\" rel=\"noopener\">Axiory Global’s<\/a> status as a member of the Financial Commission took effect on November 1, 2016, following the approval of its membership application by FinaCom PLC’s board, thus allowing the company and its customers to be entitled to related membership benefits.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Financial Commission provides brokerages and their customers with an unbiased 3rd party mediation platform that helps resolve complaints in instances when parties are unable to directly come to an agreement over disputes. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For approved members and their clients participating in CFDs, binary options and foreign exchange (forex) markets, Financial Commission helps facilitate a simpler, swifter resolution process than through typical regulatory channels such as arbitration or local court systems. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Axiory Global joins a diverse range of brokerages and independent services providers (ISPs) that utilize the services of the Financial Commission and as part of their commitment to their clients while upholding membership requirements. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Financial Commission Chairman, Peter Tatarnikov said, “We are proud to welcome Axiory Global as our latest approved member and the most recent brokerage to join the Financial Commission. Our ongoing membership growth reflects the importance of efficient dispute resolution, and companies and their clients value when it’s provided by a neutral 3rd party. Financial Commission provides an unmatched dispute resolution process which is now extended to our newest member Axiory Global.” <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Representatives of Axiory Global commented, “Axiory Global&#8217;s long-term goal is to continue providing highly transparent services, along with striving to develop user-friendly tools that respond to customer demands. Therefore Axiory Global has formed a partnership with The Financial Commission &#8211; the first, neutral, third party Dispute Resolution Organization that is dedicated specifically to Forex industry. The Financial Commission is a professional organization that operates in a way where transparency, swiftness, and education are the paramount values.” They also noted, “By being a Financial Commission members, we in Axiory Global ensures that traders and our client get their disputes resolved in a quick and efficient manner. Our company will always meet the needs of its customers, as well as work on the development of user-friendly tools. We are happy to announce the partnership with The Financial Commission and provide worldwide transparent and honest services.”<\/span><\/p>\n<p><b>About Axiory Global<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Axiory Global Ltd is an FX brokerage approved, authorised and regulated by the IFSC (International Financial Services Commission) as an international financial brokerage in Belize with main aim to provide high customer profits and convenience. Axiory Global provides trading on Forex and CFDs on indices, metals and commodities, via its MetaTrader4 (MT4) platform offering, and offers strategies via its MultiTrader offering within the MyAxiory Global client portal. More information about the company’s products and services can be found on <\/span><a href=\"http:\/\/www.axiory.com\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">www.axiory.com<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><b>About Financial Commission<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Financial Commission is an independent external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes directly with their financial services providers that are members of the Financial Commission.Financial Commission initially set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading electronic markets such Foreign Exchange, and then expanded into CFDs, Binary Options and related derivatives, in addition to certifying technology platforms used for trading. For more information please contact us at info@financialcommission.<\/span><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>November 1, 2016 – Hong Kong &amp; New York: Leading external dispute resolution (EDR) organization, Financial Commission, catering to the financial services industry and operated by FinaCom PLC, today announces Axiory Global as its newest approved member.   Axiory Global’s status as a member of the Financial Commission took effect on November 1, 2016, following [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71706","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71706","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71706"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71706\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71706"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71706"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71706"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}