{"id":71702,"date":"2016-09-27T00:00:00","date_gmt":"2016-09-27T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/09\/27\/financial-commission-announces-dls-as-latest-approved-member\/"},"modified":"2016-09-27T00:00:00","modified_gmt":"2016-09-27T00:00:00","slug":"financial-commission-announces-dls-as-latest-approved-member","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/09\/27\/financial-commission-announces-dls-as-latest-approved-member\/","title":{"rendered":"Financial Commission Announces DLS as Latest Approved Member","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>September 27, 2016 – Hong Kong &amp; New York: Financial Commission, a leading external dispute resolution (EDR) organization, operated by FinaCom PLC, catering to the financial services industry, today announces <a href=\"http:\/\/www.dls-fx.com\/en\/\" target=\"_blank\" rel=\"noopener\">DLS<\/a> as its newest approved member.<\/p>\n<p>Following the approval of its membership application by FinaCom PLC’s board, DLS’ status as a category A member of the Financial Commission took effect on September 23<sup>rd<\/sup> 2016, and its customers have since been entitled to related membership benefits.<\/p>\n<p>DLS joins a diverse range of brokerages and independent services providers (ISPs) that have sought the services of the Financial Commission, as part of their commitment to their clients, and to upholding membership requirements.<\/p>\n<p>Managed by Dragon Leader Services Ltd, DLS is an online broker that offers forex and binary options on foreign exchange (Forex) and commodities through its MetaTrader 4 (MT4) platform offering. The company main office is based in Australia, and holds a principal’s license in the Republic of Vanuatu.<\/p>\n<p>Financial Commission provides brokerages and their customers with an unbiased 3rd party mediation platform that helps resolve complaints in instances when parties are unable to directly come to an agreement over disputes.<\/p>\n<p>For approved members and their clients, Financial Commission helps facilitate a simpler, swifter resolution process than through typical regulatory channels including arbitration and legal court systems, for the markets that it specializes in.<\/p>\n<p>Financial Commission Chairman Peter Tatarnikov commented,<i> “We are proud to welcome DLS as our newest member and pleased to see new brokers continuing to join the Financial Commission. When firms become members of Financial Commission they demonstrate their commitment to self-regulatory efforts and participation with industry associations, in addition to any regulatory statuses they may have obtained. We are happy to welcome DLS to our organization today as a category A member and believe it will help the firm and their clients as the company continues to expand.”<\/i><i><\/i><\/p>\n<p><b>About DLS<\/b><\/p>\n<table border=\"0\">\n<tbody>\n<tr>\n<td><a href=\"http:\/\/www.dls-fx.com\/en\/\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignleft size-full wp-image-33838\" alt=\"dls-logo-152x140\" src=\"http:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2016\/09\/dls-logo-152x140.png\" width=\"152\" height=\"140\" \/><\/a><\/td>\n<td>\n<p style=\"padding-left: 30px;\">Dragon Leader Services Ltd, which operates DLS is one of the fastest emerging player in Asia’s Forex and Binary Options market. It is formed by a group of experienced and established finance professionals who specializes in forex and binary options trading and has a strong commitment to maintaining a long-term relationship with their clients.<\/p>\n<p style=\"padding-left: 30px;\">DLS seeks to increase its exposure in the fast developing Asian regions by establishing multiple service centers across the Asia Pacific Region in the coming years ahead.<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p><b>About Financial Commission<\/b><\/p>\n<p>Financial Commission is an independent external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes directly with their financial services providers that are members of the Financial Commission.<\/p>\n<p>Financial Commission initially set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading electronic markets such Foreign Exchange, and then expanded into CFDs, Binary Options and related derivatives, in addition to certifying technology platforms used for trading. For more information please contact us at <a href=\"mailto:info@financialcommission.org\">info@financialcommission.org<\/a><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>September 27, 2016 – Hong Kong &amp; New York: Financial Commission, a leading external dispute resolution (EDR) organization, operated by FinaCom PLC, catering to the financial services industry, today announces DLS as its newest approved member. Following the approval of its membership application by FinaCom PLC’s board, DLS’ status as a category A member of [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71702","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71702","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71702"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71702\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71702"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71702"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71702"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}