{"id":71700,"date":"2016-09-13T00:00:00","date_gmt":"2016-09-13T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/09\/13\/financial-commission-announces-juno-markets-as-latest-approved-member\/"},"modified":"2016-09-13T00:00:00","modified_gmt":"2016-09-13T00:00:00","slug":"financial-commission-announces-juno-markets-as-latest-approved-member","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/09\/13\/financial-commission-announces-juno-markets-as-latest-approved-member\/","title":{"rendered":"Financial Commission Announces Juno Markets as Latest Approved Member","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p dir=\"ltr\">September 13th, 2016 – Hong Kong &amp; New York: Leading external dispute resolution (EDR) organization, Financial Commission, catering to the financial services industry and operated by FinaCom PLC, today announces <a href=\"https:\/\/www.junomarkets.com\/en\/\" target=\"_blank\" rel=\"noopener\">Juno Markets<\/a> as its newest member.<\/p>\n<p dir=\"ltr\">Juno Markets’ status as an official member of the Financial Commission took effect on September 8th, 2016, after the approval of its application by FinaCom PLC’s board which has since enabled Juno Markets and its customers to be afforded related membership benefits.<\/p>\n<p dir=\"ltr\">Financial Commission provides brokerages and their customers with a neutral 3rd party mediation platform to help resolve complaints in cases when parties are unable to directly come to an agreement together over disputes.<\/p>\n<p dir=\"ltr\">Juno Markets, based in Asia, is latest firm to seek the services of the Financial Commission, and joins a diverse range of existing online brokerages and independent services providers (ISPs) that are currently approved as members.<\/p>\n<p dir=\"ltr\">For approved members and their clients, Financial Commission helps facilitate a simpler, swifter resolution process than through typical regulatory channels including arbitration and legal court systems, for the markets that we specialize in.<\/p>\n<p dir=\"ltr\">Financial Commission Chairman Peter Tatarnikov commented, “<em>We are proud to welcome Juno Markets as our newest member and glad to see more brokers joining the Financial Commission. In addition to obtaining any existing regulatory licenses, it has become increasingly important for providers to demonstrate their participation with industry associations and commitment to self-regulatory efforts, such as by becoming a member of the Financial Commission. Today we gladly welcome Juno Markets Limited to our organization and believe it is a great step to leverage its credibility and grow its business globally<\/em>.”<\/p>\n<p dir=\"ltr\">Arthur Le, Founder of Juno Markets added “<em>In our continuous aim to provide clients with the most fair and transparent trading environment in the market, Juno Markets proudly joins the Financial Commission.  This membership will give our clients access to an experienced, independent board whose goal is to provide swift trade resolutions.  Clients can trade with confidence knowing there is an additional level of insurance on their funds&#8221;<\/em>.<\/p>\n<p dir=\"ltr\"><strong>About Juno Markets<\/strong><\/p>\n<table border=\"0\">\n<tbody>\n<tr>\n<td><img decoding=\"async\" alt=\"JunoFullLogo1000px.png\" src=\"https:\/\/lh5.googleusercontent.com\/05dWlx9-yachdNUfkPVscE5QQ4Kbkby_RYu2yFKQrtldIdmUelD3n68rxt3wDjb7r_kDPbtQ5fPUiWBdlTjVPxg4v9-iaiN7pUwF_uuqZR1N6EouOKjD8hHo1mZd1pLq6iQf4Ukq\" width=\"217\" height=\"63\" \/><\/td>\n<td style=\"padding-left: 30px;\"><span style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 14px;\">Juno Markets is Asia’s Global Broker focusing on serving clients throughout the Asia Pacific region.  The firm was started by industry executives Arthur Le and Morten Fillipsen who combined have over two decades of experience in retail and institutional FX.  Juno Markets aims to be the premier broker for clients in Asia by offering world-class technology while maintaining the support and service that clients in the region expect. For further enquiries, please contact <\/span><a style=\"font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 14px;\" href=\"mailto:info@junomarkets.com\">info@junomarkets.com<\/a><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><strong>About Financial Commission<\/strong><\/p>\n<p dir=\"ltr\">Financial Commission is an independent external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes directly with their financial services providers that are members of the Financial Commission.<\/p>\n<p dir=\"ltr\">Financial Commission initially set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading electronic markets such Foreign Exchange, and then expanded into CFDs, Binary Options and related derivatives, in addition to certifying technology platforms used for trading. For more information please contact us at <a href=\"mailto:info@financialcommission.org\">info@financialcommission.org<\/a>.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>September 13th, 2016 – Hong Kong &amp; New York: Leading external dispute resolution (EDR) organization, Financial Commission, catering to the financial services industry and operated by FinaCom PLC, today announces Juno Markets as its newest member. Juno Markets’ status as an official member of the Financial Commission took effect on September 8th, 2016, after the [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71700","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71700","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71700"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71700\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71700"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71700"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71700"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}