{"id":71712,"date":"2016-12-20T00:00:00","date_gmt":"2016-12-20T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2016\/12\/20\/global-fx-code\/"},"modified":"2016-12-20T00:00:00","modified_gmt":"2016-12-20T00:00:00","slug":"global-fx-code","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2016\/12\/20\/global-fx-code\/","title":{"rendered":"Global FX Code","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>The collective global foreign exchange markets are undergoing a gradual shift at the highest levels that should bring greater integrity for participants including major dealers and individual retail traders in the months and years ahead.<\/p>\n<p><span style=\"font-weight: 400;\">Meanwhile, regulators are collaborating across borders on efforts such as the global fx code to help standardize best practices for major dealers and banks when it comes to fair and ethical dealing at the interbank level.  <\/span><\/p>\n<p><b>What triggered these changes?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">The developments to reform the foreign exchange markets come on the heels of major investigations (recent and ongoing) of FX market price manipulation at some of the largest banks and dealers in recent years. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Global FX Code was created to bring a standardized approach to best-practices in the FX Markets to help ensure best-execution while preventing market price manipulation, among other expected benefits of the code.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The effort was organized through the Bank for International Settlements (BIS) under the Foreign Exchange Working Group (FXWG) and in collaboration with the others across numerous regulatory bodies and the Federal Reserve of New York. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The first phase of the code launched softly during the middle of 2016, allowing firms to voluntarily adopt its code of conduct rules, while the second edition of the code is set to update during the first half of 2017. The code is like a giant pilot program, helping regulators and participants gather collective feedback to improve future iterations.  <\/span><\/p>\n<p><b>Progress at the interbank level<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Already banks and some dealers are beginning to state that they will only trade with other dealers that adhere to the code. This is an indication of its positive effects already, and something that regulators will be surely gauging as this pilot program gathers feedback from the industry during its first year in voluntary operation.<\/span><\/p>\n<p><b>One size fits most<\/b><\/p>\n<p><span style=\"font-weight: 400;\">However, if financial market regulators try to create a unified set of rules to govern the origination and dissemination of FX prices as well as the execution of orders against prevailing market prices, then the Global FX Code will be a good place to start reviewing such data.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Already regulators such as the FCA have numerous programs underway including after recent studies that the FCA conducted on its members, and with regard to last-look, time-stamping and the process of marking-up rates (adding spreads), among other areas of concern by the FCA.<\/span><\/p>\n<p><b>Need for a solution<\/b><\/p>\n<p><span style=\"font-weight: 400;\">A recent report by BIS cited by Reuters said that there has been an increase in outbursts of volatility and flash events and that shrinking fx volumes could cause stability risks. This means that significant market reforms could help bolster the integrity of the markets while aiding its operational efficiency. Improving the market framework should help regulators have better oversight over firms’ execution practices while encouraging firms to adhere to such rules.<\/span><\/p>\n<p><b>Retail traders in focus<\/b><\/p>\n<p><span style=\"font-weight: 400;\">For retail traders, the FX market could see an influx of new market entrants as the integrity of the market is bolstered thanks to the initiatives underway including a reduction in leverage which essential makes trading less risky when compared one a dollar for dollar basis in terms of the buying power in a margin account. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although the Global FX Code is underway at the interbank level, over time this could reach down to online brokerages and other market participants and eventually affect retail traders where best-execution from a broker can be verified more easily. <\/span><\/p>\n<p><b>Mid-level challenges<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Other areas of concern pointed out by the FCA’s findings has to do with the practice of ‘last-look.’ <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Similar to asymmetrical slippage, last-look is a form of asymmetrical execution. When an order is received by a dealer for execution from a client, rather than executing it immediately at the rate that had been advertised or that is currently available, the dealer gets to decide whether the rate has since changed unfavourably &#8211; and instead cancel or re-quote the order. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another alarming practice that has plagued traders in the FX industry for years that is only now coming to the spotlight by regulators is known as “stop-hunting”, or when a firm arbitrarily widens its bid or ask price to trigger client’s stop-loss orders.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Financial Commission welcomes the work underway via the Global FX Code and supports this voluntary effort, and calls upon brokers to join as members where they can demonstrate their commitment to self-regulatory compliance while meeting the guidelines that our members uphold to best serve clients.<\/span><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>The collective global foreign exchange markets are undergoing a gradual shift at the highest levels that should bring greater integrity for participants including major dealers and individual retail traders in the months and years ahead. Meanwhile, regulators are collaborating across borders on efforts such as the global fx code to help standardize best practices for [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[],"class_list":["post-71712","post","type-post","status-publish","format-standard","hentry","category-tips-for-all"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71712","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71712"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71712\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71712"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71712"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71712"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}