{"id":71715,"date":"2017-01-23T00:00:00","date_gmt":"2017-01-23T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/01\/23\/financial-commission-certifies-trading-technology-provided-by-amts-solutions\/"},"modified":"2017-01-23T00:00:00","modified_gmt":"2017-01-23T00:00:00","slug":"financial-commission-certifies-trading-technology-provided-by-amts-solutions","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/01\/23\/financial-commission-certifies-trading-technology-provided-by-amts-solutions\/","title":{"rendered":"Financial Commission Certifies Trading Technology provided by AMTS Solutions","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"font-weight: 400;\">January 23, 2017 – Hong Kong &amp; New York: The Financial Commission, a leading financial services independent external dispute resolution (EDR) organization, today announced the successful certification of <\/span><a href=\"http:\/\/amtssolutions.com\/en\/products\/ecn\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">AMTS ECN technology<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<table>\n<tbody>\n<tr>\n<td><img decoding=\"async\" class=\"alignleft wp-image-34476\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/amts-logo-300x137.png\" alt=\"amts-logo\" width=\"200\" height=\"91\" \/><\/td>\n<td style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">The Financial Commission conducted its rigorous review of the AMTS ECN, to ensure it met the technical information requirements of the Commission’s technology certification evaluation process. The Financial Commission established a comprehensive list of points to verify including system security, capacity, business disaster recovery and a continuity plan, as well as reporting and record keeping, among other fields deemed important to certify.<\/span><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Financial Commission Chairman Peter Tatarnikov said regarding the new certification, “In order to provide traders with fair dispute resolution we must fully understand their system’s construction and working process. AMTS ECN is the latest technology certified by the Financial Commission. We will be happy to see more software providers certifying their products with us. Today we gladly announce successful certification of AMTS ECN technology and believe it is a great step to leverage its credibility and grow its business globally.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">AMTS Solutions Founder and CEO Dmitry Rannev commented regarding the certification, “Our team has more than 10 years of experience in the field of dealing technologies development, beginning with the creation of the first bridge in 2006. AMTS ECN is the culmination of our work and the successful implementation of many years of experience, which was embodied in a very reliable and stable system. Our ECN has proved to be one of the best systems in dealing with major brokerages with wide customer bases and large amount of trades.”<\/span><\/p>\n<p><b>About AMTS ECN<\/b><\/p>\n<p><span style=\"font-weight: 400;\">AMTS ECN is the main product of <\/span><a href=\"http:\/\/amtssolutions.com\/en\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">AMTS Solutions<\/span><\/a><span style=\"font-weight: 400;\"> and is a high-tech multi-module, infinitely scalable system that is based on a high-speed communication protocol and is resistant to high-demand architecture. The system was created by the first-grade developers with more than 10 years of experience in creating technologies for the financial markets.<\/span><\/p>\n<p>Today, AMTS ECN is one of the fastest and most flexible solutions for online trading. The system provides brokers with the maximum flexibility in configuring the liquidity, trading tools, risk management rules, order execution methods, etc. Additionally, AMTS ECN provides a high degree of protection from typical problems such as non-market quotes, arbitration and much more.<\/p>\n<p><span style=\"font-weight: 400;\">By choosing AMTS ECN its customers will get a turn-key dealing with stable and high quality performance proven by years of working with large brokerage companies and which will satisfy the most demanding customers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For more information, please contact <\/span><a href=\"mailto:info@amtssolutions.com\"><span style=\"font-weight: 400;\">info@amtssolutions.com<\/span><\/a><\/p>\n<p><b>About Financial Commission <\/b><\/p>\n<p><span style=\"font-weight: 400;\">The Financial Commission is an external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes with financial services providers that are members of the Financial Commission. The Financial Commission set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading the Forex market. The Financial Commission was established to be a neutral 3rd party committee to fairly review and resolve complaints in an effort to facilitate a simpler, swifter resolution than through industry regulators and the legal system.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Technology developers seeking membership status with the Financial Commission can learn more about the process and expected requirements as part of the technology certification process in advance of applying for membership or in the preparation of submitting an application.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For more information, please contact The Financial Commission: <\/span><a href=\"mailto:info@financialcommission.org\"><span style=\"font-weight: 400;\">info@financialcommission.org<\/span><\/a><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>January 23, 2017 – Hong Kong &amp; New York: The Financial Commission, a leading financial services independent external dispute resolution (EDR) organization, today announced the successful certification of AMTS ECN technology. The Financial Commission conducted its rigorous review of the AMTS ECN, to ensure it met the technical information requirements of the Commission’s technology certification [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71715","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71715","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71715"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71715\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71715"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71715"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71715"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}