{"id":71728,"date":"2017-04-06T00:00:00","date_gmt":"2017-04-06T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/04\/06\/the-financial-commission-announces-fxpig-as-its-latest-approved-member\/"},"modified":"2017-04-06T00:00:00","modified_gmt":"2017-04-06T00:00:00","slug":"the-financial-commission-announces-fxpig-as-its-latest-approved-member","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/04\/06\/the-financial-commission-announces-fxpig-as-its-latest-approved-member\/","title":{"rendered":"The Financial Commission Announces FXPIG as its Latest Approved Member","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p>April 5, 2017,<b> <\/b><span style=\"font-weight: 400;\">Leading external dispute resolution (EDR) organization, Financial Commission, catering to the financial services industry and operated by FinaCom PLC, today announces <a href=\"https:\/\/fxpig.com\/\" target=\"_blank\" rel=\"noopener\">FXPIG<\/a> as its newest approved Member.<\/span><\/p>\n<table>\n<tbody>\n<tr>\n<td><a href=\"https:\/\/fxpig.com\/\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignleft wp-image-37032\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2013\/08\/fxpig-reviews-logo-300x259.jpg\" alt=\"fxpig-reviews-logo\" width=\"150\" height=\"130\" \/><\/a><\/td>\n<td>\n<p style=\"padding-left: 30px;\"><a href=\"https:\/\/fxpig.com\/\" target=\"_blank\" rel=\"noopener\">FXPIG’s<\/a> status as a Member of the Financial Commission took effect on April 4, 2017, following the approval of its membership application by FinaCom PLC’s board, thus allowing the company and its customers access to a wide range of services and membership benefits including, but not limited to, protection for up to $20,000 per submitted claim, backed by the Financial Commission’s compensation fund.<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">The Financial Commission provides brokerages and their clients with an unbiased 3rd party mediation platform that helps resolve complaints in instances where the original parties are unable to come to an agreement themselves.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For approved members and their clients participating in the CFD and foreign exchange (forex) markets, the Financial Commission helps facilitate a simpler, swifter resolution process than can be had through common regulatory channels such as arbitration or the local court systems.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">FXPIG joins a diverse range of brokerages and independent services providers (ISPs) that utilize the services of the Financial Commission as part of their overall commitment to their clients whilst upholding the strict membership requirements of the Commission.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Financial Commission Chairman, Peter Tatarnikov said,<em> &#8220;We are pleased to see new brokers continuing to join the Financial Commission and proud to welcome A category member FXPIG as our latest approved member and the most recent brokerage to join the Financial Commission. Our ongoing membership growth reflects the importance of efficient dispute resolution and shows that companies and their clients value when a neutral 3rd party provides such services. Financial Commission provides an unmatched dispute resolution process which FXPIG and its customers can now take advantage of.&#8221;<\/em><\/span><\/p>\n<p>In the same light, Kevin Murcko, CEO of FXPIG, commented that &#8220;<em>Our primary goal has always been creating the best trading environment possible, part of that is ensuring that we are constantly working toward aligning our interests with that of our clients. The Financial Commission is the premier EDR in the retail FX industry, and it provides both our company and our valued customers peace of mind, which comes from knowing that any disputes that may arise will be arbitrated professionally and impartially.&#8221;<\/em><\/p>\n<p><b>About FXPIG<\/b><\/p>\n<p><span style=\"font-weight: 400;\"><a href=\"https:\/\/fxpig.com\/\" target=\"_blank\" rel=\"noopener\">FXPIG<\/a> is different. Yeah, we know everyone says they are different, but seriously, we <\/span><i><span style=\"font-weight: 400;\">TRULY <\/span><\/i><span style=\"font-weight: 400;\">are <\/span><i><span style=\"font-weight: 400;\">DIFFERENT<\/span><\/i><span style=\"font-weight: 400;\">. Our core focus has, and always will be on our trading <\/span><i><span style=\"font-weight: 400;\">PARTNERS<\/span><\/i><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We do not sugarcoat what happens in the market, nor do we spend countless marketing dollars to cover up the not so elegant side of this business, we prefer to push that money into research and development of our trading environment, something that is constantly evolving. While we cannot promise perfection, things can and most often do happen, what we can promise is our implicit dedication to taking on each and every problem our <\/span><i><span style=\"font-weight: 400;\">PARTNERS <\/span><\/i><span style=\"font-weight: 400;\">face with the same veracity regardless of the size or scope of the issue. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The FX Market is hard enough to navigate on its own, and we know, from <\/span><i><span style=\"font-weight: 400;\">EXPERIENCE<\/span><\/i><span style=\"font-weight: 400;\">, that the last thing a trader needs is more red tape and vague and unsupported answers to their very poignant questions. FXPIG knows that while all traders want the best possible price, each and every trader needs a different set of tools to be successful. That is why we not only provide the highest caliber infrastructure but also work to make sure you can access this infrastructure on a budget. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Our slogan underscores the overall truth in our business model, the overall truth in why FXPIG has been able to grow inside a very difficult industry without reverting to the same unscrupulous tactics as its competitors; FXPIG, Where Traders Come to Win.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For more information, please contact FXPIG at <a href=\"mailto:helpdesk@fxpig.com\">helpdesk@fxpig.com<\/a><\/span><\/p>\n<p><b>About Financial Commission<\/b><\/p>\n<p><span style=\"font-weight: 400;\">The Financial Commission is an independent external dispute resolution (EDR) organization for consumers\/traders who are unable to resolve disputes directly with their financial services providers that are members of the Financial Commission. The Financial Commission initially set out to provide a new approach for traders and brokers alike to resolve any issues that arise in the course of trading electronic markets such as the Foreign Exchange Market, and then expanded into CFDs, Binary Options, and related derivatives, in addition to certifying technology platforms used for trading.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For more information, please contact us at <a href=\"mailto:info@financialcommission.org\">info@financialcommission.org<\/a><\/span><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>April 5, 2017, Leading external dispute resolution (EDR) organization, Financial Commission, catering to the financial services industry and operated by FinaCom PLC, today announces FXPIG as its newest approved Member. FXPIG’s status as a Member of the Financial Commission took effect on April 4, 2017, following the approval of its membership application by FinaCom PLC’s board, [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-71728","post","type-post","status-publish","format-standard","hentry","category-uncategorized"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71728","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71728"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71728\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71728"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71728"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71728"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}