{"id":71746,"date":"2017-07-18T00:00:00","date_gmt":"2017-07-18T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/07\/18\/verifymytrade-because-every-trader-should-know\/"},"modified":"2017-07-18T00:00:00","modified_gmt":"2017-07-18T00:00:00","slug":"verifymytrade-because-every-trader-should-know","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/07\/18\/verifymytrade-because-every-trader-should-know\/","title":{"rendered":"VerifyMyTrade – Because Every Trader Should Know!","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p class=\"normal\">If you are trading in the forex market, then you are probably wondering how well your broker is executing your orders. And if you’re not wondering this, then maybe now is the time to start being inquisitive.<\/p>\n<p class=\"normal\">Unfortunately, brokers do not provide their clients with tools that confirm the execution quality of orders. This doesn’t necessarily mean that traders are given poor performance, but it does not confirm the opposite either.<\/p>\n<p class=\"normal\">In a decentralized market such as Forex, there is no single price available for everyone, and the quotes of market makers may differ from one another. In this regard, the average trader does not have the opportunity to assess the quality of execution, except to independently analyze the prices of different brokers at every point in time. Without the correct technology, this is a time consuming and difficult task.<\/p>\n<p class=\"normal\">But now there is just such a tool! Introducing <a href=\"http:\/\/www.verifymytrade.com\" target=\"_blank\" rel=\"noopener\"><span style=\"color: #1155cc;\">VerifyMyTrade<\/span><\/a>, an independent data repository that provides post-trade analysis of order execution for Forex transactions.<\/p>\n<p class=\"normal\">As expected, after the launch of the service the developers received a lot of feedback, both positive and negative. Many financial service providers agreed that this tool creates the ground for disagreement because it may lead traders to draw inaccurate conclusions about the quality of order execution. In fairness it must be said that this service cannot guarantee 100% accuracy of performance evaluation, but at least it provides some general indication of correctness.<\/p>\n<p class=\"normal\">At the same time, almost all those who responded supported the initiative because it really seeks to shed light on the process of pricing in the forex market. I absolutely agree with all the arguments and I want to explain why. Let&#8217;s introduce an example of two mobile users in one city. The first pays $ 100 per month and the second only $ 80. Many people might think that the first one overpays. However, can one make a comparative assessment without a detailed estimate of the quantity and duration of calls, as well as other options available in the contract? No, this simply isn’t impossible. In this respect the Forex market is no different; without understanding at what moment a trader concludes deals and what volumes, it is impossible to accurately assess the quality of performance. However, we all understand that in any market there is always a realistic price range within which the purchase of goods or services should not cause any surprise to the consumer.<\/p>\n<p class=\"normal\">From the above example I suggest looking at <a href=\"http:\/\/www.verifymytrade.com\" target=\"_blank\" rel=\"noopener\"><span style=\"color: #1155cc;\">VerifyMyTrade<\/span><\/a> from the perspective of what the service is trying to achieve: Firstly, to determine whether the price received from your dealer is out of range when compared to prices received from other dealers. Secondly, to show how competitive the pricing was in comparison with the prices of other market participants – a factor that is dependent on many factors; as shown in the cell phone example above.<\/p>\n<p class=\"normal\">Let&#8217;s have a look at the real problem faced by dealers and traders every day. In the overwhelming majority of cases, traders only recheck the execution price of loss-making trades. When one makes a loss, it is human psychology dictates one to go and check whose fault it was. We are convinced that there was an error, and that somebody else was at fault!<\/p>\n<p>&nbsp;<\/p>\n<p><strong>What does the trader do in this situation?<\/strong><\/p>\n<table>\n<tbody>\n<tr>\n<td><img decoding=\"async\" class=\"alignleft wp-image-39074\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/07\/злой.png\" alt=\"%d0%b7%d0%bb%d0%be%d0%b9\" width=\"150\" height=\"123\" \/><\/td>\n<td>\n<p style=\"padding-left: 30px;\">As a rule, he looks at the price of execution of his trade, and then looks for a dealer whose price at the time of execution was more beneficial to the executed trade. The problem is that within the structure of a decentralized market, the probability of finding a more beneficial price is very high, and on this basis the trader submits a claim to the dealer.<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><strong>What does the dealer do in this case?<\/strong><\/p>\n<table>\n<tbody>\n<tr>\n<td><img decoding=\"async\" class=\"alignleft wp-image-39075\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/07\/no.png\" alt=\"no\" width=\"150\" height=\"150\" srcset=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2017\/07\/no.png 157w, https:\/\/financialcommission.org\/wp-content\/uploads\/2017\/07\/no-150x150.png 150w\" sizes=\"(max-width: 150px) 100vw, 150px\" \/><\/td>\n<td style=\"padding-left: 30px;\">The dealer reminds the trader of the decentralized nature of the forex market, highlights the legal terms and conditions according to which the dealer has the final say in determining the market price! That is it, the dealer does not even want to enter into a dialogue about the availability of a better price somewhere else<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><strong>Problem &#8211; Conflict of interest<\/strong><\/p>\n<table>\n<tbody>\n<tr>\n<td><img decoding=\"async\" class=\"alignleft wp-image-39076\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/07\/2.png\" alt=\"2\" width=\"150\" height=\"132\" \/><\/td>\n<td>\n<p style=\"padding-left: 30px;\">From this moment on the disagreements begin. Only an independent third party such as the <a href=\"https:\/\/xcv.financialcommission.org\/\">Financial Commission<\/a> is capable of judging such cases. Despite signed the legal documents, the trader sees only loopholes and biases and considers himself deceived. He no longer wants to listen to any arguments of the dealer and believes that the contract is structured in such a way as to give the dealer absolute legal power for all occasions.<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><strong>Solving the problem at the stage of its occurrence<\/strong><\/p>\n<table>\n<tbody>\n<tr>\n<td><a href=\"http:\/\/www.verifymytrade.com\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-38798\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2017\/03\/Снимок-экрана-2017-06-21-в-15.11.04.png\" alt=\"Verify My Trade\" width=\"150\" height=\"113\" \/><\/a><\/td>\n<td style=\"padding-left: 30px;\">An educated trader is a loyal customer. <a href=\"http:\/\/www.verifymytrade.com\" target=\"_blank\" rel=\"noopener\">VerifyMyTrade <\/a>gives traders an understanding of what a decentralized market is before he independently comes to some conclusions and lodges a claim. By providing traders with a tool for analyzing the quality of their own traders, the dealer declares transparency and commitment to honest business. The client will then learn that price execution does not exist only as “correct” or “incorrect”, but with many varying options and factors in between. As a consequence, even if an execution problem is found the client will look at this as an error rather than as malicious intent.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><strong>Position of the Financial Commission<\/strong><\/p>\n<table>\n<tbody>\n<tr>\n<td><a href=\"https:\/\/xcv.financialcommission.org\/\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-26663 size-full\" src=\"https:\/\/xcv.financialcommission.org\/wp-content\/uploads\/2014\/07\/finCom_1501.png\" alt=\"finCom_150\" width=\"150\" height=\"150\" \/><\/a><\/td>\n<td style=\"padding-left: 30px;\">The mission of our organization is to create a more honest and reliable environment in the Forex market. This mission is realized by bringing together brokers who are committed to observing the highest standards of commercial honor and best business practices, as well as the promoting the growth of trader knowledge about the inner workings of the Forex market. VerifyMyTrade is an excellent initiative designed to increase the transparency of the industry and the level of awareness of traders – making it a perfect fit with the mission of our organization.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>If you are trading in the forex market, then you are probably wondering how well your broker is executing your orders. And if you’re not wondering this, then maybe now is the time to start being inquisitive. Unfortunately, brokers do not provide their clients with tools that confirm the execution quality of orders. This doesn’t [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6394],"tags":[],"class_list":["post-71746","post","type-post","status-publish","format-standard","hentry","category-tips-for-all"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71746","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71746"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71746\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71746"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71746"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71746"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}