{"id":71757,"date":"2017-08-22T00:00:00","date_gmt":"2017-08-22T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/08\/22\/customer-complaint-dated-march-1-2017\/"},"modified":"2017-08-22T00:00:00","modified_gmt":"2017-08-22T00:00:00","slug":"customer-complaint-dated-march-1-2017","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/08\/22\/customer-complaint-dated-march-1-2017\/","title":{"rendered":"Customer Complaint Dated March 1, 2017","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"color: #003366;\"><b>Complaint Matter<\/b><\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">Mr. XXX has lodged his complaint with Financial Commission on the following grounds:<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">The Client used Fix Cent account #XXXXX for trading operations on the Forex market. Trading was carried out with only one financial instrument (USDJPY) by means of trading adviser. The adviser opens a series of Buy \/ Sell orders, and in case of a favorable price movement, closes them with a profit of $ 10. In case of unfavorable price movement, the adviser opens a new order of a larger volume (maximum 15 orders) and closes all orders as soon as the price turns and passes the minimum distance in a favorable direction. The incident occurred on 01.03.2017 at 06:55 (server time). At this time, the margin level on Client’s trading account fell below a critical level, causing the Client’s unprofitable positions to be forcibly liquidated by the Broker. <\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">The Сlient assumes that the Broker had intervened in the working process of the trading advisor by closing one of the opened positions (# XXXXXX), which led to the incorrect operation of the EA and resulted in losing of the Client&#8217;s deposit. The Сlient disputes actions of the Broker and demands to restore the balance of the trading account as of 01.03.2017.<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">For its part, the Broker does not see any grounds for the Client&#8217;s complaint and believes that all his transactions were executed correctly, in accordance with current market prices at the time of the transaction and in accordance with the provisions of the regulatory documents. In support of its position, the Broker provided a history of ticks on the USDJPY financial instrument, as well as trading server log-files.<\/span><\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">1\/03\/2017<\/td>\n<td colspan=\"3\">24\/03\/2017<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><span style=\"font-weight: 400;\">Complaint response:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The decision for this complaint is based on the information provided by the Client and the Broker.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To ensure an objective investigation of the incident, the Dispute Resolution Committee of the Financial Commission closely examined the documentary evidence provided by the parties to the dispute. Having analyzed the mate<\/span><span style=\"font-weight: 400;\">rials of the complaint, the Dispute Resolution Committee has come to the following conclusions: <\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">1. First of all, it should be noted that according to clause 7.8 of the Client Agreement: &#8220;A Client’s order to open position is considered to be executed and a position is considered to be opened after an appropriate record has been made in the server’s log-file.”, while according to clause 7.9 of the Client Agreement:&#8221;A Client’s order to close position is considered to be executed, and a position is considered to be closed after an appropriate record has been made in the server’s log-file.&#8221; Taking into account trading server log-files provided by the Broker, no information related to the orders for closing the positions disputed by the Client was recorded.<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">2. In order to find out the reasons of EA’s incorrect function, the Broker requested trading terminal log-files from the Client, which contains information about all orders generated by the trading adviser. The following error was found in the trading terminal log-file provided by the Client:<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">18:13:44.401 Profit+ USDJPY,H1: Order 66541787 Failed to close! Error:129<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">It is necessary to clarify that error 129 is an ERR_INVALID_PRICE type of error. This error occurs if the adviser operates on the account with Instant Execution mode (to which the Client&#8217;s account belongs) and tries to send a request for opening or closing the order while such request contains a price significantly different from the current price in trading terminal memory.<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">3. According to clause 12.1 of the Client Agreement: “ In case Margin Level on Client’s trading account becomes equal or lower than Stop Out value, the Company has the right to close all open positions on the Client’s trading account at the current market price without any preliminary notification and Client’s consent. Stop Out values for each of account types are specified in comparison table of account types on the Company’s website.”<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">4. Trading conditions on the Client&#8217;s account assume Stop Out at the level of 20%. This information is clearly indicated on the Broker&#8217;s website in the section &#8220;Types of accounts and trading conditions&#8221;. The opening of such type of account by the Client presumes his consent to accept trading conditions provided by the Broker. Thus, in the absence of trading adviser orders to close Client’s loss-making positions such positions were forcibly liquidated by the Broker due to the drop in margin level below critical. This fact is confirmed by the trading server log-files.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to the Dispute Resolution Committee experts’ opinion, the Client should check the periodicity of updating adviser’s quotes with RefreshRates function. If the access to Bid \/ Ask figures is used directly within the advisor&#8217;s code, then without the RefreshRates function it may not correspond to the current market situation and may cause such an error when sending a request. It is better to update before sending any trading request or price checking. In order to optimize and reduce the load on the trading server, the Сlient’s terminal conducts a checking before sending the request and in the event of an error, 129 will not even try to send a request to MT4 server.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If the client is sure of the correctness of the data at the time of the request, then he should check his algorithms in the trading adviser. Error code 129 with 100% probability indicates that the request price differs significantly from the price in trading terminal memory. And even if the calculations are minor, a very sharp price movement in the market can provoke such an error.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Based on the above information the Dispute Resolution Committee does not find any violations from Broker’s side. The Client, in turn, always bears full responsibility for the working process of his trading adviser and sending of orders. Consequently, there are no grounds for the Client’s complaint.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee Anatoly Bulanov<\/span><span style=\"font-weight: 400;\">.<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Broker<\/td>\n<td colspan=\"2\">None<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>14\/04\/2017<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mr. XXX has lodged his complaint with Financial Commission on the following grounds: The Client used Fix Cent account #XXXXX for trading operations on the Forex market. Trading was carried out with only one financial instrument (USDJPY) by means of trading adviser. The adviser opens a series of Buy \/ Sell orders, and [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-71757","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71757","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71757"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71757\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71757"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71757"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71757"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}