{"id":71756,"date":"2017-08-22T00:00:00","date_gmt":"2017-08-22T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/08\/22\/customer-complaint-dated-january-11-2017\/"},"modified":"2017-08-22T00:00:00","modified_gmt":"2017-08-22T00:00:00","slug":"customer-complaint-dated-january-11-2017","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/08\/22\/customer-complaint-dated-january-11-2017\/","title":{"rendered":"Customer Complaint Dated January 11, 2017","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"color: #000080;\"><b>Complaint Matter<\/b><\/span><\/p>\n<p><span style=\"font-weight: 400; color: #000080;\">Mr. XXX has lodged his complaint with Financial Commission on the following grounds:<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #000080;\">The Client used trading account #XXXXX for trading operations with CFDs on commodities.<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #000080;\">By the time of the incident, several positions on two instruments &#8211; Lumber and Alumini<\/span><span style=\"font-weight: 400; color: #000080;\">um (see statement) were opened on the account. The day before the incident, an expiration of the January futures contract Lumber (LBS F7) occurred, consequently, Client’s positions opening price on that instrument was adjusted in accordance with the current March quotes of the Lumber futures contract (LBS H7). The incident on the Client&#8217;s account occurred on January 11, 2017, at 17:05 (server time). At the specified time, due to the closure of hedged LONG position on the Lumber instrument by pending Take Profit order, the margin level on the Client&#8217;s trading account fell to a critical level. As a result of the incident, all of the Client&#8217;s open positions were forcibly liquidated by the Broker (Stop Out).<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #000080;\">The Client disagrees with Broker actions and believes that the positions on Lumber were opened and closed at non-market prices. Such conclusion comes from a comparison of the Lumber chart in the Broker’s platform with similar charts of other financial service providers. The Client considers actions of the Broker as unlawful and demands to return lost funds:<\/span><\/p>\n<ol>\n<li><span style=\"font-weight: 400; color: #000080;\"> For Lumber transactions &#8211; cancel transactions and return the funds in the amount of $ 37840.00;<\/span><\/li>\n<li><span style=\"font-weight: 400; color: #000080;\"> For Aluminium transactions &#8211; recover lost profit in the amount of $ 8295.00.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400; color: #000080;\">In turn, the Broker believes that the Client complaint does not have any grounds due to the fact that opened positions on his account were closed in accordance with the provisions of regulatory documents at actual prices at the moment of the incident. According to the Broker’s information, at the moment of the incident, the margin level on the Client&#8217;s account fell below a critical level. As documentary evidence, the Broker provided server log-files and a history of tick data on specified financial instruments.<\/span><\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">11\/01\/2017<\/td>\n<td colspan=\"3\">13\/01\/2017<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><span style=\"font-weight: 400;\">Complaint response:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The decision for this complaint is based on the information provided by the Client and the Broker.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To ensure an objective investigation of the incident, the Dispute Resolution Committee of the Financial Commission closely examined documentary evidence provided by the parties to the dispute. Having analyzed the materials of the complaint, the Dispute Resolution Committee has come to the following conclusions: <\/span><\/p>\n<ol>\n<li><span style=\"font-weight: 400;\"> First of all, it should be noted, that at the moment when the Client opened positions on Lumber (both Long and Short) the underlying CFD asset for the Lumber on Broker platform was LBS F7 futures contract (delivery month &#8211; January 2017). The comparison of price data on Lumber on Broker’s platform with data from information system ESignal showed that the Client&#8217;s positions on Lumber were opened at market prices.<\/span><\/li>\n<\/ol>\n<ol start=\"2\">\n<li><span style=\"font-weight: 400;\"> In connection with the expiration of futures contract LBS F7, which took place on January 10, 2017, at 23:59 (server time), starting from 11\/01\/2017 the underlying CFD asset for Lumber was LBS H7 futures contract (delivery month &#8211; March 2017). At the time of LBS F7 futures contract expiration, an automatic correction of opening prices on Client&#8217;s locked positions took place: the adjustment of Long position was -168,221 points while the adjustment of Short position was +167,779 points. The expiration of futures contract, as well as Client&#8217;s positions correction, occurred at the time and in accordance with the terms indicated on Broker&#8217;s website (section &#8220;Calendar of expirations&#8221; and notice of positions correction in the news section on the main page of the website). The client should take this information into account when planning and execute his trading operations.<\/span><\/li>\n<\/ol>\n<ol start=\"3\">\n<li><span style=\"font-weight: 400;\"> As a result of adjusting the opening prices on Client&#8217;s locked positions on Lumber caused by the expiration of LBS F7 futures contract, Client’s long position on Lumber instrument was closed at the beginning of the trading session on 11\/01\/2017 at 17:34 (server time) by means of a pending Take Profit order at the price specified by the Client. This fact is confirmed by the server log-files provided by the Broker.<\/span><\/li>\n<\/ol>\n<ol start=\"4\">\n<li><span style=\"font-weight: 400;\"> The closing of Client’s locked long position on Lumber resulted in an increase in the margin level required to maintain the remaining opened unprofitable short position on Lumber. This circumstance, in turn, led to the fact that the level of margin on the Client&#8217;s trading account fell to a critical level.<\/span><\/li>\n<\/ol>\n<ol start=\"5\">\n<li><span style=\"font-weight: 400;\"> It should be noted that trading conditions of the Client&#8217;s account assume Stop Out at the level of 30%. This information is clearly indicated on the Broker&#8217;s website in the section &#8220;Types of accounts and trading conditions&#8221;. The opening of this type of account by the Client assumes his consent to accept the trading conditions provided by the Company.<\/span><\/li>\n<\/ol>\n<ol start=\"6\">\n<li><span style=\"font-weight: 400;\"> According to the Broker&#8217;s regulatory documents, it has the right to close current Client’s position (positions) without any notification and concordance in the event when the level of margin on the Client&#8217;s trading account drops below the critical (Stop Out). At the time of the incident, the margin level fell below 30%, therefore all of the Client&#8217;s opened positions were forcibly liquidated by the Broker at prices that were actual at the time of the incident. This fact is confirmed by server log-files and history of tick data on Lumber and Aluminium instruments provided by the Broker.<\/span><\/li>\n<\/ol>\n<ol start=\"7\">\n<li><span style=\"font-weight: 400;\"> In conclusion, it should be also noted that at the time of Lumber quotes corresponding to the new LBS H7 futures contract came in broker&#8217;s trading system, a technical malfunction appeared on the Broker&#8217;s side. As a result of the malfunction that took place on January 11, 2012, at 14:38 (server time), before the opening of the trading session on Lumber instrument, pending Take Profit order mentioned above was triggered, causing a closing of all Client’s positions by Stop Out. The Broker timely discovered an error in its trading system and liquidated the consequences of the incident. All Client’s positions were restored at 16:48 (server time), as evidenced by Broker’s server log-files.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Based on the above information the Dispute Resolution Committee does not find any violations from broker’s side, consequently, there are no grounds for the Client’s complaint.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee Anatoly Bulanov<\/span><span style=\"font-weight: 400;\">.<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Broker<\/td>\n<td colspan=\"2\">None<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>3\/02\/2017<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mr. XXX has lodged his complaint with Financial Commission on the following grounds: The Client used trading account #XXXXX for trading operations with CFDs on commodities. By the time of the incident, several positions on two instruments &#8211; Lumber and Aluminium (see statement) were opened on the account. The day before the incident, [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-71756","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71756","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71756"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71756\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71756"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71756"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71756"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}