{"id":71770,"date":"2017-10-06T00:00:00","date_gmt":"2017-10-06T00:00:00","guid":{"rendered":"https:\/\/financialcommission.org\/2017\/10\/06\/customer-complaint-dated-december-30-2016\/"},"modified":"2017-10-06T00:00:00","modified_gmt":"2017-10-06T00:00:00","slug":"customer-complaint-dated-december-30-2016","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2017\/10\/06\/customer-complaint-dated-december-30-2016\/","title":{"rendered":"Customer Complaint Dated December 30, 2016","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"color: #003366;\"><b>Complaint Matter<\/b><\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">Mrs. XXX has lodged his complaint with Financial Commission on the following grounds:<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">The Client used trading account #XXXXX for trading operations on Forex and CFD market. Having no sufficient knowledge and experience of working on the financial market, the Client used an investment program offered by Broker’s financial consultant.<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">In accordance with the terms of the investment program, on June 10, 2016, the trading account was deposited by $ 1000 by the Client. After that, the Broker provided the Client with a 100% bonus for a period of 2 months. Broker’s financial consultant was engaged in forming the portfolio (new portfolio each month). Subsequently, as follows from the audio provided by the Broker, the Client provided the financial consultant with the access to his trading account in order to form an investment portfolio of foreign companies securities.<\/span><\/p>\n<p><span style=\"color: #003366;\"><span style=\"font-weight: 400;\">In 4 months after participation in the investment program, the Client&#8217;s trading account has undergone a serious drop. In addition, on October 11, 2016, the bonus provided by the Broker was withdrawn. As a result, in order to maintain the investment portfolio and continue trading, the Client has had to replenish the account. The Broker offered its Client to replenish the deposit with another $ 500 and use new bonus. The Client replenished the account with the required amount and received a bonus of $ 598. The Broker also offered to trade <\/span><span style=\"font-weight: 400;\">without its assistance<\/span><span style=\"font-weight: 400;\">. As a consequence, the Client decided to terminate his participation in the investment program and started an independent trading on the market.<\/span><\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">In a few months of independent trading, the Client has increased its trading account balance up to $8491 and on March 2, 2017, initiated a partial withdrawal of funds from the trading account.<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">The withdrawal was suspended by thу Broker and after the account audit the Client was given the following response: &#8220;Based on the clause 5.8 of the Client Agreement, we refuse to provide you our services thus returning your initial deposit:<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">5.8. The Company has the right to suspend service provision to the Client at any time, without prior notification of the Client and without disclosing the reasons.<\/span><\/p>\n<p><span style=\"font-weight: 400; color: #003366;\">The Client does not agree with the Broker&#8217;s decision and considers its actions unlawful. The Client believes that a fair solution in this situation will be to refund all his profits. Considering the fact that the initial deposit of $ 1,500 was returned to the Client earlier, the Client requires Broker to return part of the profit in the amount of $ 5,000 without claiming spent bonus provided by the Broker. As evidence, the Client provided his account trading report, as well as a description of the Broker&#8217;s investment program.<\/span><\/p>\n<p><span style=\"color: #003366;\"><span style=\"font-weight: 400;\">For its part, the Broker <\/span><span style=\"font-weight: 400;\">believes that the Client’s complaint has no grounds<\/span><span style=\"font-weight: 400;\"> based on the clause 4.8. of Client Agreement: &#8220;The Client is obliged not to assign his\/her rights under the Agreement, not to delegate and\/or perform any other act of transfer of authority in compliance with the present Agreement and the relevant Regulations without prior written consent of the Company. If this provision is violated, any such assignment, delegation or transfer of authority will be considered invalid. &#8220;As evidence, the Broker provided audio recordings, from which it follows that the Client has given the company&#8217;s employees access to his trading account.<\/span><\/span><\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">30\/12\/2016<\/td>\n<td colspan=\"3\">30\/03\/2017<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><strong>Complaint Response:<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">The decision for this complaint is based on the information provided by the Client and the Broker.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To ensure an objective investigation of the incident, the Dispute Resolution Committee of the Financial Commission closely examined the documentary evidence provided by the parties to the dispute. Having analyzed the materials of the complaint, the Dispute Resolution Committee has come to the following conclusions:<\/span><\/p>\n<ol>\n<li><span style=\"font-weight: 400;\"> Based on the audio records provided by the Broker, the Client does not deny the fact of providing access to his trading account to the company&#8217;s employees. This is indeed a violation of clause 4.8 of the Client Agreement and entitles the Broker to declare all transactions on the Client&#8217;s account as invalid.<\/span><\/li>\n<\/ol>\n<p><b>  <\/b><\/p>\n<ol start=\"2\">\n<li><span style=\"font-weight: 400;\"> On the other hand, the fact that despite the breach of Client Agreement by Client at the very beginning of cooperation, the Broker let Client to continue his trading operations without its assistance and did not block Client’s trading account until the latter initiated a withdrawal process.<\/span><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"3\">\n<li><span style=\"font-weight: 400;\"> It should be also noted, that in response to the Dispute Resolution Committee request, the Broker did not consider it necessary to provide timely any evidence including audio recordings related to the trading activity on the Client&#8217;s account confirming that the Client has provided access to his trading account to Broker’s employees. These facts were revealed only after a preliminary decision on the case had been made.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Based on the above information, Members of the Dispute Resolution Committee came to a unanimous opinion that the financial results of all transactions on the Client’s trading account must be considered valid. The Broker must satisfy Client&#8217;s complaint in full and refund all financial results in the amount of $ 5000.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Client<\/td>\n<td colspan=\"2\">$ 5000<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td>19\/05\/2017<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Mrs. XXX has lodged his complaint with Financial Commission on the following grounds: The Client used trading account #XXXXX for trading operations on Forex and CFD market. Having no sufficient knowledge and experience of working on the financial market, the Client used an investment program offered by Broker’s financial consultant. In accordance with [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-71770","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71770","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=71770"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/71770\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=71770"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=71770"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=71770"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}