{"id":75614,"date":"2018-04-11T17:17:55","date_gmt":"2018-04-11T17:17:55","guid":{"rendered":"https:\/\/financialcommission.org\/?p=75614"},"modified":"2018-04-11T17:19:41","modified_gmt":"2018-04-11T17:19:41","slug":"customer-complaint-dated-december-12th-2016","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/04\/11\/customer-complaint-dated-december-12th-2016\/","title":{"rendered":"Customer Complaint Dated December 12th 2016","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p><span style=\"color: #003366;\"><strong>Complaint Matter<br \/>\n<\/strong><span style=\"font-weight: 400;\"><br \/>\n<\/span>Ms. XXX has lodged his complaint with Financial Commission on the following grounds:<\/span><\/p>\n<p><span style=\"color: #003366;\">The Client used trading account #XXXXX for trading operations on the Forex and CFD market. Having had little to no experience trading the markets, the Client used the services of an investment consultant (a representative of the broker XXXX).<\/span><\/p>\n<p><span style=\"color: #003366;\">The Client states that she believes her trading account deposit was lost due to the deliberate actions of the investment consultant. In the words of the Client in the beginning of the process of working with the consultant, the Client did not conduct any self-directed trades as they relied on the consultant to place trades on her behalf in the trading account using a remote access program called TeamViewer. After the trading account lost considerable equity (approximately $2000) the client was introduced to another investment consultant of the Broker, who conducted a series of trades with metals contracts, as instructed by the Client herself. As a result, the subsequent trades in the account led to the Client losing her full initial deposit amount.<\/span><\/p>\n<p><span style=\"color: #003366;\">The Client is requesting the Broker to return funds in the amount of the initial deposit less $150, which was withdrawn from the account on December 13th 2016 ($2082). The documentary evidence provided by the Client includes a trading account statement for account #XXXXXX, as well as screenshot of an electronic message from the investment consultant with instructions on downloading the TeamViewer program.<\/span><\/p>\n<p><span style=\"color: #003366;\">The Broker believes the Client’s complaint is not justified and does not take any responsibility for the losses incurred on the Clients’ account, because, as stated by the Broker, the Client was made aware of all risks involved in trading leveraged products on the financial market. The appropriate risk disclosures were provided to the Client in electronic format during the account opening process.<\/span><\/p>\n<p><span style=\"color: #003366;\">Moreover, the Broker indicated that all trades conducted on the Client’s account were made either directly by the Client or by the investment consultant after receiving verbal confirmation from the Client.<\/span><\/p>\n<p><span style=\"color: #003366;\">Following the Dispute Resolution Committee’s decision in the case, the Broker did not satisfy the DRC’s decision to compensate the client within 28 days, according to the Rules and Guidelines of the Financial Commission. <\/span><\/p>\n<p><span style=\"color: #003366;\">Because the Broker failed to satisfy the decision, the Commission took emergency action to assist the Client and invoked the use of the Compensation Fund to compensate the Client for their losses identified in the DRC decision. As a result, the Client was awarded $2082 from the Compensation Fund. <\/span><\/p>\n<p><span style=\"color: #003366;\">Furthermore, the Commission took action and expelled the Broker’s membership with the Financial Commission<\/span><\/p>\n<p>&nbsp;<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td colspan=\"2\">Complainant<\/td>\n<td colspan=\"3\">Broker<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">XXX<\/td>\n<td colspan=\"3\">YYY<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Financial Commission Complaint<\/td>\n<td colspan=\"3\">#ZZZ<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\">Complaint Raising Date<\/td>\n<td colspan=\"3\">Complaint Filing Date<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\"><span style=\"font-weight: 400;\">16\/12\/2016<\/span><\/td>\n<td colspan=\"3\"><span style=\"font-weight: 400;\">04\/01\/2017<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\"><b>Complaint response<\/b><span style=\"font-weight: 400;\">:<\/span><\/p>\n<p>The decision for this complaint is based on the information provided by the Client and the Broker.<\/p>\n<p>To ensure an objective investigation of the incident, the Dispute Resolution Committee of the Financial Commission closely examined the documentary evidence provided by the parties to the dispute. Having analyzed the materials of the complaint, the Dispute Resolution Committee has come to the following conclusions:<\/p>\n<ol>\n<li>With regards to the financial losses incurred by the Client due to the trading conducted by the investment consultant it is necessary to note that the Client should have been aware of all the risk associated with using or not using any trading strategy provided by the investment consultant:<\/li>\n<\/ol>\n<ul>\n<li style=\"font-weight: 400;\">According to section 7 of the Customer Agreement<\/li>\n<\/ul>\n<p>7.1 The Company does not consult the Client on the benefits of any specific trade order or otherwise provide any other consulting regarding investments, and the Client agrees that the services do not include investment consultations on financial instruments, base markets or equity. The Client makes trading decisions exclusively of their own accord, including to place trading orders.<\/p>\n<p>7.2 The Company is not required to provide any legal, tax or other advise associated with any trades. If the Client wishes, they can consult with an independent party on such matters before executing a trade.<\/p>\n<ul>\n<li style=\"font-weight: 400;\">The Client completed a Client questionnaire and in doing so should have evaluated their risk tolerance and also provided an acknowledgement that they accept the Terms of service with the Company that states that “the Client shall decide how to manage their account, place orders and make decisions of their own fruition.”<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\">The Company takes adequate steps to provide risk warnings to customers that can result in trading non-exchange traded products, including risk warnings displayed on the Company website and electronic messages addresses to clients:<\/li>\n<\/ul>\n<p>Risk Warning: Trading leveraged products such as CFD’s involves substantial risk of loss and may not be suitable for all investors. Trading such products is risky and you may lose all of your invested capital. Please click here to read full Risk Disclosure. Safekeeping and Brokerage services are provided by XXXX. with license number YYYY, address in ZZZZ. XXXX does not establish accounts to residents or passport holders of certain jurisdictions including Canada and USA.<\/p>\n<ol start=\"2\">\n<li>On the other hand, the Client states that they never agreed to allow the first investment consultant to place trades on her account, verbally or otherwise. In this regard it is important to note that the broker did not provide the Dispute Resolution Committee (DRC) evidence of audio recordings with the Client in a timely manner as set out in the Membership Rules and Guidelines. Thus no evidence was provided indicating that the Client gave verbal agreement to the investment consultant to conduct trades on her account. This puts into question the Broker’s statement regarding the full responsibility of the Client for all the trades conducted in the account.<\/li>\n<\/ol>\n<p>As such, having reviewed all the facts and circumstances of the dispute, the DRC has come to unanimous agreement that all the trades conducted on trading account #XXXXX should be deemed invalid. Given this determination, the Broker must compensate the Client for all losses incurred on the account in the sum of $2082.<\/p>\n<p>This complaint was reviewed by the members of the Dispute Resolution Committee of the Financial Commission and was processed by the Head of the Committee.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Ruled in Favor<\/td>\n<td colspan=\"2\">Compensation<\/td>\n<\/tr>\n<tr>\n<td colspan=\"3\">Client<\/td>\n<td colspan=\"2\"><span style=\"font-weight: 400;\">$ 2082<\/span><\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">If you have any questions regarding this investigation, please send them to the following address info@financialcommission.org<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">Acknowledgement<\/td>\n<\/tr>\n<tr>\n<td colspan=\"5\">I certify that all information was considered by the Dispute Resolution Committee of the Financial Commission and hereby confirm that the decision was made fairly, impartially and without interference. I am confident that the information provided in the document is true.<\/td>\n<\/tr>\n<tr>\n<td>Signature<\/td>\n<td colspan=\"3\">Designation<\/td>\n<td>Date<\/td>\n<\/tr>\n<tr>\n<td> <i>Anatoly Bulanov<\/i><\/td>\n<td colspan=\"3\">\n<p align=\"center\">Head of DRC<\/p>\n<\/td>\n<td><span style=\"font-weight: 400;\">March 7th 2017<\/span><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Complaint Matter Ms. XXX has lodged his complaint with Financial Commission on the following grounds: The Client used trading account #XXXXX for trading operations on the Forex and CFD market. Having had little to no experience trading the markets, the Client used the services of an investment consultant (a representative of the broker XXXX). The [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6381],"tags":[],"class_list":["post-75614","post","type-post","status-publish","format-standard","hentry","category-case-examples"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/75614","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=75614"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/75614\/revisions"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=75614"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=75614"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=75614"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}