{"id":76377,"date":"2018-04-19T14:38:24","date_gmt":"2018-04-19T14:38:24","guid":{"rendered":"https:\/\/financialcommission.org\/?p=76377"},"modified":"2018-04-19T14:38:24","modified_gmt":"2018-04-19T14:38:24","slug":"financial-commission-2017-a-year-in-review-by-forexnewsnow","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/04\/19\/financial-commission-2017-a-year-in-review-by-forexnewsnow\/","title":{"rendered":"Financial Commission 2017 – a Year in Review by ForexNewsNow","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">The Financial Commission recently released its 2017 Annual Report and reported significant growth in its membership, committees, and services for <a href=\"https:\/\/www.forexnewsnow.com\/brokers\/\" target=\"_blank\" rel=\"noopener\">brokers<\/a> and Forex traders. Since 2013, when the Commission was founded, the organization has expanded to provide more services and has experienced a greater interest from the broader worldwide trading community. Accordingly, Financial Commissions is one of the fastest-growing and most recognized independent SRO and EDR body in the global retail Forex industry.<\/p>\n<p style=\"text-align: justify;\"><strong>What is the Financial Commission?<\/strong><\/p>\n<p style=\"text-align: justify;\">Founded in 2013, Financial Commission (operated by FinaCom PLC) is a for-profit independent business that operates as an EDR and SRO and is not a governmental organization nor designated by any sovereign nation. Financial Commission provides services-based &amp; membership-based solutions and maintains brands domiciled in several jurisdictions including Hong Kong (HK), the <a href=\"https:\/\/www.forexnewsnow.com\/brokers\/united-kingdom\/\" target=\"_blank\" rel=\"noopener\">United Kingdom (UK)<\/a> and Saint Vincent and the Grenadines (SVG). The three pillars that uphold Financial Commission’s mission statement are market transparency, efficient dispute resolution, and market participant education.<\/p>\n<p style=\"text-align: justify;\">Supporting self-regulatory efforts is just one of the benefits provided by the Financial Commission as its members join voluntarily – yet members must adhere to strict guidelines to maintain membership and demonstrate transparency, compliance, and integrity.<\/p>\n<p style=\"text-align: justify;\">Financial Commission facilitates an unparalleled dispute resolution process between online brokerages and their end-customers when the inevitable case of trade disputes cannot be resolved between parties.<\/p>\n<p style=\"text-align: justify;\">The subject of each complaint can be as diverse as the underlying broker, product, or customer, yet all disputes share one thing in common which is to seek fair dealings regardless of the financial services products, providers, trading technologies, or pricing issues related to market participants’ transactions, from the complaints that are filed. While dispute resolution services are only available to members, Financial Commission provides a growing array of non-member services such as technology certification solutions and an expanding partner network.<\/p>\n<p style=\"text-align: justify;\"><strong>How is the Commission helping traders?<\/strong><\/p>\n<p style=\"text-align: justify;\">One of the key differences from designated regulatory bodies is that the Commission’s services for Forex traders are absolutely free. Customers of broker members are able to file disputes with no cost to them. Moreover, the Commission regularly receives inquiries from the general trading community and assists all traders with their questions.<\/p>\n<p style=\"text-align: justify;\">It is no surprise that the Commission has become a familiar organization for traders around the world. According to its annual report, the number of complaints received from non-member broker clients in 2017 tripled as compared to 2016. More and more traders are reaching out to the Commission to find out more information on particular brokers, ask for clarification on issues that they’ve experienced or to double-check the status of a broker that the client is thinking about trading with.<\/p>\n<p style=\"text-align: justify;\">The common questions and concerns received from the general trading community help the Commission understand the ongoing issues within the industry and also provide information and tools to allay customer concerns, improve the services of its member brokers and ultimately work to reduce the number of complaints that arise across the industry.<\/p>\n<p style=\"text-align: justify;\">In furthering the mission to help traders the Commission also maintains and regularly updates a Warning List on its website to inform the public of companies that are not recommended to trade with, following numerous reports and complaints filed by customers regarding these firms. In the Commission’s experience, traders often look to this list to check if other clients have experienced any possible wrongdoing with their broker.<\/p>\n<p style=\"text-align: justify;\"><strong>Significance of unbiased and transparent resolutions<\/strong><\/p>\n<p style=\"text-align: justify;\">Given the size and scope of the Forex market, the Commission has seen a significant increase in the amount of compensation sought by customers who file disputes with the Commission. This has made the work of the Dispute Resolution Committee (DRC) ever so important, as the facts of each dispute have to be carefully considered by Committee members in order to provide a determination for compensation. In 2017, the amount of compensations awarded increased exponentially to $1,564,700.00 in 2017, a nearly 1000% rise compared Year-over-Year (YoY) from $157,326 in 2016.<\/p>\n<p style=\"text-align: justify;\"><strong>Improved efficiencies<\/strong><\/p>\n<p style=\"text-align: justify;\">Even as the number of filed complaints with the Commission increased by nearly 500% rising to 764 for the calendar year (or more than 63 per month on average), the Financial Commission demonstrated that its EDR system is highly efficient as the speed of resolving the average complaint improved by 7% compared to 2016. Likewise, the ratio of resolved complaints improved by 15% in 2017, reflecting the increased efficiency of Financial Commission’s dispute resolution process.<\/p>\n<p style=\"text-align: justify;\">Such swift processing of disputes, including the gathering of evidence, consultation by the DRC and ultimately decisions is not currently available anywhere in the world. Moreover, in most of the well-known government-sanctioned regulatory regimes, such disputes would likely take a year if not more to resolve, and in some cases, would require the broker client to pay a processing fee to file a dispute.<\/p>\n<p style=\"text-align: justify;\"><strong>Independent review<\/strong><\/p>\n<p style=\"text-align: justify;\">To provide unbiased and authentic decisions to disputes filed with the Commission, the organization has worked to incorporate independent professionals into the dispute resolution process. Since the Commission’s inception, the Dispute Resolution Committee has been staffed with industry professionals who are experts in trading technology, management, compliance\/legal and advisory services. The Committee members are not employed or otherwise involved in day to day operations of brokers, ensuring that their judgments are impartial. In 2017, the Dispute Resolution Committee added 7 new members.<\/p>\n<p style=\"text-align: justify;\"><strong>Certification services<\/strong><\/p>\n<p style=\"text-align: justify;\">Some of the other services provided by the Financial Commission include certification of financial technology and trading platforms, education providers, as well as issuers of Initial Coin Offerings. Even though it may seem that most trading platforms employ the same basic trading functions, the processes of receiving and displaying price quotes, as well as trade and order execution are important details that vary from one broker to another.<\/p>\n<p style=\"text-align: justify;\">Because there is no single standard to the way trading platforms are to be built or function, the Commission’s certification service lets technology providers improve their commercial reputation and provide traders with high quality and tested trading technologies.<\/p>\n<p style=\"text-align: justify;\">In 2017, the technology certification unit was expanded with the launch of Financial Commission’s ICO Certification service to address the increased demand of technology providers who seek to use blockchain technology to conduct initial coin offerings (ICO) related to their Financial Technology (Fintech) offering.<\/p>\n<p style=\"text-align: justify;\">© Prepared by <a href=\"https:\/\/www.forexnewsnow.com\/top-stories\/forex-industry\/financial-commission-2017-year-review\/\" target=\"_blank\" rel=\"noopener\">ForexNewsNow<\/a><\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>The Financial Commission recently released its 2017 Annual Report and reported significant growth in its membership, committees, and services for brokers and Forex traders. Since 2013, when the Commission was founded, the organization has expanded to provide more services and has experienced a greater interest from the broader worldwide trading community. Accordingly, Financial Commissions is one of [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":76369,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[14],"tags":[],"class_list":["post-76377","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-commission-news"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/76377","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=76377"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/76377\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/76369"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=76377"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=76377"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=76377"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}