{"id":81517,"date":"2018-06-27T11:26:02","date_gmt":"2018-06-27T11:26:02","guid":{"rendered":"https:\/\/financialcommission.org\/?p=81517"},"modified":"2018-06-27T11:52:34","modified_gmt":"2018-06-27T11:52:34","slug":"interview-with-financial-commission-chairman-peter-tatarnikov-conducted-for-the-association-of-forex-dealers-afd-in-russia","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/06\/27\/interview-with-financial-commission-chairman-peter-tatarnikov-conducted-for-the-association-of-forex-dealers-afd-in-russia\/","title":{"rendered":"Interview with Financial Commission Chairman, Peter Tatarnikov Conducted for the Association of Forex Dealers (AFD)","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">June 27th, 2018, The Financial Commission, a leading independent member-driven external dispute resolution (EDR) organization for international online brokerages that participate in global foreign exchange (forex), derivatives, and CFD markets, today published an interview with Financial Commission Chairman, Peter Tatarnikov conducted for the the Association of Forex Dealers (AFD) in Russia. The AFD is the sole SRO accredited by the Bank of Russia, unifying all licensed Forex dealers in Russia.<\/p>\n<p style=\"text-align: justify;\">The original text of the interview in Russian can be found on the AFD website: <a href=\"https:\/\/sroafd.ru\/novosti\/novosti-assotsiatsii\/pyotr-tatarnikov-zarubezhnye-kompanii-seryozno-otnosyatsya-k-regulirovaniyu-rynka-foreks-v-rossijskoj-federatsii.html\" target=\"_blank\" rel=\"noopener\">https:\/\/sroafd.ru\/novosti\/novosti-assotsiatsii\/pyotr-tatarnikov-zarubezhnye-kompanii-seryozno-otnosyatsya-k-regulirovaniyu-rynka-foreks-v-rossijskoj-federatsii.html<\/a>.<\/p>\n<p style=\"text-align: justify;\"><strong>1. How would you evaluate the current state of the Forex market in Russia?<\/strong><\/p>\n<p style=\"text-align: justify;\">In my view, the Forex market in Russia is growing quite steadily. We see a gradual rise in the number of Forex customers and trading volumes among the licensed FX brokers. I hope that very soon we will be able to discuss proposed amendments to the current regulations that are aimed at simplifying the way brokers work with their clients. Also, I see very positive steps being taken by the Association of Forex Dealers (AFD), which improve the financial knowledge of traders, as well as combat dishonest business practices in the industry. All of these initiatives contribute to the growth of the Forex market in Russia.<\/p>\n<p style=\"text-align: justify;\"><strong>2. Do you support the AFD proposal for simplified client identification rules for forex dealers? Please provide some examples of jurisdictions, where simplified identification rules are used.<\/strong><\/p>\n<p style=\"text-align: justify;\">Yes, the practice of online client verification in “know your customer” (KYC) procedures is widely used in many countries. In the US, the UK and Australia online verification has been available for quite a long time. In these countries, clients provide an electronic copy of their ID and\/or address verification and brokers must store this data for at least five years. This policy makes the account opening process easier for the customer and reduces document flow for brokers. It is important to point out, that brokers using simplified verification procedures always conduct supplemental checks in international databases and make a decision on opening an account according to KYC rules and requirements.<\/p>\n<p style=\"text-align: justify;\"><strong>3. What is your opinion on the latest tightening of regulations by European regulators for the off-exchange financial market? Including changes in leverage, access to certain products for qualified investors and the banning of binary options?<\/strong><\/p>\n<p style=\"text-align: justify;\">Proposals for regulatory changes in Europe have been discussed amongst brokers and regulators for several years, so for many market participants, the new rules will not come as a surprise. The European Securities and Markets Authority (ESMA) is taking steps to protect traders. Having done its analysis, the regulator determined that now is the time to limit traders’ risks, introduce some restrictions to limit unfair business practices and increase the financial knowledge of European citizens. As for binary options &#8211; European regulators have previously expressed doubt in the advantages of such investments and have now cemented their conclusions in the form of a law.<\/p>\n<p style=\"text-align: justify;\"><strong>4. How does the Financial Commission handle inquiries from the general public? How many disputes are resolved in favor of traders?<\/strong><\/p>\n<p style=\"text-align: justify;\">We receive a large number of inquiries from various countries with questions regarding trading, choosing a broker and requests to check the validity of certain information regarding brokers and financial technology providers. In the process of replying to these inquiries we, generally, educate traders and improve their understanding of the market as a whole, as well as trading and risks, that are associated with Forex.<\/p>\n<p style=\"text-align: justify;\">With regards to complaints that are submitted in relation to our broker members, according to our Annual Report from 2017, of 764 submitted complaints, 153 or 20% were resolved in favor of the client. This demonstrates that a portion of complaints concern issues where the Commission cannot make a ruling in favor or against a party and that there are traders who simply do not have a sufficient understanding about the trading policies and services that their broker provides.<\/p>\n<p style=\"text-align: justify;\">Every complaint received by the Commission is processed with the Dispute Resolution Committee (DRC). The DRC conducts an analysis of the complaint and reviews information provided by the parties in the investigative stage. The DRC team communicates with the client and the broker to find a resolution at this stage of the process. If a resolution cannot be found, the DRC makes a decision based on facts provided by both parties.<\/p>\n<p style=\"text-align: justify;\"><strong>5. What are the criteria for the Warning List that is published on your website?<\/strong><\/p>\n<p style=\"text-align: justify;\">The Warning List is based on facts and documents received by the Commission, which indicate possible fraudulent or dishonest practices by companies. The Commission carefully reviews and attempts to confirm this information. If the information proves to be authentic, the Commission makes attempts to contact the broker and receive a response regarding the negative information. In many cases, we do not receive a response and are forced to place the company in the Warning List in order to warn the general public about risks associated with such brokers.<\/p>\n<p style=\"text-align: justify;\"><strong>6. What tendencies do you see in the “de-offshorization” of the financial market, particularly the Forex market?<\/strong><\/p>\n<p style=\"text-align: justify;\">We are noticing that some major brokers, which have historically operated in Russia, are now making the decision to apply for a Forex dealer license in Russia. At the same time, according to the latest reports, other foreign companies have stopped accepting new customers from Russia. This tells us that foreign brokers are aware of the Forex regulations in Russia and are serious about bringing their businesses in line with these relatively new rules.<\/p>\n<p style=\"text-align: justify;\"><strong>7. Does the Commission plan to open additional offices? If yes, then what is the reasoning behind it?<\/strong><\/p>\n<p style=\"text-align: justify;\">Today the Financial Commission services more than 30 brokers and their clients in eight different languages. Our representatives are strategically located in different regions of the world which lets us quickly and thoroughly process complaints and interact with both brokers and their clients. As such, our current office in Hong-Kong will remain our headquarters for the near future.<\/p>\n<p style=\"text-align: justify;\"><strong>8. Your Rules and Guidelines have clauses relating to the expulsion of members from the organization. In most cases, what are the reasons why brokers are expelled from the Financial Commission?<\/strong><\/p>\n<p style=\"text-align: justify;\">The expulsion of a member takes place when a broker grossly violates the Rules and Guidelines of the Commission. This could be the result of not executing a complaint resolution from the DRC, a lack of risk warnings and disclaimers provided to customers, the loss of a license to operate, failure to pay membership dues or other situations. In such cases, the member is provided with an official notice of violations and is given a particular period of time to rectify the issues. If the member fails to do so, the Board of Directors of the Commission can issue a decision to expel the broker within 7 days from the time the decision for expulsion is made.<\/p>\n<p style=\"text-align: justify;\"><strong>9. Please tell us about the Commission’s future plans. Are there any conferences or other events planned?<\/strong><\/p>\n<p style=\"text-align: justify;\">The Financial Commission actively participates in international industry conferences and events in Europe and Asia. You can find us and meet us at events such as Finance Magnates London, IFX Cyprus, Asia Trading Summit. We often meet with our members and partners to improve our mutual cooperation.<\/p>\n<p style=\"text-align: justify;\">In the coming months, we hope to launch a set of additional services for our members which will be completely free of charge and will help improve the practices and reputations of our broker-members.<\/p>\n<p style=\"text-align: justify;\"><strong>10. What would you recommend to an investor who has chosen the Forex market? What tips would you give them?<\/strong><\/p>\n<p style=\"text-align: justify;\">You need to have a lot of patience and knowledge. It is important to first go through an education course or learn to trade using educational materials and practice on a demo or practice account. The Forex market is very risky, but by maintaining a reasonable risk-reward ratio there is a possibility of success. Choosing the right broker is also very important. It is worthwhile to carefully study the history of the company and its trading policies, as well as find out what licenses the company holds and where it is registered.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>June 27th, 2018, The Financial Commission, a leading independent member-driven external dispute resolution (EDR) organization for international online brokerages that participate in global foreign exchange (forex), derivatives, and CFD markets, today published an interview with Financial Commission Chairman, Peter Tatarnikov conducted for the the Association of Forex Dealers (AFD) in Russia. The AFD is the [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":81523,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[14,12,15,16],"tags":[],"class_list":["post-81517","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-commission-news","category-company-news-news-events","category-press-release","category-press-releases-news-events"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/81517","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=81517"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/81517\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/81523"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=81517"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=81517"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=81517"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}