{"id":84088,"date":"2018-08-06T14:27:03","date_gmt":"2018-08-06T14:27:03","guid":{"rendered":"https:\/\/financialcommission.org\/?p=84088"},"modified":"2018-08-06T14:29:20","modified_gmt":"2018-08-06T14:29:20","slug":"financial-commission-encourages-best-execution-standards-for-members-with-upcoming-launch-of-execution-certification-service","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/08\/06\/financial-commission-encourages-best-execution-standards-for-members-with-upcoming-launch-of-execution-certification-service\/","title":{"rendered":"Financial Commission Encourages Best Execution Standards for Members with Upcoming Launch of Execution Certification Service","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">Having met the various preliminary requirements of MiFID II, brokers are now dealing with the directive’s best execution requirements under Regulatory Technical Standards (commonly known as RTS) 27 and 28. Under RTS 27 and 28, brokers need to adhere to new standards on publishing data regarding execution quality in an effort to increase transparency for customers and the industry as a whole.<\/p>\n<p style=\"text-align: justify;\">When implementing best execution, brokers must take into account a number of different factors.  RTS 27 of MiFID II, which took effect on June 30th, 2018 and is a quarterly requirement for brokers, sets out these characteristics under the obligation to execute orders on terms most favorable to the client, where firms must consider<i> “price, costs, speed, likelihood of execution and settlement, size, nature or any other relevant consideration”<\/i>. RTS 28 is the more immediate concern for financial firms and investment managers in particular. It took effect April 30th, 2018 and requires firms to disclose their top 5 execution venues or brokers and summarizes execution quality achieved.<\/p>\n<p style=\"text-align: justify;\">Given that most European brokers have already begun to satisfy the above-mentioned standards of the MiFiD II directive from a data reporting perspective, it is now important for brokers to begin disclosing their execution policy in more detail to their customers. Indeed, the requirement is that appropriate information from the execution policy provided to clients must explain clearly, “<i>in sufficient detail and in an easy to understand way<\/i>”, how the broker will execute orders for the client.<\/p>\n<p style=\"text-align: justify;\">Furthermore, brokers must explain to their customers how they are “taking all sufficient steps” to ensure the best execution is being provided, as required by MiFiD II. While it is not yet clear how the European Securities and Markets Authority (ESMA) will enforce best execution practices, we can expect that the regulator will begin to analyze the reporting data, as well as individual brokers’ policies and changes to such policies following data analysis in an effort to “improve” executions.<\/p>\n<p style=\"text-align: justify;\">In keeping with its goal of improving the Forex marketplace for all participants, the Financial Commission has always supported the idea of best execution practices, as they have been implemented previously most notably by the National Futures Association (NFA) in the United States. In an effort to support the new regulatory initiatives, the Financial Commission has taken a proactive approach and developed a new trade execution certification service with one of its partners.<\/p>\n<p style=\"text-align: justify;\">The new trade execution certification service will be launched in the coming weeks and will provide for the analysis of trade executions by Financial Commission’s broker members on a monthly basis. The basic service does not fully satisfy MiFiD II requirements but is instead focused on providing traders with a form of assurance that there is at least some oversight with regards to their broker’s execution. The analysis will be conducted using a robust standardized technical approach. This will ensure that trade executions are checked and analyzed on an ongoing, regular basis and not just during the resolution of a particular client dispute with their broker. Meanwhile, broker clients can check their brokers’ execution at any time online and be assured that their trades are conducted in a fair and transparent manner. This will allow for quality control of the most important service being provided to traders – execution of their trades.<\/p>\n<p style=\"text-align: justify;\">This initiative is supported by Financial Commission’s members and participation in the execution certification is absolutely voluntary, as with membership in the Financial Commission. As such, both member brokers and the Commission are committed to creating a more transparent marketplace and support best business practices. Brokers will be given the option of upgrading to a service that is more targeted to MiFiD II compliance.<\/p>\n<p style=\"text-align: justify;\">The Financial Commission will issue an official launch release once the new service is available. In the meantime, for more information on the new service, please contact us at <a href=\"mailto:info@financialcommission.org\">info@financialcommission.org<\/a>.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>Having met the various preliminary requirements of MiFID II, brokers are now dealing with the directive’s best execution requirements under Regulatory Technical Standards (commonly known as RTS) 27 and 28. Under RTS 27 and 28, brokers need to adhere to new standards on publishing data regarding execution quality in an effort to increase transparency for [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":84089,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[14,12,15,16],"tags":[],"class_list":["post-84088","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-commission-news","category-company-news-news-events","category-press-release","category-press-releases-news-events"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/84088","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=84088"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/84088\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/84089"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=84088"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=84088"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=84088"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}