{"id":86329,"date":"2018-09-11T11:27:10","date_gmt":"2018-09-11T11:27:10","guid":{"rendered":"https:\/\/financialcommission.org\/?p=86329"},"modified":"2018-09-11T11:27:10","modified_gmt":"2018-09-11T11:27:10","slug":"herding-behavior-on-social-trading-platforms","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/09\/11\/herding-behavior-on-social-trading-platforms\/","title":{"rendered":"Herding Behavior on Social Trading Platforms","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">In behavioral finance, herding occurs when traders make the same decisions either by intentionally imitating others, or unintentionally as a result of acting on common information. In recent years, the notion of herding has been capitalized on by brokerage firms and incorporated into online trading, creating a novel trading environment known as social trading.<\/p>\n<p style=\"text-align: justify;\"><strong>What is Social Trading?<\/strong><\/p>\n<p style=\"text-align: justify;\">Social trading combines the conventional online trading model with the features offered by social media platforms. The result is a highly transparent marketplace called a social trading platform (STP), where participants can communicate, collaborate on strategies, and even explicitly copy each other’s trades in real-time using a mirror trading algorithm.<\/p>\n<p style=\"text-align: justify;\">STPs require complete disclosure and free flow of information from participants regarding their profiles as well as their trading activities. This means that whenever a person executes a trade, it instantly becomes public on their personal profile. Rational people would only be willing to disclose information if they were getting something in return. Accordingly, STPs have incentivized information sharing through compensation schemes by allowing traders to become money managers where they can earn monetary rewards when others copy their trades. This essentially categorizes participants into two main groups: trade leaders and copiers.<\/p>\n<p style=\"text-align: justify;\">Trade leaders aim to build a superior track record by executing original trades in order to attract potential copiers, who in turn allocate their funds to a single trade or all future trades of a certain trade leader through a simple click of a button.<\/p>\n<p style=\"text-align: justify;\">The high level of transparency on STPs puts individuals under a spotlight of constant reciprocal scrutiny. This state is known as a scopic regime, and is meant to characterize the organization of an activity, such as trading, where participants observe each other’s activities in real time. This distinguishes STPs from conventional financial settings and institutions, such as mutual funds and hedge funds, where information on holdings and performance is only disclosed periodically by the former and voluntarily by the latter.<\/p>\n<p style=\"text-align: justify;\"><strong>Value in Order Flow Data<\/strong><\/p>\n<p style=\"text-align: justify;\">The collection of all trading records on a platform is known as the order flow. This aggregated data can be particularly valuable to traders in the foreign exchange market. Studies have shown that it can be used to forecast exchange rates. The importance of order flow information is further accentuated by the fact that there are infrequent announcements of fundamental data by governments and central banks.<\/p>\n<p style=\"text-align: justify;\">Given the fast-paced world of electronic trading, the limited capacity of individuals to analyze thousands of investment opportunities, the ease of access to detailed order flow data, and the aspiration to jump-start a career as a money manager and earn performance compensation, trade leaders on STPs may be highly tempted to avoid conducting their own analyses, and simply imitate their peers.<\/p>\n<p style=\"text-align: justify;\">Consequently, one can argue that the competition to attract copiers in the scopic environment would augment the limitations and personal biases of trade leaders, thus producing excess and perpetual localized herding behavior as traders continuously rely on public order flow as a steady source of information.<\/p>\n<p style=\"text-align: justify;\">Nevertheless, the efficient market hypothesis postulates that given an environment with high information transparency, prices should reflect all publicly disclosed information. Hence, despite the fact that STPs facilitate imitation, herding behavior should erode, as the information contained in public order flow data would already be incorporated into security prices. Moreover, retail traders in the foreign exchange market are not likely to possess private fundamental information. Hence, rational trade leaders would realize this and avoid herding.<\/p>\n<p style=\"text-align: justify;\">Given the lack of research on this novel phenomenon, Roland Gemayel and Alex Preda investigated whether the scopic regime on STPs induces higher localized levels of and persistence in herding compared to those found in traditional trading environments.<\/p>\n<p style=\"text-align: justify;\"><strong>Evidence on Herding under a Scopic Regime<\/strong><\/p>\n<p style=\"text-align: justify;\">In general, Roland and Alex find that the overall level of herding under the scopic regime is significantly higher compared to those found in other traditional trading environments. Furthermore, they examine herding for different samples of traders based on trading intensity, leverage, and trade size and find that:<\/p>\n<ul>\n<li style=\"text-align: justify;\">Trade leaders herd more when market information is scarce, suggesting that the scopic environment encourages traders to look at the activity of others as a source of information when making trading decisions;<\/li>\n<li style=\"text-align: justify;\">Risk-seeking trade leaders herd less, which is in line with the idea that risk takers are overconfident in their own decisions;<\/li>\n<li style=\"text-align: justify;\">Herding increases as investment size increases, since traders want to avoid the disappointment associated with underperforming their peers on large positions; and<\/li>\n<li style=\"text-align: justify;\">Herding in the scopic environment persists across several time periods at much higher levels compared to herding in traditional environments.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">These findings emphasize that the excess and perpetual herding produced by the scopic regime is intentional and arises due to the limitations and biases of retail traders.<\/p>\n<p style=\"text-align: justify;\"><strong>Implications of Herding<\/strong><\/p>\n<p style=\"text-align: justify;\">The high level of and persistence in herding behavior among trade leaders on STPs unveils several implications.<\/p>\n<p style=\"text-align: justify;\">From a macroeconomic perspective, intentional herding can increase volatility and destabilize markets due to the high correlation among trades. This issue may quickly materialize as STPs increase in popularity.<\/p>\n<p style=\"text-align: justify;\">Second, regarding copiers who diversify their investments across multiple trade leaders, the benefits of diversification are significantly diminished in the presence of herding. This is because trade leaders who herd are effectively trading the same securities in the same direction and at the same time. Thus, copiers should take this into account when selecting the trade leaders they wish to allocate their funds to.<\/p>\n<p><em>Read the full article and references:<\/em> <a href=\"https:\/\/www.tandfonline.com\/eprint\/GZxHZqmeN2TzfvIICE4y\/full\" target=\"_blank\" rel=\"noopener\">https:\/\/www.tandfonline.com\/eprint\/GZxHZqmeN2TzfvIICE4y\/full<\/a><\/p>\n<p style=\"text-align: justify;\"><a href=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022.png\"><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter wp-image-84267\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022.png\" alt=\"\" width=\"250\" height=\"250\" srcset=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022.png 380w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-300x300.png 300w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-150x150.png 150w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-180x180.png 180w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-230x230.png 230w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-350x350.png 350w\" sizes=\"(max-width: 250px) 100vw, 250px\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><strong>Roland Gemayel, PhD<\/strong><\/p>\n<p style=\"text-align: justify;\">Roland Gemayel is Chief Dealer at Lykke and holds numerous degrees, including a PhD in Finance from Kings College London, He is a member of the Financial Commission’s Dispute Resolution Commitee and a contributor to our Expert Opinion column.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>In behavioral finance, herding occurs when traders make the same decisions either by intentionally imitating others, or unintentionally as a result of acting on common information. In recent years, the notion of herding has been capitalized on by brokerage firms and incorporated into online trading, creating a novel trading environment known as social trading. What [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":84267,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6553],"tags":[],"class_list":["post-86329","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-expert-opinion"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/86329","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=86329"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/86329\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/84267"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=86329"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=86329"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=86329"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}