{"id":88205,"date":"2018-10-04T15:50:43","date_gmt":"2018-10-04T15:50:43","guid":{"rendered":"https:\/\/financialcommission.org\/?p=88205"},"modified":"2018-10-11T07:51:50","modified_gmt":"2018-10-11T07:51:50","slug":"self-awareness-and-the-disposition-effect","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/10\/04\/self-awareness-and-the-disposition-effect\/","title":{"rendered":"Self-awareness and the Disposition Effect","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">We have all heard the expression “cut your losses” whenever it has become evident that we are wasting valuable time and resources on something that is deemed as failing. As logical as this advice may be, not everyone abides by it especially when it comes to financial decision making.<\/p>\n<p style=\"text-align: justify;\">In finance, this phenomenon is known as the disposition effect and represents a trader’s tendency to realize gains quickly while holding on to losses. Academics have identified several factors that contribute to this behavioral bias including mental accounting, loss-aversion, regret-aversion, and mean-reversion in asset prices.<\/p>\n<p style=\"text-align: justify;\">The disposition effect has been associated with poor financial performance. Nevertheless, several researchers have argued that traders can learn from their past trading activities to reduce the disposition effect. This means that, as traders become more aware of the impact of the disposition effect on their performance, they are more likely to avoid realizing gains too early and holding on to losses for too long.<\/p>\n<p style=\"text-align: justify;\">What happens when traders find themselves in an environment where their actions are constantly on display, and where poor performance can instantly tarnish their trading reputation? Under such a setting, traders may exhibit a heightened sense of self-consciousness such that they become more aware of the consequences associated with displaying poor performance. Therefore, they would adapt their behavior to avoid displaying poor outcomes by limiting losses instead of holding on to them, and seek to realize larger gains in order to showcase their superior trading skills. Consequently, an environment that rewards good performance yet promotes constant scrutiny is expected to erode the disposition effect.<\/p>\n<p style=\"text-align: justify;\">To investigate this, Roland Gemayel and Alex Preda compare the disposition effect of traders on a traditional trading platform to that of traders on a social trading platform (or STP).<\/p>\n<p style=\"text-align: justify;\"><strong>Social Trading Platforms and the Scopic Regime<\/strong><\/p>\n<p style=\"text-align: justify;\">An STP is a novel concept that embeds online trading within a social media platform, creating a highly transparent marketplace where all information is public. This high level of transparency puts individuals under constant reciprocal scrutiny, which is an environment known as a scopic regime. This environment differs from traditional trading settings where trading records are held privately by the broker or the exchange.<\/p>\n<p style=\"text-align: justify;\">Participants on an STP can be classified into two groups: trade leaders and copiers. Trade leaders are those who aspire to become money managers by publicizing their reputation and managing the capital allocated to them by copiers in return for monetary rewards. Copiers can choose to copy a single trade or all future trades of a trade leader, and do not need to intervene except to end the copying relationship. In addition, copiers can diversify their capital across several trade leaders with different trading styles to avoid having excessive exposure to a single style.<\/p>\n<p style=\"text-align: justify;\"><strong>The Disposition Effect under Different Trading Settings<\/strong><\/p>\n<p style=\"text-align: justify;\">Roland and Alex find ample evidence of a weaker disposition effect for traders on the STP (i.e. under a scopic environment) compared to traders in a traditional trading setting. This supports the notion that the scopic regime, through its state of constant reciprocal scrutiny, erodes the disposition effect. This happens as traders become more self-conscious about their actions and aware of the consequences associated with poor performance on their reputation. As a result, they choose to realize and limit losses in order to avoid holding unjustifiable paper losses, while seeking to realize larger gains as a mechanism to signal their superior trading ability to potential copiers.<\/p>\n<p style=\"text-align: justify;\"><strong>A Behavioral Risk Adjustment<\/strong><\/p>\n<p style=\"text-align: justify;\">One principal implication of the authors’ study is that when individuals are under constant observation, they tend to alter their behavior from loss-averse to risk-averse. This occurs as traders choose to limit their exposure to losing investments, which reduces the risk associated with holding on to large losing investments.<\/p>\n<p style=\"text-align: justify;\">This relationship can be valuable to retail brokers and regulators, whose aim is to help traders adopt more effective risk management techniques. By incorporating social trading features into traditional online platforms, brokers would be enabling a scopic mechanism that is fueled by the collective scrutiny of all participants and that yields a risk-adjustment behavior at the individual trader level.<\/p>\n<p style=\"text-align: justify;\"><em>Click <\/em><a href=\"https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0167268118302191\" target=\"_blank\" rel=\"noopener\"><em>here <\/em><\/a><em>for full article.<\/em><\/p>\n<p><strong>About Roland <\/strong><b>Gemayel<\/b><\/p>\n<table style=\"width: 100%; border-collapse: collapse;\" border=\"0\">\n<tbody>\n<tr>\n<td style=\"width: 20.8515%;\"><a href=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022.png\"><img decoding=\"async\" class=\"alignnone wp-image-84267\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022.png\" alt=\"\" width=\"200\" height=\"200\" srcset=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022.png 380w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-300x300.png 300w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-150x150.png 150w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-180x180.png 180w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-230x230.png 230w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0022-350x350.png 350w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/a><\/td>\n<td style=\"width: 79.1485%; text-align: justify; padding-left: 30px;\">Roland Gemayel holds numerous degrees, including a PhD in Finance from Kings College in London, as well as a Master of Science with distinction from Cass Business School. Prior to joining Lykke, Roland was the Chief Dealer at Maximus FX and is also the founder of eSocialTrader – a financial resource on the topic of social trading, where Roland publishes opinions, experience, and research findings on the growing phenomenon of social trading. His work is published in top academic finance journals. Roland is a senior finance professional with over seven years of international experience in risk management, market making, financial modeling, consulting, product development, business operations, and strategy. His current work at Lykke as the chief dealer involves developing market making algorithms and building performance metrics and risk systems to ensure steady growth of trading operations.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>We have all heard the expression “cut your losses” whenever it has become evident that we are wasting valuable time and resources on something that is deemed as failing. As logical as this advice may be, not everyone abides by it especially when it comes to financial decision making. In finance, this phenomenon is known [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":84267,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6553],"tags":[],"class_list":["post-88205","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-expert-opinion"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/88205","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=88205"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/88205\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/84267"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=88205"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=88205"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=88205"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}