{"id":88692,"date":"2018-10-11T15:00:02","date_gmt":"2018-10-11T15:00:02","guid":{"rendered":"https:\/\/financialcommission.org\/?p=88692"},"modified":"2018-10-11T15:01:31","modified_gmt":"2018-10-11T15:01:31","slug":"heterogeneity-and-skill-in-the-foreign-exchange-market","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/10\/11\/heterogeneity-and-skill-in-the-foreign-exchange-market\/","title":{"rendered":"Heterogeneity and Skill in the Foreign Exchange Market","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">An important notion that has been debated in financial literature is market heterogeneity. Traditional financial models adopt the popular assumption that markets are efficient and that participants act rationally such that their actions are homogeneous. Nevertheless, studies in behavioral finance provide significant evidence of patterns and biases which render the assumption of homogeneity too simplistic and idealistic. Heterogeneity in financial markets can be defined as significant diversity in expectations of asset prices.<\/p>\n<p style=\"text-align: justify;\"><strong>Heterogeneity<\/strong><\/p>\n<p style=\"text-align: justify;\">Many academics have argued that homogeneity is a very strong assumption, which does not hold, especially in the presence of speculative markets. This is because individuals exhibit different performance outcomes, and in many cases irrational behavior depending on the state of the market. Moreover, individuals may interpret the same piece of information differently due to their personal biases, thus leading to different conclusions about financial markets. As such, there has been a growing branch of literature, which advocates that financial markets are in fact heterogeneous and that one should take into account this phenomenon when examining asset returns as well as the performance of investors.<\/p>\n<p style=\"text-align: justify;\"><strong>Trading Skills and Exogenous Factors<\/strong><\/p>\n<p style=\"text-align: justify;\">I investigate whether traders possess genuine trading skills, and how market volatility affects their decisions. Using a large dataset of retail FX traders on the EUR\/USD market I find significant evidence of heterogeneity in performance and expectations, which persists throughout their trading career.<\/p>\n<p style=\"text-align: justify;\">I show that while around 68% of traders have the ability to correctly predict future price changes more than half of the time, only around 22.8% have the ability to generate overall positive returns. In addition, around 27% of traders have the ability to favorably adjust their position size based on the magnitude of the change in market prices.<\/p>\n<p style=\"text-align: justify;\">Moreover, I find that volatility has a detrimental impact on performance. However, as individuals learn to understand it they adjust for it in their trading decisions.<\/p>\n<p style=\"text-align: justify;\"><strong>The Effect of Behavioural Biases on Performance and Skill<\/strong><\/p>\n<p style=\"text-align: justify;\">Finally, I investigate how five common behavioral biases affect traders’ performance. I find that skilled traders are herd initiators such that they are closely watched and mimicked by others. Skilled traders exhibit the disposition effect, whereby they are more likely to realize small gains and hold on to large losses. In addition, skilled traders are sensation seekers, meaning that they tend to use leverage to exploit price changes; however, they tend to avoid extreme levels of leverage which can be detrimental to their performance. Skilled traders are more likely to be inconsistent in the amount of leverage and margin they use, which is explained by their ability to adjust their leverage ratio depending on the state of the market and their confidence in their trading decision.<\/p>\n<p style=\"text-align: justify;\">These behavioral patterns can also be used from a broker’s perspective in order to distinguish and categorize clients into different behavioral groups in order to hedge against those who are likely to be top performers based on their behavioral characteristics.<\/p>\n<p>Read the full article and references: <a href=\"https:\/\/kclpure.kcl.ac.uk\/portal\/files\/97918343\/2018_Zamboglou_Demetrios_1061417_ethesis.pdf\" target=\"_blank\" rel=\"noopener\">https:\/\/kclpure.kcl.ac.uk\/portal\/files\/97918343\/2018_Zamboglou_Demetrios_1061417_ethesis.pdf<\/a><\/p>\n<p><strong>Information about Demetrios Zamboglou<\/strong><\/p>\n<table style=\"width: 100%; border-collapse: collapse;\" border=\"0\">\n<tbody>\n<tr>\n<td style=\"width: 24.5633%;\"><a href=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818.png\"><img decoding=\"async\" class=\"alignnone wp-image-84304\" src=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818.png\" alt=\"\" width=\"200\" height=\"200\" srcset=\"https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818.png 380w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818-300x300.png 300w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818-150x150.png 150w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818-180x180.png 180w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818-230x230.png 230w, https:\/\/financialcommission.org\/wp-content\/uploads\/2018\/08\/0023-e1539269678818-350x350.png 350w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/a><\/td>\n<td style=\"width: 75.4367%; text-align: justify; padding-left: 30px;\">Demetrios is a multi-award winning executive and academic financial market specialist, holding a Fellow Charter Membership from the Chartered Institute of Securities and Investments (CISI) and he is the recipient of the European Commission (2017), Microsoft Research Grant (2016), the Amazon Web Services Award (2014) and the 30 under 30 prize by Square Mile Magazine in 2011. Dr Zamboglou obtained his MEng in Computer Systems Engineering with concentration in Formula Engines from Lancaster University, and his MSc from CASS Business School, where he specialised in IPOs and financial markets. Dr Zamboglou holds a PhD from King’s College London in Behavioural Finance. Demetrios Zamboglou is the Chief Business Developer Officer of Lykke AG, a financial technology company, responsible for the Firm’s International Business. Dr. Zamboglou joined the Firm in November 2016 from FXTM, where he led the firm’s UK operations. Prior to that, he held progressively senior roles as a corporate executive, risk manager, and quantitative analyst. Before Lykke, Dr. Zamboglou held Executive leadership roles at FXTM, zebrafx and FOREX CLUB specialising in issues including business development, strategy, risk management, market-making, and compliance.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>An important notion that has been debated in financial literature is market heterogeneity. Traditional financial models adopt the popular assumption that markets are efficient and that participants act rationally such that their actions are homogeneous. Nevertheless, studies in behavioral finance provide significant evidence of patterns and biases which render the assumption of homogeneity too simplistic [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":84304,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[6553],"tags":[],"class_list":["post-88692","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-expert-opinion"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/88692","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=88692"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/88692\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/84304"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=88692"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=88692"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=88692"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}