{"id":94030,"date":"2018-12-20T15:25:17","date_gmt":"2018-12-20T15:25:17","guid":{"rendered":"https:\/\/financialcommission.org\/?p=94030"},"modified":"2018-12-20T15:43:28","modified_gmt":"2018-12-20T15:43:28","slug":"financial-commission-launches-tradefora-market-price-widget-to-enhance-pricing-transparency","status":"publish","type":"post","link":"https:\/\/financialcommission.org\/2018\/12\/20\/financial-commission-launches-tradefora-market-price-widget-to-enhance-pricing-transparency\/","title":{"rendered":"Financial Commission Launches Tradefora Market Price Widget To Enhance Pricing Transparency","gt_translate_keys":[{"key":"rendered","format":"text"}]},"content":{"rendered":"<p style=\"text-align: justify;\">December 20th, 2018, The Financial Commission today announces the launch of the <a href=\"https:\/\/financialcommission.org\/tradefora\/\">Tradefora<\/a> <a href=\"https:\/\/financialcommission.org\/tradefora\/\">Composite Index (TCI)<\/a> widget on its official website to enhance pricing transparency for FX, CFD, and digital asset traders.<\/p>\n<p style=\"text-align: justify;\">The Tradefora widget is available to all traders absolutely free and offers a variety of actual pricing data for many popular Forex pairs, Contracts for Difference (CFDs) and digital currencies, including Bitcoin, Etherium, Dash and others. Traders can now easily compare their trade prices with an index of liquidity providers and brokerages in several time frames, from seconds to days. Traders can also access historical rates through the widget for previous time periods.<\/p>\n<p style=\"text-align: justify;\">To use the widget, simply navigate to the <a href=\"https:\/\/financialcommission.org\/tradefora\/\">dedicated widget page<\/a>, select a product, timeframe, trade direction, and the time frame to look up the rates. To find a particular price point, use your mouse to move the cursor to the desired time on the chart to see the actual market price for that period.<\/p>\n<p style=\"text-align: justify;\">By launching the complimentary widget on its website, the Financial Commission reaffirms its commitment to transparency and best practices for the Forex, CFD and digital asset industries. Along with the new tool from Tradefora, Financial Commission website visitors can also <a href=\"https:\/\/financialcommission.org\/members\/participating-members-of-the-financial-commission\/\">review the latest results of order execution quality audits<\/a> of its Member firms, which are conducted monthly by Verify My Trade. In providing the new price comparison tool, the Commission is giving traders across the world added piece of mind regarding the costs associated with trading.<\/p>\n<p style=\"text-align: justify;\"><strong>About Tradefora<\/strong><\/p>\n<p style=\"text-align: justify;\">Founded in 2015, Tradefora&#8217;s mission is to help protect the interests of each retail traders and to bring transparency to the OTC FX, CFDs, and margin crypto trading. It is privately funded by OTC industry veterans and not associated with any broker and therefore aimed at providing an impartial 360-degree view on behind the scenes pre-trade and post-trade pricing and execution behaviors.<\/p>\n<p style=\"text-align: justify;\">Tradefora allows traders to connect their live trading accounts with Tradefora’s Automated TradeGuard feature. Investors can look up the execution speed and quality of the trades they place in their brokerage account, as well as see how much actual costs they have incurred on each trade, including effective spreads, swaps, commission, and most importantly &#8211; hidden costs like slippage requires and rejects. Likewise, traders can compare their order execution prices with composite tick-by-tick data gathered from multiple sources with millisecond precision. This way traders can be more certain of their broker trading account performance and how it compares to the industry averages and get an accurate representation of the costs they have paid for trading.<\/p>\n<p style=\"text-align: justify;\"><strong>About Financial Commission<\/strong><\/p>\n<p style=\"text-align: justify;\">Founded in 2013, the Financial Commission is a leading independent member-driven external dispute resolution (EDR) organization for international online brokerages that participate in global foreign exchange (forex), derivatives, CFD and digital currency markets.<\/p>\n<p style=\"text-align: justify;\">Financial Commission provides efficient compliance and certification solutions to its members, alongside its External Dispute Resolution (EDR) mechanism that serves as an effective channel for processing complaints from clients of member firms.<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"excerpt":{"rendered":"<p>December 20th, 2018, The Financial Commission today announces the launch of the Tradefora Composite Index (TCI) widget on its official website to enhance pricing transparency for FX, CFD, and digital asset traders. The Tradefora widget is available to all traders absolutely free and offers a variety of actual pricing data for many popular Forex pairs, [&hellip;]<\/p>\n","protected":false,"gt_translate_keys":[{"key":"rendered","format":"html"}]},"author":13,"featured_media":94051,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[14,12,15,16],"tags":[],"class_list":["post-94030","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-commission-news","category-company-news-news-events","category-press-release","category-press-releases-news-events"],"acf":[],"gt_translate_keys":[{"key":"link","format":"url"}],"_links":{"self":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/94030","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/comments?post=94030"}],"version-history":[{"count":0,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/posts\/94030\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media\/94051"}],"wp:attachment":[{"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/media?parent=94030"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/categories?post=94030"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/financialcommission.org\/wp-json\/wp\/v2\/tags?post=94030"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}